-------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /proj/kohlhepplab/projects/selection_injury/analysis_instrument/log/01_02_run_heckprob.log
  log type:  text
 opened on:  17 Jan 2025, 11:12:30

. set more off

. set scheme cleanplots

. 
. 
. ********* RUN MAIN ANALYSIS

. use data/01_01_estimation_sample, clear

. cor work adj_div_8_leave_count
(obs=259,080)

             |     work a~8_le~t
-------------+------------------
        work |   1.0000
adj_div_8_~t |   0.3553   1.0000


. cor work adj_div_8_leave_count if dayofweek==1
(obs=35,772)

             |     work a~8_le~t
-------------+------------------
        work |   1.0000
adj_div_8_~t |   0.0331   1.0000


. cor work adj_div_8_leave_count if dayofweek==2
(obs=35,013)

             |     work a~8_le~t
-------------+------------------
        work |   1.0000
adj_div_8_~t |   0.0616   1.0000


. cor work adj_div_8_leave_count if dayofweek==3
(obs=35,005)

             |     work a~8_le~t
-------------+------------------
        work |   1.0000
adj_div_8_~t |   0.0199   1.0000


. cor work adj_div_8_leave_count if dayofweek==4
(obs=34,373)

             |     work a~8_le~t
-------------+------------------
        work |   1.0000
adj_div_8_~t |   0.0180   1.0000


. cor work adj_div_8_leave_count if dayofweek==5
(obs=35,196)

             |     work a~8_le~t
-------------+------------------
        work |   1.0000
adj_div_8_~t |   0.0527   1.0000


. probit work adj_div_8_leave_count if dayofweek ==0

Iteration 0:  Log likelihood = -24463.116  
Iteration 1:  Log likelihood = -24423.777  
Iteration 2:  Log likelihood = -24423.765  
Iteration 3:  Log likelihood = -24423.765  

Probit regression                                       Number of obs = 42,207
                                                        LR chi2(1)    =  78.70
                                                        Prob > chi2   = 0.0000
Log likelihood = -24423.765                             Pseudo R2     = 0.0016

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   -.074311   .0084226    -8.82   0.000    -.0908191   -.0578029
                _cons |   -.583616   .0079517   -73.40   0.000     -.599201   -.5680309
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek ==1

Iteration 0:  Log likelihood = -14764.816  
Iteration 1:  Log likelihood = -14745.164  
Iteration 2:  Log likelihood = -14745.159  
Iteration 3:  Log likelihood = -14745.159  

Probit regression                                       Number of obs = 35,772
                                                        LR chi2(1)    =  39.31
                                                        Prob > chi2   = 0.0000
Log likelihood = -14745.159                             Pseudo R2     = 0.0013

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0064543    .001032     6.25   0.000     .0044317     .008477
                _cons |   .9918743   .0136648    72.59   0.000     .9650918    1.018657
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek ==2

Iteration 0:  Log likelihood = -10212.896  
Iteration 1:  Log likelihood = -10145.132  
Iteration 2:  Log likelihood = -10144.978  
Iteration 3:  Log likelihood = -10144.978  

Probit regression                                       Number of obs = 35,013
                                                        LR chi2(1)    = 135.84
                                                        Prob > chi2   = 0.0000
Log likelihood = -10144.978                             Pseudo R2     = 0.0067

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0142415   .0012307    11.57   0.000     .0118294    .0166536
                _cons |   1.206863   .0166803    72.35   0.000      1.17417    1.239555
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek ==3

Iteration 0:  Log likelihood = -11888.344  
Iteration 1:  Log likelihood = -11881.437  
Iteration 2:  Log likelihood = -11881.436  

Probit regression                                       Number of obs = 35,005
                                                        LR chi2(1)    =  13.82
                                                        Prob > chi2   = 0.0002
Log likelihood = -11881.436                             Pseudo R2     = 0.0006

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0041836   .0011275     3.71   0.000     .0019736    .0063935
                _cons |   1.195107   .0158825    75.25   0.000     1.163978    1.226236
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek ==4

Iteration 0:  Log likelihood = -11032.124  
Iteration 1:  Log likelihood = -11026.584  
Iteration 2:  Log likelihood = -11026.583  

Probit regression                                       Number of obs = 34,373
                                                        LR chi2(1)    =  11.08
                                                        Prob > chi2   = 0.0009
Log likelihood = -11026.583                             Pseudo R2     = 0.0005

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0038106   .0011458     3.33   0.001     .0015649    .0060563
                _cons |   1.246067   .0166202    74.97   0.000     1.213492    1.278642
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek ==5

Iteration 0:  Log likelihood =  -15896.52  
Iteration 1:  Log likelihood = -15847.996  
Iteration 2:  Log likelihood = -15847.977  
Iteration 3:  Log likelihood = -15847.977  

Probit regression                                       Number of obs = 35,196
                                                        LR chi2(1)    =  97.09
                                                        Prob > chi2   = 0.0000
Log likelihood = -15847.977                             Pseudo R2     = 0.0031

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |    .009375   .0009539     9.83   0.000     .0075055    .0112445
                _cons |   .8557291   .0135213    63.29   0.000     .8292279    .8822304
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek ==6

Iteration 0:  Log likelihood = -27872.571  
Iteration 1:  Log likelihood =  -27829.89  
Iteration 2:  Log likelihood = -27829.888  

Probit regression                                       Number of obs = 41,514
                                                        LR chi2(1)    =  85.37
                                                        Prob > chi2   = 0.0000
Log likelihood = -27829.888                             Pseudo R2     = 0.0015

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0357299   .0038738    -9.22   0.000    -.0433225   -.0281374
                _cons |  -.2034862   .0089875   -22.64   0.000    -.2211013   -.1858711
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.dayofweek

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood =  -116120.6  
Iteration 2:  Log likelihood = -115899.96  
Iteration 3:  Log likelihood = -115899.79  
Iteration 4:  Log likelihood = -115899.79  

Probit regression                                     Number of obs =  259,080
                                                      LR chi2(13)   = 83808.86
                                                      Prob > chi2   =   0.0000
Log likelihood = -115899.79                           Pseudo R2     =   0.2655

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |   -.074311   .0084226    -8.82   0.000    -.0908191   -.0578029
                                  |
                        dayofweek |
                          Monday  |    1.57549     .01581    99.65   0.000     1.544503    1.606477
                         Tuesday  |   1.790479   .0184787    96.89   0.000     1.754261    1.826696
                       Wednesday  |   1.778723   .0177618   100.14   0.000     1.743911    1.813536
                        Thursday  |   1.829683   .0184244    99.31   0.000     1.793572    1.865794
                          Friday  |   1.439345   .0156861    91.76   0.000     1.408601    1.470089
                        Saturday  |   .3801298   .0120002    31.68   0.000     .3566099    .4036497
                                  |
dayofweek#c.adj_div_8_leave_count |
                          Monday  |   .0807654   .0084856     9.52   0.000     .0641338    .0973969
                         Tuesday  |   .0885525   .0085121    10.40   0.000     .0718691    .1052358
                       Wednesday  |   .0784946   .0084978     9.24   0.000     .0618393    .0951499
                        Thursday  |   .0781216   .0085002     9.19   0.000     .0614615    .0947817
                          Friday  |    .083686   .0084765     9.87   0.000     .0670724    .1002996
                        Saturday  |   .0385811   .0092708     4.16   0.000     .0204107    .0567514
                                  |
                            _cons |   -.583616   .0079517   -73.40   0.000     -.599201   -.5680309
---------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.dayofweek if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood =  -63652.01  
Iteration 2:  Log likelihood = -63646.134  
Iteration 3:  Log likelihood = -63646.133  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(9)    = 1824.35
                                                       Prob > chi2   =  0.0000
Log likelihood = -63646.133                            Pseudo R2     =  0.0141

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |   .0064543    .001032     6.25   0.000     .0044317     .008477
                                  |
                        dayofweek |
                         Tuesday  |   .2149883   .0215629     9.97   0.000     .1727258    .2572509
                       Wednesday  |   .2032328   .0209518     9.70   0.000      .162168    .2442977
                        Thursday  |   .2541928   .0215164    11.81   0.000     .2120214    .2963642
                          Friday  |  -.1361452   .0192237    -7.08   0.000     -.173823   -.0984674
                                  |
dayofweek#c.adj_div_8_leave_count |
                         Tuesday  |   .0077871   .0016061     4.85   0.000     .0046392     .010935
                       Wednesday  |  -.0022708   .0015285    -1.49   0.137    -.0052666    .0007251
                        Thursday  |  -.0026437    .001542    -1.71   0.086     -.005666    .0003786
                          Friday  |   .0029207   .0014053     2.08   0.038     .0001664    .0056749
                                  |
                            _cons |   .9918743   .0136648    72.59   0.000     .9650918    1.018657
---------------------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood =  -64419.96  
Iteration 2:  Log likelihood = -64419.894  
Iteration 3:  Log likelihood = -64419.894  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(1)    =  276.83
                                                       Prob > chi2   =  0.0000
Log likelihood = -64419.894                            Pseudo R2     =  0.0021

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0079947   .0004819    16.59   0.000     .0070502    .0089392
                _cons |   1.079897   .0067023   161.12   0.000     1.066761    1.093034
---------------------------------------------------------------------------------------

. probit work adj_div_8_leave_count i.grouped_div if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -62375.131  
Iteration 2:  Log likelihood = -62319.281  
Iteration 3:  Log likelihood = -62318.514  
Iteration 4:  Log likelihood = -62318.514  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(18)   = 4479.59
                                                       Prob > chi2   =  0.0000
Log likelihood = -62318.514                            Pseudo R2     =  0.0347

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0178474   .0010869   -16.42   0.000    -.0199777    -.015717
                      |
          grouped_div |
                 803  |  -.2376111    .032659    -7.28   0.000    -.3016216   -.1736005
                 804  |   -.114657   .0318824    -3.60   0.000    -.1771453   -.0521686
                 805  |  -.1210617   .0380664    -3.18   0.001    -.1956705   -.0464529
                 806  |  -.1039905   .0309963    -3.35   0.001    -.1647422   -.0432388
                 807  |  -.1964864   .0366247    -5.36   0.000    -.2682695   -.1247034
                 808  |  -.3433873   .0693172    -4.95   0.000    -.4792466   -.2075281
                 809  |  -.0914347   .0364219    -2.51   0.012    -.1628203   -.0200492
                 810  |  -.1418376   .0349078    -4.06   0.000    -.2102556   -.0734195
                 811  |  -.6235353   .0265575   -23.48   0.000    -.6755871   -.5714835
                 812  |   .4224562    .027691    15.26   0.000     .3681829    .4767295
                 814  |    .454899   .0320146    14.21   0.000     .3921515    .5176464
                 816  |   .2279633   .0273634     8.33   0.000      .174332    .2815945
                 818  |   .2064739    .028779     7.17   0.000      .150068    .2628797
                 819  |   .3915782   .0315113    12.43   0.000     .3298173    .4533391
                 824  |   .9991734   .0560637    17.82   0.000     .8892905    1.109056
                 828  |   .1429465   .0526375     2.72   0.007     .0397789    .2461142
                 999  |  -.0732723    .033247    -2.20   0.028    -.1384352   -.0081094
                      |
                _cons |   1.190331    .022947    51.87   0.000     1.145356    1.235307
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.grouped_div if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -62323.565  
Iteration 2:  Log likelihood = -62266.838  
Iteration 3:  Log likelihood = -62266.011  
Iteration 4:  Log likelihood =  -62266.01  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(35)   = 4584.60
                                                       Prob > chi2   =  0.0000
Log likelihood = -62266.01                             Pseudo R2     =  0.0355

-----------------------------------------------------------------------------------------------------
                               work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------------------+----------------------------------------------------------------
              adj_div_8_leave_count |  -.0037638   .0144576    -0.26   0.795    -.0321003    .0245726
                                    |
                        grouped_div |
                               803  |  -.1942131   .0516613    -3.76   0.000    -.2954675   -.0929588
                               804  |  -.0357309   .0575293    -0.62   0.535    -.1484862    .0770244
                               805  |    .154604   .0747951     2.07   0.039     .0080083    .3011997
                               806  |  -.0576463   .0606391    -0.95   0.342    -.1764968    .0612041
                               807  |  -.1184757   .0695634    -1.70   0.089    -.2548175    .0178661
                               808  |   .0576146   .1218565     0.47   0.636    -.1812198    .2964491
                               809  |  -.0219994   .0691594    -0.32   0.750    -.1575493    .1135504
                               810  |  -.1297198   .0652458    -1.99   0.047    -.2575993   -.0018403
                               811  |  -.6687825   .0503811   -13.27   0.000    -.7675276   -.5700373
                               812  |   .4302301   .0503617     8.54   0.000     .3315229    .5289372
                               814  |   .4352327   .0591105     7.36   0.000     .3193782    .5510873
                               816  |   .3574976   .0569584     6.28   0.000     .2458612     .469134
                               818  |    .461887   .0623795     7.40   0.000     .3396254    .5841486
                               819  |    .378727   .0552969     6.85   0.000      .270347    .4871069
                               824  |   .9604243   .0819031    11.73   0.000     .7998971    1.120952
                               828  |   .1507108    .070515     2.14   0.033      .012504    .2889177
                               999  |   .1507489    .063656     2.37   0.018     .0259853    .2755124
                                    |
grouped_div#c.adj_div_8_leave_count |
                               803  |  -.0236257   .0236138    -1.00   0.317    -.0699079    .0226565
                               804  |  -.0384236   .0232197    -1.65   0.098    -.0839334    .0070863
                               805  |  -.1265154   .0290764    -4.35   0.000    -.1835041   -.0695266
                               806  |  -.0186592    .018905    -0.99   0.324    -.0557123     .018394
                               807  |  -.0406198    .031527    -1.29   0.198    -.1024115     .021172
                               808  |  -.5073154    .121445    -4.18   0.000    -.7453432   -.2692875
                               809  |   -.033371   .0286003    -1.17   0.243    -.0894266    .0226846
                               810  |  -.0056927   .0250654    -0.23   0.820      -.05482    .0434347
                               811  |   .0017357    .015694     0.11   0.912     -.029024    .0324953
                               812  |   -.012348   .0146406    -0.84   0.399    -.0410431    .0163471
                               814  |  -.0116583   .0146089    -0.80   0.425    -.0402911    .0169746
                               816  |  -.0225569    .014861    -1.52   0.129    -.0516839      .00657
                               818  |  -.0534742   .0164853    -3.24   0.001    -.0857848   -.0211636
                               819  |  -.0119171   .0145822    -0.82   0.414    -.0404977    .0166635
                               824  |   .0466305   .0489184     0.95   0.340    -.0492477    .1425088
                               828  |    .029577   .0689989     0.43   0.668    -.1056583    .1648123
                               999  |  -.0881679   .0220503    -4.00   0.000    -.1313858   -.0449501
                                    |
                              _cons |    1.15961   .0388011    29.89   0.000     1.083561    1.235659
-----------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.grouped_div if dayofweek!=1

Iteration 0:  Log likelihood = -140407.15  
Iteration 1:  Log likelihood = -110297.72  
Iteration 2:  Log likelihood = -109863.96  
Iteration 3:  Log likelihood = -109848.59  
Iteration 4:  Log likelihood = -109848.59  (backed up)
Iteration 5:  Log likelihood = -109848.59  (backed up)
Iteration 6:  Log likelihood = -109848.59  (backed up)
Iteration 7:  Log likelihood = -109848.59  (backed up)
--Break--
r(1);

. probit work c.adj_div_8_leave_count##i.grouped_div if dayofweek==1

Iteration 0:  Log likelihood = -14764.816  
Iteration 1:  Log likelihood = -14094.773  
Iteration 2:  Log likelihood = -14074.669  
Iteration 3:  Log likelihood =  -14073.87  
Iteration 4:  Log likelihood = -14073.868  
Iteration 5:  Log likelihood = -14073.868  

Probit regression                                      Number of obs =  35,772
                                                       LR chi2(35)   = 1381.90
                                                       Prob > chi2   =  0.0000
Log likelihood = -14073.868                            Pseudo R2     =  0.0468

-----------------------------------------------------------------------------------------------------
                               work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
------------------------------------+----------------------------------------------------------------
              adj_div_8_leave_count |   .0227387   .0318502     0.71   0.475    -.0396866     .085164
                                    |
                        grouped_div |
                               803  |  -.3735231    .099102    -3.77   0.000    -.5677595   -.1792867
                               804  |   .1588358   .1138611     1.39   0.163    -.0643278    .3819995
                               805  |   .2757596   .1607544     1.72   0.086    -.0393132    .5908325
                               806  |   .0413718   .1253741     0.33   0.741    -.2043569    .2871005
                               807  |  -.1225124   .1292419    -0.95   0.343    -.3758218     .130797
                               808  |   .3236317   .2847734     1.14   0.256     -.234514    .8817773
                               809  |   .0733196   .1371038     0.53   0.593    -.1953989    .3420382
                               810  |    -.17999   .1206862    -1.49   0.136    -.4165307    .0565507
                               811  |  -.1398551   .1056527    -1.32   0.186    -.3469306    .0672203
                               812  |   .7448037   .0977393     7.62   0.000     .5532382    .9363692
                               814  |   .7590398   .1111586     6.83   0.000     .5411729    .9769066
                               816  |   .7690578   .1129245     6.81   0.000     .5477299    .9903857
                               818  |   .4846941     .11686     4.15   0.000     .2556527    .7137354
                               819  |   .8835964   .1112737     7.94   0.000      .665504    1.101689
                               824  |   1.347591   .2082217     6.47   0.000     .9394841    1.755698
                               828  |   .0922396   .1395842     0.66   0.509    -.1813403    .3658196
                               999  |   .1352255   .1223915     1.10   0.269    -.1046574    .3751084
                                    |
grouped_div#c.adj_div_8_leave_count |
                               803  |  -.1623969   .0530838    -3.06   0.002    -.2664392   -.0583546
                               804  |  -.1286747   .0505986    -2.54   0.011    -.2278461   -.0295032
                               805  |  -.1811888   .0661918    -2.74   0.006    -.3109224   -.0514553
                               806  |  -.0478124   .0427558    -1.12   0.263    -.1316121    .0359874
                               807  |  -.1904818   .0636781    -2.99   0.003    -.3152885   -.0656751
                               808  |  -.6171912   .2824641    -2.19   0.029    -1.170811   -.0635718
                               809  |  -.1314122   .0614851    -2.14   0.033    -.2519208   -.0109036
                               810  |  -.1186108   .0518749    -2.29   0.022    -.2202838   -.0169378
                               811  |  -.0907414   .0352687    -2.57   0.010    -.1598668    -.021616
                               812  |  -.0618298   .0321949    -1.92   0.055    -.1249307     .001271
                               814  |  -.0538552   .0320962    -1.68   0.093    -.1167627    .0090523
                               816  |  -.0854254   .0327098    -2.61   0.009    -.1495354   -.0213153
                               818  |  -.0965102   .0353854    -2.73   0.006    -.1658644    -.027156
                               819  |  -.0555262   .0321046    -1.73   0.084    -.1184501    .0073976
                               824  |   .0089379   .1373442     0.07   0.948    -.2602517    .2781275
                               828  |   .0878722   .1572694     0.56   0.576    -.2203701    .3961144
                               999  |  -.1473708   .0472767    -3.12   0.002    -.2400315   -.0547101
                                    |
                              _cons |   .9919228   .0748842    13.25   0.000     .8451524    1.138693
-----------------------------------------------------------------------------------------------------

. lookfor count

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
div_leave_count byte    %10.0g                
adj_div_leave~t byte    %10.0g                
div_leave_8_c~t byte    %10.0g                
adj_div_8_lea~t byte    %10.0g                Coworkers on Leave
bar_adj_div_8~t double  %10.0g                Avg. Coworkers on Leave

. lookfor div

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
div1            double  %10.0g                
div2            int     %10.0g                
main_div        int     %10.0g                DIV
flag_div_corr~d byte    %10.0g                
div_emps        int     %10.0g                
div_leave_count byte    %10.0g                
pct_others_in~e double  %10.0g                Leave of Coworkers (%)
adj_div_leave~t byte    %10.0g                
div_leave_8_c~t byte    %10.0g                
adj_div_leave~s int     %10.0g                Leave of Coworkers (hours)
adj_div_8_lea~t byte    %10.0g                Coworkers on Leave
grouped_div     double  %10.0g                
grouped         double  %10.0g                group(grouped_div analysis_workdate)
div_before      double  %10.0g                
bar_adj_div_8~t double  %10.0g                Avg. Coworkers on Leave

. tab div_emps

   div_emps |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        636        0.25        0.25
          2 |        287        0.11        0.36
          3 |        354        0.14        0.49
          4 |        165        0.06        0.56
          5 |      1,403        0.54        1.10
          6 |        105        0.04        1.14
          7 |      1,190        0.46        1.60
          8 |      2,691        1.04        2.64
          9 |      6,093        2.35        4.99
         10 |      8,610        3.32        8.31
         11 |      7,232        2.79       11.10
         12 |     10,656        4.11       15.22
         13 |      3,164        1.22       16.44
         14 |        207        0.08       16.52
         15 |        568        0.22       16.74
         16 |      1,067        0.41       17.15
         17 |      1,418        0.55       17.70
         18 |      1,991        0.77       18.46
         19 |      2,067        0.80       19.26
         20 |      1,170        0.45       19.71
         21 |      1,152        0.44       20.16
         22 |        756        0.29       20.45
         23 |        485        0.19       20.64
         24 |        377        0.15       20.78
         25 |      1,801        0.70       21.48
         26 |      3,082        1.19       22.67
         27 |      2,892        1.12       23.78
         28 |      1,300        0.50       24.29
         29 |      1,583        0.61       24.90
         30 |      2,748        1.06       25.96
         31 |      1,515        0.58       26.54
         33 |         26        0.01       26.55
         34 |         63        0.02       26.58
         35 |      2,588        1.00       27.58
         36 |      3,064        1.18       28.76
         37 |      2,797        1.08       29.84
         38 |      2,842        1.10       30.93
         39 |      3,651        1.41       32.34
         40 |      1,745        0.67       33.02
         41 |      1,342        0.52       33.54
         42 |        616        0.24       33.77
         43 |        693        0.27       34.04
         44 |        310        0.12       34.16
         45 |        108        0.04       34.20
         67 |        172        0.07       34.27
         68 |      5,924        2.29       36.55
         69 |      5,481        2.12       38.67
         70 |      4,238        1.64       40.31
         71 |      3,769        1.45       41.76
         72 |      1,803        0.70       42.46
         73 |      3,833        1.48       43.94
         74 |      2,761        1.07       45.00
         75 |        958        0.37       45.37
         76 |      1,652        0.64       46.01
         77 |      1,114        0.43       46.44
         78 |        464        0.18       46.62
         79 |        765        0.30       46.91
         85 |      8,370        3.23       50.14
         86 |      1,383        0.53       50.68
         87 |      9,330        3.60       54.28
         88 |     11,198        4.32       58.60
         89 |      3,695        1.43       60.03
         90 |      6,370        2.46       62.49
         91 |      2,064        0.80       63.28
         93 |      1,780        0.69       63.97
         95 |        167        0.06       64.03
         96 |      5,070        1.96       65.99
         97 |     11,643        4.49       70.49
         98 |      3,554        1.37       71.86
         99 |      2,831        1.09       72.95
        100 |      3,300        1.27       74.22
        101 |      2,519        0.97       75.20
        102 |      4,835        1.87       77.06
        103 |     10,875        4.20       81.26
        104 |      9,389        3.62       84.88
        105 |      9,340        3.61       88.49
        106 |      4,589        1.77       90.26
        107 |        400        0.15       90.41
        108 |        294        0.11       90.53
        109 |      3,187        1.23       91.76
        110 |      4,742        1.83       93.59
        111 |      8,689        3.35       96.94
        112 |      5,281        2.04       98.98
        113 |      2,641        1.02      100.00
------------+-----------------------------------
      Total |    259,080      100.00

. gen mod = adj_div_8_leave_count /div_emps

. probit work mod

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -134137.29  
Iteration 2:  Log likelihood = -133961.14  
Iteration 3:  Log likelihood = -133961.08  
Iteration 4:  Log likelihood = -133961.08  

Probit regression                                     Number of obs =  259,080
                                                      LR chi2(1)    = 47686.27
                                                      Prob > chi2   =   0.0000
Log likelihood = -133961.08                           Pseudo R2     =   0.1511

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |    6.57094   .0319582   205.61   0.000     6.508303    6.633577
       _cons |  -.1548987   .0041473   -37.35   0.000    -.1630271   -.1467702
------------------------------------------------------------------------------

. probit work mod i.dayofweek

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -116294.72  
Iteration 2:  Log likelihood = -116087.31  
Iteration 3:  Log likelihood = -116087.25  
Iteration 4:  Log likelihood = -116087.25  

Probit regression                                     Number of obs =  259,080
                                                      LR chi2(7)    = 83433.93
                                                      Prob > chi2   =   0.0000
Log likelihood = -116087.25                           Pseudo R2     =   0.2644

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -.4565746   .0491028    -9.30   0.000    -.5528143   -.3603349
             |
   dayofweek |
     Monday  |   1.751843   .0127365   137.55   0.000      1.72688    1.776806
    Tuesday  |   2.067814   .0140959   146.70   0.000     2.040187    2.095442
  Wednesday  |   1.941795     .01368   141.94   0.000     1.914983    1.968607
   Thursday  |   1.992321   .0140273   142.03   0.000     1.964828    2.019813
     Friday  |   1.660914   .0129268   128.49   0.000     1.635578     1.68625
   Saturday  |   .3669279   .0090675    40.47   0.000     .3491559    .3846999
             |
       _cons |  -.6190924   .0065719   -94.20   0.000    -.6319731   -.6062117
------------------------------------------------------------------------------

. probit work mod if dayofweek==1

Iteration 0:  Log likelihood = -14764.816  
Iteration 1:  Log likelihood = -14680.529  
Iteration 2:  Log likelihood = -14680.455  
Iteration 3:  Log likelihood = -14680.455  

Probit regression                                       Number of obs = 35,772
                                                        LR chi2(1)    = 168.72
                                                        Prob > chi2   = 0.0000
Log likelihood = -14680.455                             Pseudo R2     = 0.0057

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -1.388645   .1069062   -12.99   0.000    -1.598177   -1.179112
       _cons |   1.281196   .0190439    67.28   0.000     1.243871    1.318522
------------------------------------------------------------------------------

. probit work mod if dayofweek==2

Iteration 0:  Log likelihood = -10212.896  
Iteration 1:  Log likelihood = -10211.698  
Iteration 2:  Log likelihood = -10211.698  

Probit regression                                       Number of obs = 35,013
                                                        LR chi2(1)    =   2.40
                                                        Prob > chi2   = 0.1216
Log likelihood = -10211.698                             Pseudo R2     = 0.0001

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |   .2043499   .1321397     1.55   0.122    -.0546391    .4633389
       _cons |   1.334816   .0245342    54.41   0.000      1.28673    1.382902
------------------------------------------------------------------------------

. probit work mod if dayofweek==3

Iteration 0:  Log likelihood = -11888.344  
Iteration 1:  Log likelihood = -11877.234  
Iteration 2:  Log likelihood = -11877.231  
Iteration 3:  Log likelihood = -11877.231  

Probit regression                                       Number of obs = 35,005
                                                        LR chi2(1)    =  22.23
                                                        Prob > chi2   = 0.0000
Log likelihood = -11877.231                             Pseudo R2     = 0.0009

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -.5478458   .1158538    -4.73   0.000    -.7749151   -.3207765
       _cons |   1.338508   .0219969    60.85   0.000     1.295395    1.381622
------------------------------------------------------------------------------

. probit work mod if dayofweek==4

Iteration 0:  Log likelihood = -11032.124  
Iteration 1:  Log likelihood = -11028.047  
Iteration 2:  Log likelihood = -11028.047  

Probit regression                                       Number of obs = 34,373
                                                        LR chi2(1)    =   8.15
                                                        Prob > chi2   = 0.0043
Log likelihood = -11028.047                             Pseudo R2     = 0.0004

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -.3548909   .1240834    -2.86   0.004    -.5980898    -.111692
       _cons |   1.355128   .0239309    56.63   0.000     1.308225    1.402032
------------------------------------------------------------------------------

. probit work mod if dayofweek==5

Iteration 0:  Log likelihood =  -15896.52  
Iteration 1:  Log likelihood = -15888.318  
Iteration 2:  Log likelihood = -15888.317  

Probit regression                                       Number of obs = 35,196
                                                        LR chi2(1)    =  16.41
                                                        Prob > chi2   = 0.0001
Log likelihood = -15888.317                             Pseudo R2     = 0.0005

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -.4105626   .1013593    -4.05   0.000    -.6092232    -.211902
       _cons |   1.034022   .0189237    54.64   0.000     .9969318    1.071111
------------------------------------------------------------------------------

. probit work mod if dayofweek==6

Iteration 0:  Log likelihood = -27872.571  
Iteration 1:  Log likelihood = -27872.384  
Iteration 2:  Log likelihood = -27872.384  

Probit regression                                       Number of obs = 41,514
                                                        LR chi2(1)    =   0.37
                                                        Prob > chi2   = 0.5405
Log likelihood = -27872.384                             Pseudo R2     = 0.0000

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |   .1349324   .2204353     0.61   0.540    -.2971129    .5669777
       _cons |    -.26677   .0082757   -32.24   0.000      -.28299   -.2505499
------------------------------------------------------------------------------

. probit work c.mod##i.dayofweek i.grouped_div

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -115578.29  
Iteration 2:  Log likelihood = -115338.67  
Iteration 3:  Log likelihood = -115338.57  
Iteration 4:  Log likelihood = -115338.57  

Probit regression                                     Number of obs =  259,080
                                                      LR chi2(30)   = 84931.30
                                                      Prob > chi2   =   0.0000
Log likelihood = -115338.57                           Pseudo R2     =   0.2691

---------------------------------------------------------------------------------
           work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
            mod |   2.276006   .2881095     7.90   0.000     1.711322     2.84069
                |
      dayofweek |
        Monday  |    1.96111   .0207215    94.64   0.000     1.920497    2.001723
       Tuesday  |   2.015882   .0261907    76.97   0.000      1.96455    2.067215
     Wednesday  |   2.016513   .0235736    85.54   0.000      1.97031    2.062717
      Thursday  |    2.04277    .025487    80.15   0.000     1.992816    2.092723
        Friday  |   1.750953   .0206775    84.68   0.000     1.710426     1.79148
      Saturday  |   .3764495    .011003    34.21   0.000     .3548841    .3980149
                |
dayofweek#c.mod |
        Monday  |  -3.824822   .3077004   -12.43   0.000    -4.427904    -3.22174
       Tuesday  |  -2.193736    .317587    -6.91   0.000    -2.816195   -1.571277
     Wednesday  |  -2.942684   .3106247    -9.47   0.000    -3.551497   -2.333871
      Thursday  |  -2.797258   .3139763    -8.91   0.000     -3.41264   -2.181876
        Friday  |  -3.045513   .3062843    -9.94   0.000    -3.645819   -2.445207
      Saturday  |  -1.950421   .3622062    -5.38   0.000    -2.660332   -1.240509
                |
    grouped_div |
           803  |  -.0836731   .0266295    -3.14   0.002    -.1358658   -.0314803
           804  |  -.0367797   .0254258    -1.45   0.148    -.0866134     .013054
           805  |   .0212961   .0308079     0.69   0.489    -.0390863    .0816786
           806  |  -.0807949    .024722    -3.27   0.001    -.1292492   -.0323407
           807  |  -.1375517   .0294199    -4.68   0.000    -.1952137   -.0798897
           808  |   -.498397   .0589601    -8.45   0.000    -.6139567   -.3828372
           809  |   .0503923   .0289544     1.74   0.082    -.0063574    .1071419
           810  |  -.0822354   .0279609    -2.94   0.003    -.1370377   -.0274331
           811  |  -.4882771   .0212831   -22.94   0.000    -.5299912   -.4465629
           812  |  -.0686289   .0194056    -3.54   0.000    -.1066633   -.0305946
           814  |  -.1099715   .0195684    -5.62   0.000    -.1483249   -.0716182
           816  |   -.104756   .0199287    -5.26   0.000    -.1438155   -.0656964
           818  |  -.0665006   .0220686    -3.01   0.003    -.1097543   -.0232469
           819  |  -.1137471   .0195807    -5.81   0.000    -.1521246   -.0753697
           824  |  -.0230408   .0281395    -0.82   0.413    -.0781932    .0321116
           828  |  -.1174999   .0388772    -3.02   0.003    -.1936978   -.0413021
           999  |  -.1753308   .0261787    -6.70   0.000    -.2266402   -.1240215
                |
          _cons |   -.538092   .0192694   -27.92   0.000    -.5758593   -.5003247
---------------------------------------------------------------------------------

. probit work c.mod##i.dayofweek

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -116210.89  
Iteration 2:  Log likelihood =    -116002  
Iteration 3:  Log likelihood = -116001.94  
Iteration 4:  Log likelihood = -116001.94  

Probit regression                                     Number of obs =  259,080
                                                      LR chi2(13)   = 83604.55
                                                      Prob > chi2   =   0.0000
Log likelihood = -116001.94                           Pseudo R2     =   0.2649

---------------------------------------------------------------------------------
           work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------+----------------------------------------------------------------
            mod |   1.784586   .2856383     6.25   0.000     1.224745    2.344426
                |
      dayofweek |
        Monday  |   1.924011   .0203713    94.45   0.000     1.884084    1.963938
       Tuesday  |    1.97763   .0255782    77.32   0.000     1.927498    2.027763
     Wednesday  |   1.981323   .0231556    85.57   0.000     1.935939    2.026707
      Thursday  |   1.997943   .0250001    79.92   0.000     1.948943    2.046942
        Friday  |   1.676836   .0202589    82.77   0.000     1.637129    1.716543
      Saturday  |   .3760444   .0109912    34.21   0.000     .3545021    .3975867
                |
dayofweek#c.mod |
        Monday  |   -3.17323   .3049888   -10.40   0.000    -3.770997   -2.575463
       Tuesday  |  -1.580236   .3147223    -5.02   0.000     -2.19708   -.9633912
     Wednesday  |  -2.332431   .3082391    -7.57   0.000    -2.936569   -1.728294
      Thursday  |  -2.139476   .3114256    -6.87   0.000    -2.749859   -1.529093
        Friday  |  -2.195148    .303089    -7.24   0.000    -2.789192   -1.601105
      Saturday  |  -1.649653    .360806    -4.57   0.000     -2.35682   -.9424864
                |
          _cons |  -.6428144   .0072332   -88.87   0.000    -.6569912   -.6286376
---------------------------------------------------------------------------------

. probit work mod if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -64520.334  
Iteration 2:  Log likelihood = -64520.329  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(1)    =   75.96
                                                       Prob > chi2   =  0.0000
Log likelihood = -64520.329                            Pseudo R2     =  0.0006

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -.4424372   .0507024    -8.73   0.000     -.541812   -.3430624
       _cons |    1.24688   .0094612   131.79   0.000     1.228336    1.265424
------------------------------------------------------------------------------

. probit work mod if dayofweek==0

Iteration 0:  Log likelihood = -24463.116  
Iteration 1:  Log likelihood = -24443.815  
Iteration 2:  Log likelihood = -24443.809  
Iteration 3:  Log likelihood = -24443.809  

Probit regression                                       Number of obs = 42,207
                                                        LR chi2(1)    =  38.61
                                                        Prob > chi2   = 0.0000
Log likelihood = -24443.809                             Pseudo R2     = 0.0008

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |   1.784586   .2856383     6.25   0.000     1.224745    2.344426
       _cons |  -.6428144   .0072332   -88.87   0.000    -.6569912   -.6286376
------------------------------------------------------------------------------

. probit work mod i.grouped_div if dayofweek==0

Iteration 0:  Log likelihood = -24463.116  
Iteration 1:  Log likelihood = -23512.919  
Iteration 2:  Log likelihood = -23511.876  
Iteration 3:  Log likelihood = -23511.876  

Probit regression                                      Number of obs =  42,207
                                                       LR chi2(18)   = 1902.48
                                                       Prob > chi2   =  0.0000
Log likelihood = -23511.876                            Pseudo R2     =  0.0389

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -1.057937   .3030979    -3.49   0.000    -1.651998    -.463876
             |
 grouped_div |
        803  |  -.0930944   .0561736    -1.66   0.097    -.2031925    .0170038
        804  |   -.025071   .0528125    -0.47   0.635    -.1285816    .0784396
        805  |    .004957     .06346     0.08   0.938    -.1194223    .1293362
        806  |  -.2232406   .0514238    -4.34   0.000    -.3240295   -.1224518
        807  |  -.1674099   .0617537    -2.71   0.007    -.2884449   -.0463748
        808  |  -.8957563   .1583486    -5.66   0.000    -1.206114   -.5853988
        809  |   .0619084   .0587155     1.05   0.292    -.0531719    .1769887
        810  |  -.2229915   .0579736    -3.85   0.000    -.3366177   -.1093654
        811  |  -.1117493   .0455931    -2.45   0.014    -.2011101   -.0223884
        812  |  -.8143565   .0406602   -20.03   0.000    -.8940491   -.7346639
        814  |  -.7686595   .0404584   -19.00   0.000    -.8479564   -.6893626
        816  |   -.700064   .0416901   -16.79   0.000    -.7817751   -.6183528
        818  |   -.599662   .0462473   -12.97   0.000    -.6903052   -.5090189
        819  |  -.6965491    .040343   -17.27   0.000    -.7756199   -.6174782
        824  |  -.9435366   .0625754   -15.08   0.000    -1.066182   -.8208911
        828  |  -.8441469   .0890556    -9.48   0.000    -1.018693   -.6696011
        999  |  -.4862496   .0551656    -8.81   0.000    -.5943722   -.3781269
             |
       _cons |   -.043058   .0372351    -1.16   0.248    -.1160374    .0299214
------------------------------------------------------------------------------

. probit work mod i.grouped_div if dayofweek==6

Iteration 0:  Log likelihood = -27872.571  
Iteration 1:  Log likelihood = -27427.514  
Iteration 2:  Log likelihood = -27424.093  
Iteration 3:  Log likelihood = -27424.088  
Iteration 4:  Log likelihood = -27424.088  

Probit regression                                       Number of obs = 41,514
                                                        LR chi2(18)   = 896.97
                                                        Prob > chi2   = 0.0000
Log likelihood = -27424.088                             Pseudo R2     = 0.0161

------------------------------------------------------------------------------
        work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
         mod |  -.9836869   .2302741    -4.27   0.000    -1.435016    -.532358
             |
 grouped_div |
        803  |   .4416212   .0577024     7.65   0.000     .3285266    .5547159
        804  |   .0833841   .0528861     1.58   0.115    -.0202708     .187039
        805  |   .1406782   .0637135     2.21   0.027     .0158021    .2655543
        806  |   .0629803   .0513752     1.23   0.220    -.0377133    .1636739
        807  |   -.079746   .0615772    -1.30   0.195     -.200435    .0409431
        808  |  -.3732624   .1395751    -2.67   0.007    -.6468247   -.0997002
        809  |   .1502726   .0592156     2.54   0.011     .0342122     .266333
        810  |   .1026103   .0579561     1.77   0.077    -.0109815    .2162022
        811  |   .1173129   .0456509     2.57   0.010     .0278387     .206787
        812  |  -.1989892   .0398248    -5.00   0.000    -.2770444    -.120934
        814  |  -.2499869   .0399502    -6.26   0.000    -.3282879   -.1716858
        816  |  -.0836806   .0409391    -2.04   0.041    -.1639197   -.0034415
        818  |  -.2330381   .0453745    -5.14   0.000    -.3219706   -.1441056
        819  |  -.2091543   .0399255    -5.24   0.000    -.2874069   -.1309017
        824  |  -1.027781   .0647838   -15.86   0.000    -1.154755   -.9008068
        828  |  -.2579386   .0807755    -3.19   0.001    -.4162557   -.0996215
        999  |  -.2810173   .0542264    -5.18   0.000     -.387299   -.1747355
             |
       _cons |  -.0968175   .0369469    -2.62   0.009    -.1692321    -.024403
------------------------------------------------------------------------------

. reg work adj_div_8_leave_count

      Source |       SS           df       MS      Number of obs   =   259,080
-------------+----------------------------------   F(1, 259078)    =  37436.58
       Model |  6841.84285         1  6841.84285   Prob > F        =    0.0000
    Residual |    47348.64   259,078  .182758243   R-squared       =    0.1263
-------------+----------------------------------   Adj R-squared   =    0.1263
       Total |  54190.4828   259,079  .209165864   Root MSE        =     .4275

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0194453   .0001005   193.49   0.000     .0192483    .0196423
                _cons |   .5395468   .0011879   454.21   0.000     .5372186     .541875
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count, cluster(employee_name )

Linear regression                               Number of obs     =    259,080
                                                F(1, 549)         =    1564.18
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1263
                                                Root MSE          =      .4275

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0194453   .0004917    39.55   0.000     .0184795    .0204111
                _cons |   .5395468   .0087219    61.86   0.000     .5224144    .5566791
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count i.dayofweek , cluster(employee_name )

Linear regression                               Number of obs     =    259,080
                                                F(7, 549)         =     734.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3247
                                                Root MSE          =     .37583

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0012969   .0003284     3.95   0.000     .0006519     .001942
                      |
            dayofweek |
              Monday  |   .5758543   .0122539    46.99   0.000     .5517839    .5999246
             Tuesday  |   .6333603   .0126127    50.22   0.000     .6085853    .6581352
           Wednesday  |   .6122313   .0123905    49.41   0.000     .5878928    .6365699
            Thursday  |   .6203007   .0127512    48.65   0.000     .5952535    .6453478
              Friday  |   .5515409   .0143379    38.47   0.000     .5233771    .5797048
            Saturday  |   .1282827   .0109041    11.76   0.000     .1068638    .1497016
                      |
                _cons |   .2656318   .0098536    26.96   0.000     .2462765    .2849871
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count i.dayofweek i.main_div , cluster(employee_name )

Linear regression                               Number of obs     =    259,080
                                                F(26, 549)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.3285
                                                Root MSE          =     .37478

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0034778   .0006739     5.16   0.000     .0021541    .0048015
                      |
            dayofweek |
              Monday  |   .5527851   .0143065    38.64   0.000     .5246828    .5808873
             Tuesday  |   .6078544   .0150362    40.43   0.000     .5783188      .63739
           Wednesday  |    .587207   .0149078    39.39   0.000     .5579237    .6164904
            Thursday  |   .5943158   .0151722    39.17   0.000     .5645131    .6241185
              Friday  |   .5266063   .0165531    31.81   0.000     .4940911    .5591216
            Saturday  |   .1257145   .0109829    11.45   0.000     .1041409    .1472882
                      |
             main_div |
                   8  |   .0815072   .0476182     1.71   0.088     -.012029    .1750435
                  10  |   .0346464   .0243233     1.42   0.155    -.0131318    .0824246
                 800  |  -.0196873   .0136599    -1.44   0.150    -.0465193    .0071447
                 801  |   .0438465   .0295437     1.48   0.138     -.014186    .1018791
                 803  |   .0268524     .02718     0.99   0.324    -.0265372    .0802419
                 804  |   .0309649   .0137056     2.26   0.024     .0040431    .0578866
                 805  |   .0346358   .0233207     1.49   0.138    -.0111728    .0804444
                 806  |   .0116623   .0100929     1.16   0.248     -.008163    .0314876
                 807  |  -.0006207    .017771    -0.03   0.972    -.0355282    .0342868
                 808  |  -.0745894   .0473054    -1.58   0.115    -.1675111    .0183322
                 809  |   .0468311   .0247725     1.89   0.059    -.0018294    .0954916
                 810  |   .0129951   .0209504     0.62   0.535    -.0281576    .0541478
                 811  |  -.0942218   .0206283    -4.57   0.000     -.134742   -.0537017
                 812  |  -.0125446   .0084847    -1.48   0.140     -.029211    .0041219
                 814  |  -.0447759   .0134992    -3.32   0.001    -.0712923   -.0182596
                 816  |  -.0168018   .0092688    -1.81   0.070    -.0350086    .0014049
                 818  |   .0039097   .0103333     0.38   0.705    -.0163879    .0242074
                 819  |  -.0433198   .0134317    -3.23   0.001    -.0697035    -.016936
                 824  |   .0206125    .013355     1.54   0.123    -.0056206    .0468455
                 828  |   .0072688   .0064464     1.13   0.260    -.0053938    .0199314
                      |
                _cons |   .2849803   .0111303    25.60   0.000     .2631172    .3068435
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count if dayofweek >0 & dayofweek <6, cluster(employee_name )

Linear regression                               Number of obs     =    175,359
                                                F(1, 549)         =      22.71
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0016
                                                Root MSE          =     .32542

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0016021   .0003362     4.77   0.000     .0009416    .0022625
                _cons |   .8604568   .0065039   132.30   0.000     .8476812    .8732324
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count i.dayofweek if dayofweek >0 & dayofweek <6, cluster(employee_name )

Linear regression                               Number of obs     =    175,359
                                                F(5, 549)         =      40.54
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0102
                                                Root MSE          =     .32402

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |    .001498   .0003326     4.50   0.000     .0008448    .0021513
                      |
            dayofweek |
             Tuesday  |   .0572802   .0061354     9.34   0.000     .0452285    .0693319
           Wednesday  |    .036187   .0069464     5.21   0.000     .0225422    .0498318
            Thursday  |   .0441743   .0078572     5.62   0.000     .0287404    .0596082
              Friday  |  -.0245142   .0087677    -2.80   0.005    -.0417365   -.0072919
                      |
                _cons |    .839287   .0080549   104.20   0.000     .8234647    .8551092
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count i.dayofweek i.grouped_div if dayofweek >0 & dayofweek <6, cluster(employee_name )

Linear regression                               Number of obs     =    175,359
                                                F(22, 549)        =      64.04
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0382
                                                Root MSE          =     .31942

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0036312   .0002131   -17.04   0.000    -.0040497   -.0032126
                      |
            dayofweek |
             Tuesday  |   .0624953   .0061561    10.15   0.000      .050403    .0745877
           Wednesday  |   .0403395   .0069557     5.80   0.000     .0266765    .0540025
            Thursday  |    .050404   .0079155     6.37   0.000     .0348557    .0659523
              Friday  |  -.0186323   .0088046    -2.12   0.035    -.0359272   -.0013375
                      |
          grouped_div |
                 803  |  -.0546405   .0292214    -1.87   0.062    -.1120399    .0027589
                 804  |  -.0252281   .0254759    -0.99   0.322    -.0752703     .024814
                 805  |  -.0267938   .0280895    -0.95   0.341    -.0819699    .0283823
                 806  |   -.023468   .0247952    -0.95   0.344    -.0721731    .0252371
                 807  |  -.0447673   .0283304    -1.58   0.115    -.1004165    .0108819
                 808  |  -.0841676   .0514773    -1.64   0.103    -.1852841     .016949
                 809  |  -.0198166   .0277527    -0.71   0.476    -.0743311     .034698
                 810  |  -.0310713   .0278466    -1.12   0.265    -.0857703    .0236277
                 811  |  -.1802229   .0302855    -5.95   0.000    -.2397125   -.1207332
                 812  |   .0793052      .0241     3.29   0.001     .0319658    .1266446
                 814  |   .0898587   .0241371     3.72   0.000     .0424462    .1372711
                 816  |   .0454055   .0242754     1.87   0.062    -.0022785    .0930895
                 818  |   .0391274   .0242133     1.62   0.107    -.0084346    .0866894
                 819  |   .0780552   .0240099     3.25   0.001     .0308928    .1252177
                 824  |   .1057686   .0242421     4.36   0.000     .0581499    .1533873
                 828  |    .025726   .0243916     1.05   0.292    -.0221862    .0736382
                 999  |   -.015685   .0289007    -0.54   0.588    -.0724545    .0410845
                      |
                _cons |   .8565919   .0248406    34.48   0.000     .8077977    .9053861
---------------------------------------------------------------------------------------

. reg work adj_div_8_leave_count i.grouped_div if dayofweek >0 & dayofweek <6, cluster(employee_name )

Linear regression                               Number of obs     =    175,359
                                                F(18, 549)        =      64.58
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0292
                                                Root MSE          =     .32091

                                 (Std. err. adjusted for 550 clusters in employee_name)
---------------------------------------------------------------------------------------
                      |               Robust
                 work | Coefficient  std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0031397   .0001966   -15.97   0.000    -.0035259   -.0027536
                      |
          grouped_div |
                 803  |  -.0543221   .0292326    -1.86   0.064    -.1117435    .0030993
                 804  |  -.0249452   .0254723    -0.98   0.328    -.0749803    .0250899
                 805  |  -.0267037   .0280839    -0.95   0.342    -.0818688    .0284614
                 806  |  -.0239568   .0247732    -0.97   0.334    -.0726186     .024705
                 807  |  -.0444679   .0283245    -1.57   0.117    -.1001055    .0111697
                 808  |  -.0819727   .0513515    -1.60   0.111    -.1828422    .0188967
                 809  |  -.0196347   .0277406    -0.71   0.479    -.0741254     .034856
                 810  |  -.0315921   .0279108    -1.13   0.258    -.0864172    .0232331
                 811  |  -.1821971   .0303319    -6.01   0.000    -.2417779   -.1226164
                 812  |   .0744484   .0240073     3.10   0.002      .027291    .1216057
                 814  |   .0811929   .0239515     3.39   0.001      .034145    .1282408
                 816  |   .0410928   .0242027     1.70   0.090    -.0064484    .0886341
                 818  |   .0378976   .0241694     1.57   0.117    -.0095782    .0853734
                 819  |   .0696362   .0238358     2.92   0.004     .0228156    .1164567
                 824  |   .1066389   .0242373     4.40   0.000     .0590297    .1542481
                 828  |   .0268677   .0243761     1.10   0.271    -.0210142    .0747497
                 999  |   -.016159   .0290143    -0.56   0.578    -.0731516    .0408335
                      |
                _cons |   .8820157   .0239552    36.82   0.000     .8349606    .9290708
---------------------------------------------------------------------------------------

. lookfor sick

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
sick_hours      byte    %10.0g                (sum) sick_hours
alt_leave_nos~k byte    %10.0g                

. lookfor ber

. tab alt_leave_nosick

alt_leave_n |
      osick |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     74,367       28.70       28.70
          1 |     30,811       11.89       40.60
          2 |     17,227        6.65       47.25
          3 |     11,914        4.60       51.84
          4 |      7,841        3.03       54.87
          5 |      7,364        2.84       57.71
          6 |      8,658        3.34       61.06
          7 |      9,724        3.75       64.81
          8 |     10,134        3.91       68.72
          9 |      8,476        3.27       71.99
         10 |      9,303        3.59       75.58
         11 |      8,970        3.46       79.04
         12 |      9,117        3.52       82.56
         13 |      7,911        3.05       85.62
         14 |      8,567        3.31       88.92
         15 |      7,071        2.73       91.65
         16 |      6,516        2.52       94.17
         17 |      5,004        1.93       96.10
         18 |      3,777        1.46       97.56
         19 |      2,309        0.89       98.45
         20 |      1,746        0.67       99.12
         21 |        818        0.32       99.44
         22 |        715        0.28       99.71
         23 |        566        0.22       99.93
         24 |        174        0.07      100.00
------------+-----------------------------------
      Total |    259,080      100.00

. cor alt_leave_nosick work
(obs=259,080)

             | alt_le~k     work
-------------+------------------
alt_leave_~k |   1.0000
        work |   0.3650   1.0000


. cor adj_div_8_leave_count  work
(obs=259,080)

             | a~8_le~t     work
-------------+------------------
adj_div_8_~t |   1.0000
        work |   0.3553   1.0000


. cor alt_leave_nosick work if dayofweek ==1
(obs=35,772)

             | alt_le~k     work
-------------+------------------
alt_leave_~k |   1.0000
        work |   0.0369   1.0000


. cor alt_leave_nosick work if dayofweek ==2
(obs=35,013)

             | alt_le~k     work
-------------+------------------
alt_leave_~k |   1.0000
        work |   0.0563   1.0000


. cor alt_leave_nosick work if dayofweek ==3
(obs=35,005)

             | alt_le~k     work
-------------+------------------
alt_leave_~k |   1.0000
        work |   0.0212   1.0000


. cor alt_leave_nosick work if dayofweek ==4
(obs=34,373)

             | alt_le~k     work
-------------+------------------
alt_leave_~k |   1.0000
        work |   0.0170   1.0000


. cor alt_leave_nosick work if dayofweek ==5
(obs=35,196)

             | alt_le~k     work
-------------+------------------
alt_leave_~k |   1.0000
        work |   0.0565   1.0000


. lookfor leave

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
leave_hours     byte    %10.0g                (sum) leave_hours
took_leave      byte    %10.0g                
tot_leave       int     %10.0g                
div_leave_count byte    %10.0g                
pct_others_in~e double  %10.0g                Leave of Coworkers (%)
adj_div_leave~t byte    %10.0g                
alt_leave_nos~k byte    %10.0g                
div_leave_8_c~t byte    %10.0g                
adj_div_leave~s int     %10.0g                Leave of Coworkers (hours)
adj_div_8_lea~t byte    %10.0g                Coworkers on Leave
bar_adj_div_8~t double  %10.0g                Avg. Coworkers on Leave

. cor pct_others_indiv_leave adj_div_8_leave_count
(obs=259,080)

             | pct_ot~e a~8_le~t
-------------+------------------
pct_others~e |   1.0000
adj_div_8_~t |   0.6421   1.0000


. cor pct_others_indiv_leave work
(obs=259,080)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |   0.4099   1.0000


. cor pct_others_indiv_leave work if dayofweek ==1
(obs=35,772)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |  -0.0614   1.0000


. cor pct_others_indiv_leave work if dayofweek ==2
(obs=35,013)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |   0.0114   1.0000


. cor pct_others_indiv_leave work if dayofweek ==3
(obs=35,005)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |  -0.0266   1.0000


. cor pct_others_indiv_leave work if dayofweek ==4
(obs=34,373)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |  -0.0123   1.0000


. cor pct_others_indiv_leave work if dayofweek ==5
(obs=35,196)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |  -0.0227   1.0000


. cor pct_others_indiv_leave work if dayofweek ==0
(obs=42,207)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |   0.0328   1.0000


. cor pct_others_indiv_leave work if dayofweek ==6
(obs=41,514)

             | pct_ot~e     work
-------------+------------------
pct_others~e |   1.0000
        work |   0.0009   1.0000


. lookfor
nothing to look for
r(198);

. lookfor sick

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
sick_hours      byte    %10.0g                (sum) sick_hours
alt_leave_nos~k byte    %10.0g                

. reg work c.adj_div_8_leave_count##i.dayofweek

      Source |       SS           df       MS      Number of obs   =   259,080
-------------+----------------------------------   F(13, 259066)   =   9620.71
       Model |  17643.6849        13  1357.20653   Prob > F        =    0.0000
    Residual |  36546.7979   259,066  .141071379   R-squared       =    0.3256
-------------+----------------------------------   Adj R-squared   =    0.3256
       Total |  54190.4828   259,079  .209165864   Root MSE        =    .37559

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |  -.0237372    .002299   -10.33   0.000    -.0282431   -.0192313
                                  |
                        dayofweek |
                          Monday  |   .5601017   .0040448   138.47   0.000      .552174    .5680295
                         Tuesday  |   .6089805   .0042722   142.55   0.000     .6006072    .6173539
                       Wednesday  |   .6045822   .0042341   142.79   0.000     .5962834     .612881
                        Thursday  |    .614154     .00431   142.50   0.000     .6057065    .6226014
                          Friday  |   .5249002   .0041481   126.54   0.000       .51677    .5330304
                        Saturday  |   .1396379   .0034768    40.16   0.000     .1328234    .1464524
                                  |
dayofweek#c.adj_div_8_leave_count |
                          Monday  |      .0252   .0023124    10.90   0.000     .0206677    .0297323
                         Tuesday  |      .0259   .0023127    11.20   0.000     .0213671    .0304329
                       Wednesday  |   .0245048   .0023127    10.60   0.000      .019972    .0290375
                        Thursday  |   .0244001   .0023126    10.55   0.000     .0198675    .0289327
                          Friday  |   .0260984   .0023115    11.29   0.000      .021568    .0306289
                        Saturday  |   .0100742   .0025657     3.93   0.000     .0050456    .0151029
                                  |
                            _cons |   .2795709   .0022318   125.27   0.000     .2751966    .2839452
---------------------------------------------------------------------------------------------------

. reg work c.adj_div_8_leave_count##i.dayofweek, nocons

      Source |       SS           df       MS      Number of obs   =   259,080
-------------+----------------------------------   F(13, 259067)   =  73590.42
       Model |  143133.545        13  11010.2727   Prob > F        =    0.0000
    Residual |  38760.4551   259,067  .149615563   R-squared       =    0.7869
-------------+----------------------------------   Adj R-squared   =    0.7869
       Total |      181894   259,080  .702076579   Root MSE        =     .3868

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |   .1414385   .0019394    72.93   0.000     .1376373    .1452397
                                  |
                        dayofweek |
                          Monday  |   .8396726    .003474   241.70   0.000     .8328636    .8464816
                         Tuesday  |   .8885514   .0037516   236.85   0.000     .8811984    .8959044
                       Wednesday  |   .8841531   .0037056   238.60   0.000     .8768903    .8914159
                        Thursday  |   .8937249   .0037972   235.37   0.000     .8862825    .9011672
                          Friday  |   .8044711   .0036009   223.41   0.000     .7974135    .8115287
                        Saturday  |   .4192088   .0027455   152.69   0.000     .4138277    .4245899
                                  |
dayofweek#c.adj_div_8_leave_count |
                          Monday  |  -.1399758   .0019563   -71.55   0.000    -.1438101   -.1361414
                         Tuesday  |  -.1392758   .0019567   -71.18   0.000    -.1431109   -.1354406
                       Wednesday  |   -.140671   .0019566   -71.89   0.000    -.1445059   -.1368361
                        Thursday  |  -.1407757   .0019565   -71.95   0.000    -.1446104   -.1369409
                          Friday  |  -.1390773   .0019551   -71.13   0.000    -.1429093   -.1352453
                        Saturday  |  -.1551015   .0022666   -68.43   0.000     -.159544   -.1506591
---------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.dayofweek, nocons

Iteration 0:  Log likelihood = -179580.57  
Iteration 1:  Log likelihood = -119293.44  
Iteration 2:  Log likelihood = -118712.52  
Iteration 3:  Log likelihood =  -118710.3  
Iteration 4:  Log likelihood =  -118710.3  

Probit regression                                     Number of obs =  259,080
                                                      Wald chi2(13) = 96075.11
Log likelihood = -118710.3                            Prob > chi2   =   0.0000

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |  -.4328718   .0071793   -60.29   0.000     -.446943   -.4188006
                                  |
                        dayofweek |
                          Monday  |   .9918743   .0136648    72.59   0.000     .9650918    1.018657
                         Tuesday  |   1.206863   .0166803    72.35   0.000      1.17417    1.239555
                       Wednesday  |   1.195107   .0158825    75.25   0.000     1.163978    1.226236
                        Thursday  |   1.246067   .0166202    74.97   0.000     1.213492    1.278642
                          Friday  |   .8557291   .0135213    63.29   0.000     .8292279    .8822304
                        Saturday  |  -.2034862   .0089875   -22.64   0.000    -.2211013   -.1858711
                                  |
dayofweek#c.adj_div_8_leave_count |
                          Monday  |   .4393261   .0072531    60.57   0.000     .4251103     .453542
                         Tuesday  |   .4471133   .0072841    61.38   0.000     .4328368    .4613897
                       Wednesday  |   .4370554   .0072673    60.14   0.000     .4228117    .4512991
                        Thursday  |   .4366824   .0072702    60.06   0.000     .4224331    .4509317
                          Friday  |   .4422468   .0072424    61.06   0.000     .4280519    .4564417
                        Saturday  |   .3971418   .0081578    48.68   0.000     .3811529    .4131308
---------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.dayofweek if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood =  -63652.01  
Iteration 2:  Log likelihood = -63646.134  
Iteration 3:  Log likelihood = -63646.133  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(9)    = 1824.35
                                                       Prob > chi2   =  0.0000
Log likelihood = -63646.133                            Pseudo R2     =  0.0141

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |   .0064543    .001032     6.25   0.000     .0044317     .008477
                                  |
                        dayofweek |
                         Tuesday  |   .2149883   .0215629     9.97   0.000     .1727258    .2572509
                       Wednesday  |   .2032328   .0209518     9.70   0.000      .162168    .2442977
                        Thursday  |   .2541928   .0215164    11.81   0.000     .2120214    .2963642
                          Friday  |  -.1361452   .0192237    -7.08   0.000     -.173823   -.0984674
                                  |
dayofweek#c.adj_div_8_leave_count |
                         Tuesday  |   .0077871   .0016061     4.85   0.000     .0046392     .010935
                       Wednesday  |  -.0022708   .0015285    -1.49   0.137    -.0052666    .0007251
                        Thursday  |  -.0026437    .001542    -1.71   0.086     -.005666    .0003786
                          Friday  |   .0029207   .0014053     2.08   0.038     .0001664    .0056749
                                  |
                            _cons |   .9918743   .0136648    72.59   0.000     .9650918    1.018657
---------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count##i.dayofweek i.grouped_div if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -61558.287  
Iteration 2:  Log likelihood = -61489.993  
Iteration 3:  Log likelihood = -61488.996  
Iteration 4:  Log likelihood = -61488.995  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(26)   = 6138.63
                                                       Prob > chi2   =  0.0000
Log likelihood = -61488.995                            Pseudo R2     =  0.0475

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
            adj_div_8_leave_count |  -.0203875   .0014141   -14.42   0.000    -.0231591   -.0176159
                                  |
                        dayofweek |
                         Tuesday  |   .2755784   .0220008    12.53   0.000     .2324575    .3186993
                       Wednesday  |   .2289247   .0211821    10.81   0.000     .1874085    .2704408
                        Thursday  |   .3074144   .0219284    14.02   0.000     .2644355    .3503933
                          Friday  |  -.1016425   .0195401    -5.20   0.000    -.1399404   -.0633445
                                  |
dayofweek#c.adj_div_8_leave_count |
                         Tuesday  |   .0055225   .0015977     3.46   0.001     .0023912    .0086538
                       Wednesday  |  -.0022851   .0015125    -1.51   0.131    -.0052496    .0006794
                        Thursday  |  -.0038312   .0015367    -2.49   0.013    -.0068431   -.0008194
                          Friday  |     .00196   .0013997     1.40   0.161    -.0007834    .0047033
                                  |
                      grouped_div |
                             803  |  -.2300285   .0329602    -6.98   0.000    -.2946293   -.1654276
                             804  |  -.1150689   .0320652    -3.59   0.000    -.1779155   -.0522223
                             805  |  -.1220342   .0382654    -3.19   0.001     -.197033   -.0470354
                             806  |  -.1008089   .0311733    -3.23   0.001    -.1619074   -.0397104
                             807  |  -.1912147   .0369518    -5.17   0.000    -.2636388   -.1187906
                             808  |  -.3559647   .0697174    -5.11   0.000    -.4926083    -.219321
                             809  |  -.0877301    .036689    -2.39   0.017    -.1596392    -.015821
                             810  |  -.1320186   .0352119    -3.75   0.000    -.2010326   -.0630045
                             811  |  -.6222633   .0266715   -23.33   0.000    -.6745385   -.5699882
                             812  |   .4481546    .027849    16.09   0.000     .3935715    .5027377
                             814  |   .4989764   .0321712    15.51   0.000      .435922    .5620308
                             816  |   .2486406   .0274961     9.04   0.000     .1947492     .302532
                             818  |   .2237557   .0290109     7.71   0.000     .1668954     .280616
                             819  |   .4344283    .031646    13.73   0.000     .3724033    .4964533
                             824  |   1.008606   .0564806    17.86   0.000      .897906    1.119306
                             828  |   .1496248   .0532384     2.81   0.005     .0452794    .2539701
                             999  |  -.0654362    .033498    -1.95   0.051    -.1310911    .0002188
                                  |
                            _cons |   1.067563   .0260549    40.97   0.000     1.016496    1.118629
---------------------------------------------------------------------------------------------------

. tab has_datevar

has_datevar |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    178,857       69.04       69.04
          1 |     80,223       30.96      100.00
------------+-----------------------------------
      Total |    259,080      100.00

. probit work c.adj_div_8_leave_count##i.dayofweek##i.grouped_div i.grouped_div if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -60921.602  
Iteration 2:  Log likelihood = -60830.506  
Iteration 3:  Log likelihood = -60828.372  
Iteration 4:  Log likelihood = -60828.342  
Iteration 5:  Log likelihood = -60828.342  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(179)  = 7459.93
                                                       Prob > chi2   =  0.0000
Log likelihood = -60828.342                            Pseudo R2     =  0.0578

---------------------------------------------------------------------------------------------------------------
                                         work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------------------+----------------------------------------------------------------
                        adj_div_8_leave_count |   .0227387   .0318502     0.71   0.475    -.0396866     .085164
                                              |
                                    dayofweek |
                                     Tuesday  |   .2159139   .1193523     1.81   0.070    -.0180123      .44984
                                   Wednesday  |   .2295138   .1202893     1.91   0.056    -.0062489    .4652766
                                    Thursday  |   .2708907   .1216997     2.23   0.026     .0323637    .5094177
                                      Friday  |   .1974847   .1120473     1.76   0.078     -.022124    .4170935
                                              |
            dayofweek#c.adj_div_8_leave_count |
                                     Tuesday  |    .009194    .047088     0.20   0.845    -.0830968    .1014849
                                   Wednesday  |   .0048896   .0475345     0.10   0.918    -.0882763    .0980555
                                    Thursday  |  -.0636193   .0458787    -1.39   0.166    -.1535398    .0263012
                                      Friday  |  -.0894966   .0436435    -2.05   0.040    -.1750363   -.0039569
                                              |
                                  grouped_div |
                                         803  |  -.3735231    .099102    -3.77   0.000    -.5677595   -.1792867
                                         804  |   .1588358   .1138611     1.39   0.163    -.0643278    .3819995
                                         805  |   .2757596   .1607544     1.72   0.086    -.0393132    .5908325
                                         806  |   .0413718   .1253741     0.33   0.741    -.2043569    .2871005
                                         807  |  -.1225124   .1292419    -0.95   0.343    -.3758218     .130797
                                         808  |   .3236317   .2847734     1.14   0.256     -.234514    .8817773
                                         809  |   .0733196   .1371038     0.53   0.593    -.1953989    .3420382
                                         810  |    -.17999   .1206862    -1.49   0.136    -.4165307    .0565507
                                         811  |  -.1398551   .1056527    -1.32   0.186    -.3469306    .0672203
                                         812  |   .7448037   .0977393     7.62   0.000     .5532382    .9363692
                                         814  |   .7590398   .1111586     6.83   0.000     .5411729    .9769066
                                         816  |   .7690578   .1129245     6.81   0.000     .5477299    .9903857
                                         818  |   .4846941     .11686     4.15   0.000     .2556527    .7137354
                                         819  |   .8835964   .1112737     7.94   0.000      .665504    1.101689
                                         824  |   1.347591   .2082217     6.47   0.000     .9394841    1.755698
                                         828  |   .0922396   .1395842     0.66   0.509    -.1813403    .3658196
                                         999  |   .1352255   .1223915     1.10   0.269    -.1046574    .3751084
                                              |
          grouped_div#c.adj_div_8_leave_count |
                                         803  |  -.1623969   .0530838    -3.06   0.002    -.2664392   -.0583546
                                         804  |  -.1286747   .0505986    -2.54   0.011    -.2278461   -.0295032
                                         805  |  -.1811888   .0661918    -2.74   0.006    -.3109224   -.0514553
                                         806  |  -.0478124   .0427558    -1.12   0.263    -.1316121    .0359874
                                         807  |  -.1904818   .0636781    -2.99   0.003    -.3152885   -.0656751
                                         808  |  -.6171912   .2824641    -2.19   0.029    -1.170811   -.0635718
                                         809  |  -.1314122   .0614851    -2.14   0.033    -.2519208   -.0109036
                                         810  |  -.1186108   .0518749    -2.29   0.022    -.2202838   -.0169378
                                         811  |  -.0907414   .0352687    -2.57   0.010    -.1598668    -.021616
                                         812  |  -.0618298   .0321949    -1.92   0.055    -.1249307     .001271
                                         814  |  -.0538552   .0320962    -1.68   0.093    -.1167627    .0090523
                                         816  |  -.0854254   .0327098    -2.61   0.009    -.1495354   -.0213153
                                         818  |  -.0965102   .0353854    -2.73   0.006    -.1658644    -.027156
                                         819  |  -.0555262   .0321046    -1.73   0.084    -.1184501    .0073976
                                         824  |   .0089379   .1373442     0.07   0.948    -.2602517    .2781275
                                         828  |   .0878722   .1572694     0.56   0.576    -.2203701    .3961144
                                         999  |  -.1473708   .0472767    -3.12   0.002    -.2400315   -.0547101
                                              |
                        dayofweek#grouped_div |
                                 Tuesday#803  |   .6392995   .1680674     3.80   0.000     .3098935    .9687054
                                 Tuesday#804  |  -.1458847   .1836538    -0.79   0.427    -.5058395    .2140701
                                 Tuesday#805  |  -.0115498    .246146    -0.05   0.963     -.493987    .4708875
                                 Tuesday#806  |  -.0921065   .1936679    -0.48   0.634    -.4716886    .2874756
                                 Tuesday#807  |   .1489011   .2244842     0.66   0.507    -.2910798     .588882
                                 Tuesday#808  |  -.1342424   .4052947    -0.33   0.740    -.9286055    .6601207
                                 Tuesday#809  |   .0170633   .2155147     0.08   0.937    -.4053377    .4394642
                                 Tuesday#810  |   .4573515   .2238166     2.04   0.041     .0186791    .8960239
                                 Tuesday#811  |  -.6376737   .1709082    -3.73   0.000    -.9726476   -.3026999
                                 Tuesday#812  |  -.3513595    .160805    -2.19   0.029    -.6665316   -.0361875
                                 Tuesday#814  |  -.6031987   .1870429    -3.22   0.001     -.969796   -.2366013
                                 Tuesday#816  |  -.6467541   .1835116    -3.52   0.000     -1.00643   -.2870779
                                 Tuesday#818  |   .2717387   .2150437     1.26   0.206    -.1497391    .6932166
                                 Tuesday#819  |  -.4619377   .1977243    -2.34   0.019    -.8494702   -.0744051
                                 Tuesday#824  |  -.2913577   .2998123    -0.97   0.331    -.8789789    .2962636
                                 Tuesday#828  |   .3149424   .2322516     1.36   0.175    -.1402624    .7701473
                                 Tuesday#999  |   .1927772   .2018172     0.96   0.339    -.2027773    .5883317
                               Wednesday#803  |   .9105653   .1753706     5.19   0.000     .5668453    1.254285
                               Wednesday#804  |  -.1621837   .1770389    -0.92   0.360    -.5091736    .1848061
                               Wednesday#805  |  -.0612919   .2347007    -0.26   0.794    -.5212969     .398713
                               Wednesday#806  |  -.1234119   .1841196    -0.67   0.503    -.4842797    .2374559
                               Wednesday#807  |   .7516122   .2489641     3.02   0.003     .2636515    1.239573
                               Wednesday#808  |  -.5084985   .3826329    -1.33   0.184    -1.258445    .2414481
                               Wednesday#809  |   .0627405   .2177319     0.29   0.773    -.3640062    .4894871
                               Wednesday#810  |   .3980895   .2071578     1.92   0.055    -.0079324    .8041114
                               Wednesday#811  |  -.6389988   .1744256    -3.66   0.000    -.9808666    -.297131
                               Wednesday#812  |  -.6051883   .1494416    -4.05   0.000    -.8980885   -.3122882
                               Wednesday#814  |  -.5073426   .1785326    -2.84   0.004      -.85726   -.1574252
                               Wednesday#816  |  -.4744155    .167709    -2.83   0.005    -.8031192   -.1457119
                               Wednesday#818  |   .3568728   .2080259     1.72   0.086    -.0508505    .7645961
                               Wednesday#819  |  -.4507373   .1684967    -2.68   0.007    -.7809848   -.1204899
                               Wednesday#824  |   -.319891   .2886774    -1.11   0.268    -.8856882    .2459063
                               Wednesday#828  |    .156877   .2187812     0.72   0.473    -.2719263    .5856803
                               Wednesday#999  |   .3645422   .2101959     1.73   0.083    -.0474342    .7765187
                                Thursday#803  |   .3907738   .1664549     2.35   0.019     .0645283    .7170194
                                Thursday#804  |  -.2552789   .1797519    -1.42   0.156    -.6075862    .0970284
                                Thursday#805  |  -.1450624   .2428651    -0.60   0.550    -.6210691    .3309444
                                Thursday#806  |   .0855734   .1971471     0.43   0.664    -.3008278    .4719747
                                Thursday#807  |   .2930952   .2201546     1.33   0.183    -.1383999    .7245903
                                Thursday#808  |   .1598559   .4591595     0.35   0.728    -.7400802    1.059792
                                Thursday#809  |   .3028989   .2423063     1.25   0.211    -.1720128    .7778106
                                Thursday#810  |   .4358246   .2180837     2.00   0.046     .0083885    .8632607
                                Thursday#811  |  -.6573051   .1648239    -3.99   0.000    -.9803541   -.3342561
                                Thursday#812  |  -.1745836   .1682489    -1.04   0.299    -.5043454    .1551781
                                Thursday#814  |  -.1545338   .1967729    -0.79   0.432    -.5402017     .231134
                                Thursday#816  |  -.5258717   .1938167    -2.71   0.007    -.9057454   -.1459981
                                Thursday#818  |   -.026601   .1992826    -0.13   0.894    -.4171877    .3639857
                                Thursday#819  |  -.9274124   .1742394    -5.32   0.000    -1.268915   -.5859095
                                Thursday#824  |  -.6367207   .2722929    -2.34   0.019    -1.170405   -.1030364
                                Thursday#828  |   .2356228   .2357267     1.00   0.318     -.226393    .6976387
                                Thursday#999  |   .0990883   .2040536     0.49   0.627    -.3008494    .4990261
                                  Friday#803  |  -.2458508   .1453807    -1.69   0.091    -.5307917    .0390902
                                  Friday#804  |  -.4224094   .1681021    -2.51   0.012    -.7518833   -.0929354
                                  Friday#805  |  -.3592012   .2207008    -1.63   0.104    -.7917669    .0733644
                                  Friday#806  |  -.3289119   .1829674    -1.80   0.072    -.6875213    .0296976
                                  Friday#807  |  -.4101746    .190106    -2.16   0.031    -.7827755   -.0375737
                                  Friday#808  |  -.5739951   .3811077    -1.51   0.132    -1.320953    .1729623
                                  Friday#809  |   -.466449   .1950715    -2.39   0.017    -.8487821   -.0841159
                                  Friday#810  |  -.2235164   .1779564    -1.26   0.209    -.5723046    .1252718
                                  Friday#811  |  -.6044932   .1440919    -4.20   0.000     -.886908   -.3220783
                                  Friday#812  |  -.4360917   .1467396    -2.97   0.003     -.723696   -.1484874
                                  Friday#814  |   -.454295   .1655649    -2.74   0.006    -.7787962   -.1297938
                                  Friday#816  |  -.4915736   .1682672    -2.92   0.003    -.8213713    -.161776
                                  Friday#818  |   -.497437   .1686634    -2.95   0.003    -.8280113   -.1668628
                                  Friday#819  |  -.6908657   .1592557    -4.34   0.000    -1.003001   -.3787303
                                  Friday#824  |   -.659659   .2611285    -2.53   0.012    -1.171461   -.1478566
                                  Friday#828  |  -.2875522   .1990978    -1.44   0.149    -.6777767    .1026722
                                  Friday#999  |  -.1622498   .1785487    -0.91   0.364    -.5121988    .1876991
                                              |
dayofweek#grouped_div#c.adj_div_8_leave_count |
                                 Tuesday#803  |   .0961765   .0828595     1.16   0.246    -.0662252    .2585781
                                 Tuesday#804  |   .1342711   .0785066     1.71   0.087     -.019599    .2881411
                                 Tuesday#805  |   .0583572   .0977928     0.60   0.551    -.1333132    .2500277
                                 Tuesday#806  |   .0394706   .0631842     0.62   0.532    -.0843683    .1633094
                                 Tuesday#807  |   .1513081   .1044683     1.45   0.148     -.053446    .3560621
                                 Tuesday#808  |   .2421912   .3900926     0.62   0.535    -.5223763    1.006759
                                 Tuesday#809  |   .0625509   .0919269     0.68   0.496    -.1176226    .2427244
                                 Tuesday#810  |   .0434281   .0855739     0.51   0.612    -.1242936    .2111499
                                 Tuesday#811  |   .0708784   .0522268     1.36   0.175    -.0314844    .1732411
                                 Tuesday#812  |   .0222206   .0477674     0.47   0.642    -.0714017     .115843
                                 Tuesday#814  |   .0265506   .0475945     0.56   0.577    -.0667329    .1198342
                                 Tuesday#816  |   .0562331    .048571     1.16   0.247    -.0389643    .1514304
                                 Tuesday#818  |   .0185654   .0557741     0.33   0.739    -.0907498    .1278807
                                 Tuesday#819  |   .0223218   .0476905     0.47   0.640    -.0711499    .1157935
                                 Tuesday#824  |   .1397194   .2193926     0.64   0.524    -.2902821    .5697209
                                 Tuesday#828  |   .1884678    .289651     0.65   0.515    -.3792377    .7561732
                                 Tuesday#999  |  -.0092828    .071017    -0.13   0.896    -.1484736     .129908
                               Wednesday#803  |  -.0430629   .0799126    -0.54   0.590    -.1996887    .1135628
                               Wednesday#804  |   .0545994   .0731371     0.75   0.455    -.0887467    .1979455
                               Wednesday#805  |   -.041679   .0930597    -0.45   0.654    -.2240726    .1407145
                               Wednesday#806  |  -.0315492   .0604885    -0.52   0.602    -.1501045    .0870061
                               Wednesday#807  |   -.060581   .1083478    -0.56   0.576    -.2729387    .1517768
                               Wednesday#808  |   .3792016   .3831656     0.99   0.322    -.3717892    1.130192
                               Wednesday#809  |   .0594397   .0916668     0.65   0.517    -.1202239    .2391033
                               Wednesday#810  |   .0241696   .0807369     0.30   0.765    -.1340719     .182411
                               Wednesday#811  |   .0711782   .0529116     1.35   0.179    -.0325266     .174883
                               Wednesday#812  |   .0275094    .047981     0.57   0.566    -.0665316    .1215504
                               Wednesday#814  |   .0191685   .0479578     0.40   0.689     -.074827     .113164
                               Wednesday#816  |   .0315173   .0485379     0.65   0.516    -.0636153    .1266499
                               Wednesday#818  |   .0115802   .0549965     0.21   0.833    -.0962109    .1193713
                               Wednesday#819  |   .0137946   .0478774     0.29   0.773    -.0800434    .1076326
                               Wednesday#824  |   -.052006   .1732553    -0.30   0.764    -.3915801    .2875681
                               Wednesday#828  |  -.1927689   .2236861    -0.86   0.389    -.6311856    .2456478
                               Wednesday#999  |   -.005196   .0741314    -0.07   0.944    -.1504909    .1400989
                                Thursday#803  |    .175571   .0770408     2.28   0.023     .0245737    .3265682
                                Thursday#804  |   .1329055    .073245     1.81   0.070     -.010652    .2764631
                                Thursday#805  |   .0914059   .0947359     0.96   0.335    -.0942731    .2770848
                                Thursday#806  |    .051078   .0610949     0.84   0.403    -.0686657    .1708218
                                Thursday#807  |   .1672359   .0994766     1.68   0.093    -.0277346    .3622065
                                Thursday#808  |  -.5055651   .4582501    -1.10   0.270    -1.403719    .3925885
                                Thursday#809  |   .0415952   .0968265     0.43   0.667    -.1481813    .2313717
                                Thursday#810  |   .1081605   .0817993     1.32   0.186    -.0521632    .2684841
                                Thursday#811  |   .1446657   .0503334     2.87   0.004     .0460141    .2433173
                                Thursday#812  |   .0890909   .0466398     1.91   0.056    -.0023214    .1805033
                                Thursday#814  |   .0742339   .0464292     1.60   0.110    -.0167658    .1652335
                                Thursday#816  |   .1121401   .0475868     2.36   0.018     .0188717    .2054085
                                Thursday#818  |   .0923486   .0527374     1.75   0.080    -.0110147     .195712
                                Thursday#819  |   .0931081    .046276     2.01   0.044     .0024088    .1838073
                                Thursday#824  |   .1482932   .1755546     0.84   0.398    -.1957875     .492374
                                Thursday#828  |   .2843169   .2893887     0.98   0.326    -.2828745    .8515082
                                Thursday#999  |   .1636852   .0713846     2.29   0.022      .023774    .3035964
                                  Friday#803  |   .2026518   .0719178     2.82   0.005     .0616955     .343608
                                  Friday#804  |    .135121   .0709417     1.90   0.057    -.0039222    .2741642
                                  Friday#805  |   .1496991   .0888631     1.68   0.092    -.0244694    .3238677
                                  Friday#806  |   .0880533   .0589735     1.49   0.135    -.0275327    .2036393
                                  Friday#807  |   .2269807    .090554     2.51   0.012     .0494982    .4044632
                                  Friday#808  |   .0919413   .3912552     0.23   0.814    -.6749047    .8587874
                                  Friday#809  |   .1893748   .0850371     2.23   0.026     .0227052    .3560445
                                  Friday#810  |   .1487884   .0732705     2.03   0.042     .0051808     .292396
                                  Friday#811  |   .1289168   .0480461     2.68   0.007     .0347482    .2230853
                                  Friday#812  |   .1140995   .0441562     2.58   0.010     .0275549    .2006441
                                  Friday#814  |   .1022352   .0440174     2.32   0.020     .0159627    .1885077
                                  Friday#816  |   .1221022   .0448985     2.72   0.007     .0341028    .2101016
                                  Friday#818  |   .1121376   .0482767     2.32   0.020     .0175171    .2067581
                                  Friday#819  |   .0987751   .0439917     2.25   0.025      .012553    .1849972
                                  Friday#824  |    .083186   .1621676     0.51   0.608    -.2346568    .4010287
                                  Friday#828  |  -.1325605   .1983556    -0.67   0.504    -.5213304    .2562094
                                  Friday#999  |   .0532481   .0656051     0.81   0.417    -.0753356    .1818318
                                              |
                                        _cons |   .9919228   .0748842    13.25   0.000     .8451524    1.138693
---------------------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count#i.dayofweek i.grouped_div i.analysis_workdate if dayofweek!=0 & dayofweek!=6 & has_datevar ==1

note: 20639.analysis_workdate != 0 predicts success perfectly;
      20639.analysis_workdate omitted and 446 obs not used.

Iteration 0:  Log likelihood = -26221.486  
Iteration 1:  Log likelihood = -24576.522  
Iteration 2:  Log likelihood = -24513.035  
Iteration 3:  Log likelihood = -24508.935  
Iteration 4:  Log likelihood = -24508.834  
Iteration 5:  Log likelihood = -24508.833  

Probit regression                                      Number of obs =  70,687
                                                       LR chi2(197)  = 3425.31
                                                       Prob > chi2   =  0.0000
Log likelihood = -24508.833                            Pseudo R2     =  0.0653

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
dayofweek#c.adj_div_8_leave_count |
                          Monday  |    .003845   .0027808     1.38   0.167    -.0016054    .0092953
                         Tuesday  |   .0014796   .0029707     0.50   0.618    -.0043429     .007302
                       Wednesday  |  -.0056566   .0029699    -1.90   0.057    -.0114776    .0001644
                        Thursday  |  -.0087983   .0028315    -3.11   0.002    -.0143478   -.0032487
                          Friday  |   -.002057   .0027549    -0.75   0.455    -.0074565    .0033424
                                  |
                      grouped_div |
                             803  |  -.2221921   .0527221    -4.21   0.000    -.3255255   -.1188586
                             804  |  -.1186058   .0508542    -2.33   0.020    -.2182782   -.0189333
                             805  |  -.1303728   .0606922    -2.15   0.032    -.2493273   -.0114183
                             806  |  -.1777435   .0491485    -3.62   0.000    -.2740728   -.0814141
                             807  |  -.2118777   .0587216    -3.61   0.000    -.3269699   -.0967854
                             808  |  -.5080078   .0999558    -5.08   0.000    -.7039176    -.312098
                             809  |   -.130876   .0587144    -2.23   0.026    -.2459542   -.0157979
                             810  |  -.1083056   .0567468    -1.91   0.056    -.2195273    .0029161
                             811  |  -.7213776    .042614   -16.93   0.000    -.8048996   -.6378557
                             812  |   .2464566   .0485511     5.08   0.000     .1512982     .341615
                             814  |   .1502359   .0607383     2.47   0.013      .031191    .2692808
                             816  |   .0849758   .0472501     1.80   0.072    -.0076327    .1775844
                             818  |   .1580642   .0466722     3.39   0.001     .0665885      .24954
                             819  |   .1191299   .0593851     2.01   0.045     .0027372    .2355225
                             824  |   .9453774   .0848538    11.14   0.000     .7790669    1.111688
                             828  |   .1632368   .0860263     1.90   0.058    -.0053717    .3318452
                             999  |  -.0593291    .053638    -1.11   0.269    -.1644576    .0457994
                                  |
                analysis_workdate |
                           20094  |   .3910881   .1272404     3.07   0.002     .1417015    .6404748
                           20095  |   .4323798   .1263823     3.42   0.001     .1846751    .6800846
                           20097  |   .0059057   .1099611     0.05   0.957     -.209614    .2214254
                           20100  |  -.0974893   .1126661    -0.87   0.387    -.3183107    .1233322
                           20102  |   .3357378   .1206477     2.78   0.005     .0992726    .5722029
                           20104  |  -.0087975    .109184    -0.08   0.936    -.2227941    .2051992
                           20110  |   .1972821   .1164036     1.69   0.090    -.0308649    .4254291
                           20114  |  -.0346691   .1143236    -0.30   0.762    -.2587393    .1894011
                           20117  |   .4208418   .1227958     3.43   0.001     .1801664    .6615171
                           20124  |   .5206604   .1262644     4.12   0.000     .2731868    .7681341
                           20125  |  -.1307662   .1068536    -1.22   0.221    -.3401954    .0786629
                           20131  |    .357511   .1219758     2.93   0.003     .1184429    .5965791
                           20136  |   .1920192   .1206145     1.59   0.111    -.0443809    .4284193
                           20137  |   .1574692   .1174344     1.34   0.180     -.072698    .3876365
                           20138  |   .3386615   .1207437     2.80   0.005     .1020083    .5753148
                           20139  |   .0625586   .1110616     0.56   0.573    -.1551182    .2802354
                           20145  |   .3987945   .1221636     3.26   0.001     .1593581    .6382308
                           20151  |    .408996   .1224554     3.34   0.001     .1689879    .6490042
                           20152  |     .42117    .122076     3.45   0.001     .1819054    .6604346
                           20163  |   .0516117    .116782     0.44   0.659    -.1772768    .2805003
                           20164  |   .4755315   .1284971     3.70   0.000     .2236818    .7273811
                           20166  |   .3490471   .1213962     2.88   0.004      .111115    .5869792
                           20167  |   .0319008   .1101635     0.29   0.772    -.1840158    .2478173
                           20170  |  -.0796754   .1159342    -0.69   0.492    -.3069023    .1475514
                           20172  |   .5309241   .1293314     4.11   0.000     .2774392     .784409
                           20173  |   .4666143   .1250665     3.73   0.000     .2214885    .7117401
                           20180  |   .1316941   .1180169     1.12   0.264    -.0996148    .3630029
                           20184  |  -.0483825   .1166696    -0.41   0.678    -.2770508    .1802858
                           20185  |    .188123   .1222088     1.54   0.124    -.0514018    .4276479
                           20186  |   .3340314   .1226536     2.72   0.006     .0936348     .574428
                           20191  |  -.0424961   .1146343    -0.37   0.711    -.2671752     .182183
                           20192  |   .5431672   .1313115     4.14   0.000     .2858014    .8005329
                           20194  |   .4379746   .1232882     3.55   0.000     .1963341     .679615
                           20200  |   .3771601   .1221216     3.09   0.002     .1378063     .616514
                           20207  |   .3306947   .1206565     2.74   0.006     .0942123    .5671771
                           20209  |   .1142656   .1117021     1.02   0.306    -.1046664    .3331977
                           20215  |    .332536     .12021     2.77   0.006     .0969287    .5681433
                           20222  |   .3428138   .1203826     2.85   0.004     .1068683    .5787594
                           20223  |   .1316533   .1125895     1.17   0.242     -.089018    .3523246
                           20234  |   .1694529   .1190812     1.42   0.155    -.0639419    .4028477
                           20235  |   .0288815   .1147679     0.25   0.801    -.1960594    .2538224
                           20236  |    .093714   .1152709     0.81   0.416    -.1322127    .3196408
                           20240  |  -.0835763   .1134346    -0.74   0.461    -.3059041    .1387514
                           20242  |   .2031845   .1180723     1.72   0.085    -.0282329     .434602
                           20247  |  -.0082322   .1137868    -0.07   0.942    -.2312502    .2147857
                           20248  |    .454706    .127085     3.58   0.000      .205624     .703788
                           20254  |  -.1236601    .113641    -1.09   0.277    -.3463924    .0990721
                           20255  |   .3948721   .1261799     3.13   0.002     .1475641    .6421802
                           20257  |   .3690673   .1206145     3.06   0.002     .1326672    .6054674
                           20258  |  -.0005371   .1094715    -0.00   0.996    -.2150973     .214023
                           20262  |   .2970572   .1236642     2.40   0.016     .0546799    .5394346
                           20263  |   .2978602   .1209432     2.46   0.014     .0608159    .5349045
                           20268  |   .0611682   .1171787     0.52   0.602    -.1684977    .2908341
                           20269  |   .4128605   .1265149     3.26   0.001     .1648959    .6608252
                           20275  |  -.0979562   .1139385    -0.86   0.390    -.3212715    .1253591
                           20276  |   .4906564   .1300785     3.77   0.000     .2357072    .7456057
                           20277  |   .2764162   .1196135     2.31   0.021      .041978    .5108544
                           20278  |   .5591618    .127228     4.39   0.000     .3097995    .8085241
                           20283  |    .374977   .1251099     3.00   0.003     .1297662    .6201879
                           20285  |   .4544991   .1243548     3.65   0.000     .2107682    .6982301
                           20286  |  -.0487357   .1089703    -0.45   0.655    -.2623135    .1648421
                           20289  |  -.1388509   .1144154    -1.21   0.225    -.3631009    .0853991
                           20290  |    .373947   .1263241     2.96   0.003     .1263563    .6215378
                           20291  |    .317422   .1211161     2.62   0.009     .0800388    .5548052
                           20292  |   .5163264    .126815     4.07   0.000     .2677736    .7648792
                           20293  |   .0324714   .1108354     0.29   0.770    -.1847619    .2497048
                           20296  |  -.1230385   .1140424    -1.08   0.281    -.3465574    .1004805
                           20297  |   .3621467   .1253522     2.89   0.004      .116461    .6078324
                           20298  |   .3349916   .1220992     2.74   0.006     .0956815    .5743017
                           20304  |   .5510086   .1341577     4.11   0.000     .2880644    .8139528
                           20312  |   .2686909   .1189351     2.26   0.024     .0355824    .5017995
                           20317  |  -.1882858    .112574    -1.67   0.094    -.4089267    .0323552
                           20326  |   .4865417   .1256696     3.87   0.000     .2402338    .7328497
                           20332  |   .3894967   .1252802     3.11   0.002      .143952    .6350415
                           20333  |   .4252121    .123615     3.44   0.001     .1829312    .6674931
                           20339  |   .2620643   .1214101     2.16   0.031     .0241049    .5000237
                           20341  |   .3029497   .1189311     2.55   0.011      .069849    .5360504
                           20345  |  -.0728655   .1131616    -0.64   0.520    -.2946583    .1489272
                           20352  |  -.1442565   .1133481    -1.27   0.203    -.3664148    .0779017
                           20353  |   .4332891   .1272849     3.40   0.001     .1838152     .682763
                           20355  |   .3917277    .121758     3.22   0.001     .1530864    .6303691
                           20359  |  -.0686421   .1135232    -0.60   0.545    -.2911436    .1538593
                           20367  |   .5826782   .1327898     4.39   0.000      .322415    .8429413
                           20368  |   .5719271   .1295419     4.41   0.000     .3180296    .8258246
                           20377  |   -.114025   .1076085    -1.06   0.289    -.3249337    .0968837
                           20381  |   .5528299    .131061     4.22   0.000     .2959551    .8097047
                           20382  |   .3810911    .122239     3.12   0.002     .1415071     .620675
                           20383  |   .4590114   .1240046     3.70   0.000      .215967    .7020559
                           20384  |   .0150604   .1093426     0.14   0.890    -.1992471    .2293679
                           20388  |   .4801598   .1284371     3.74   0.000     .2284276    .7318919
                           20390  |   .5499861   .1277595     4.30   0.000      .299582    .8003902
                           20391  |  -.0861811   .1082027    -0.80   0.426    -.2982544    .1258923
                           20394  |  -.0760137   .1131152    -0.67   0.502    -.2977155    .1456881
                           20398  |   .0001787   .1093632     0.00   0.999    -.2141692    .2145266
                           20409  |   .3134228   .1237995     2.53   0.011     .0707803    .5560653
                           20412  |  -.0615404   .1080637    -0.57   0.569    -.2733413    .1502605
                           20415  |  -.3468089   .1101046    -3.15   0.002    -.5626099   -.1310078
                           20417  |  -.2948128   .1098776    -2.68   0.007     -.510169   -.0794566
                           20418  |   1.761976   .2699259     6.53   0.000     1.232931    2.291021
                           20424  |   .1647062   .1183225     1.39   0.164    -.0672016    .3966141
                           20426  |  -.2228631   .1061114    -2.10   0.036    -.4308377   -.0148885
                           20431  |   .1879483   .1179772     1.59   0.111    -.0432828    .4191794
                           20436  |   -.137033   .1124742    -1.22   0.223    -.3574783    .0834124
                           20437  |   .2647968   .1232122     2.15   0.032     .0233053    .5062883
                           20438  |   .2417046   .1186516     2.04   0.042     .0091518    .4742573
                           20439  |   .3343897   .1210481     2.76   0.006     .0971398    .5716397
                           20445  |   .2902679   .1221007     2.38   0.017      .050955    .5295809
                           20451  |   .1997886    .123741     1.61   0.106    -.0427393    .4423164
                           20457  |  -.1254117   .1146552    -1.09   0.274    -.3501318    .0993084
                           20459  |   .3044206   .1233308     2.47   0.014     .0626966    .5461446
                           20460  |   .4697899   .1249483     3.76   0.000     .2248957     .714684
                           20461  |   .0599574   .1112734     0.54   0.590    -.1581344    .2780492
                           20465  |    .600787   .1331437     4.51   0.000     .3398301    .8617439
                           20466  |    .418972   .1227961     3.41   0.001      .178296     .659648
                           20471  |   1.717114   .2679505     6.41   0.000     1.191941    2.242288
                           20475  |  -.1383971   .1067629    -1.30   0.195    -.3476485    .0708543
                           20479  |   .4447158   .1247773     3.56   0.000     .2001568    .6892748
                           20482  |   -.066856   .1080572    -0.62   0.536    -.2786444    .1449323
                           20489  |  -.1045847   .1077683    -0.97   0.332    -.3158067    .1066374
                           20493  |   .5182774   .1312184     3.95   0.000     .2610941    .7754607
                           20494  |   .3766991   .1221167     3.08   0.002     .1373548    .6160435
                           20496  |  -.0362417   .1089265    -0.33   0.739    -.2497337    .1772503
                           20500  |   .2296733   .1214873     1.89   0.059    -.0084374     .467784
                           20516  |   .4174459   .1213361     3.44   0.001     .1796314    .6552603
                           20521  |   .3813166   .1246294     3.06   0.002     .1370474    .6255857
                           20528  |   .4941768   .1288103     3.84   0.000     .2417133    .7466403
                           20535  |   .4808257   .1304709     3.69   0.000     .2251075    .7365439
                           20536  |   .3859829    .124233     3.11   0.002     .1424907    .6294752
                           20542  |   .2044576   .1206949     1.69   0.090    -.0321001    .4410153
                           20544  |   .4245513    .123686     3.43   0.001     .1821312    .6669715
                           20550  |   .3878668   .1222775     3.17   0.002     .1482074    .6275262
                           20559  |    .008783   .1096033     0.08   0.936    -.2060355    .2236016
                           20562  |   -.115135   .1123209    -1.03   0.305      -.33528    .1050099
                           20565  |   .3845378   .1211087     3.18   0.001     .1471691    .6219065
                           20570  |   .5182015   .1290533     4.02   0.000     .2652617    .7711413
                           20577  |    .492834   .1286248     3.83   0.000     .2407341    .7449339
                           20578  |     .40152   .1234371     3.25   0.001     .1595877    .6434523
                           20579  |   .5327429   .1265201     4.21   0.000     .2847682    .7807177
                           20584  |   .4572248   .1272141     3.59   0.000     .2078898    .7065598
                           20585  |   .4431833   .1232458     3.60   0.000     .2016261    .6847406
                           20586  |   .5128685   .1258158     4.08   0.000      .266274     .759463
                           20592  |   .5623007     .12886     4.36   0.000     .3097398    .8148617
                           20604  |   1.985911   .3639358     5.46   0.000      1.27261    2.699212
                           20605  |    .054374   .1158677     0.47   0.639    -.1727225    .2814705
                           20607  |   .2816875    .119411     2.36   0.018     .0476463    .5157288
                           20608  |  -.1814088   .1070642    -1.69   0.090    -.3912508    .0284332
                           20613  |   .3962369   .1238438     3.20   0.001     .1535076    .6389662
                           20614  |   .5732991   .1293186     4.43   0.000     .3198394    .8267589
                           20618  |  -.0714508   .1159941    -0.62   0.538     -.298795    .1558935
                           20619  |    .462534   .1302749     3.55   0.000        .2072    .7178681
                           20621  |   .3868359   .1239317     3.12   0.002     .1439342    .6297376
                           20622  |   .0188834   .1110255     0.17   0.865    -.1987225    .2364893
                           20628  |   .3703223    .122772     3.02   0.003     .1296936     .610951
                           20629  |  -.0441129   .1099144    -0.40   0.688    -.2595411    .1713154
                           20632  |  -.1021248   .1146491    -0.89   0.373    -.3268328    .1225832
                           20639  |          0  (empty)
                           20643  |  -.0475652   .1105274    -0.43   0.667    -.2641949    .1690644
                           20647  |   .4968646   .1297044     3.83   0.000     .2426488    .7510805
                           20648  |   .3825981   .1229396     3.11   0.002      .141641    .6235552
                           20653  |  -.0158811   .1151292    -0.14   0.890    -.2415303     .209768
                           20656  |   .4391254   .1219445     3.60   0.000     .2001185    .6781324
                           20657  |   .0202256   .1088536     0.19   0.853    -.1931235    .2335747
                           20661  |   .5706591   .1307373     4.36   0.000     .3144186    .8268996
                           20664  |  -.0040202   .1077064    -0.04   0.970    -.2151208    .2070804
                           20667  |  -.0796058   .1134019    -0.70   0.483    -.3018694    .1426579
                           20668  |    .457101   .1255973     3.64   0.000     .2109349    .7032672
                           20670  |   .4951926   .1227868     4.03   0.000     .2545349    .7358502
                           20671  |   .0269571   .1083965     0.25   0.804    -.1854961    .2394102
                           20675  |   .4000053    .123854     3.23   0.001     .1572559    .6427546
                           20677  |   .4588967   .1225697     3.74   0.000     .2186644    .6991289
                           20678  |  -.0824312    .106902    -0.77   0.441    -.2919552    .1270929
                           20684  |    .623501   .1292509     4.82   0.000     .3701738    .8768281
                           20690  |   .1859444   .1159352     1.60   0.109    -.0412843    .4131731
                           20692  |  -.1135502   .1062195    -1.07   0.285    -.3217366    .0946362
                           20695  |  -.1312219   .1122677    -1.17   0.242    -.3512626    .0888188
                           20697  |   .3743435   .1204472     3.11   0.002     .1382713    .6104156
                                  |
                            _cons |   .9519242   .0901034    10.56   0.000     .7753248    1.128524
---------------------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count#i.dayofweek i.main_div i.analysis_workdate if dayofweek!=0 & dayofweek!=6 & has_datevar ==1

note: 20639.analysis_workdate != 0 predicts success perfectly;
      20639.analysis_workdate omitted and 446 obs not used.

Iteration 0:  Log likelihood = -26221.486  
Iteration 1:  Log likelihood = -24558.119  
Iteration 2:  Log likelihood = -24492.036  
Iteration 3:  Log likelihood = -24487.933  
Iteration 4:  Log likelihood = -24487.833  
Iteration 5:  Log likelihood = -24487.832  

Probit regression                                      Number of obs =  70,687
                                                       LR chi2(200)  = 3467.31
                                                       Prob > chi2   =  0.0000
Log likelihood = -24487.832                            Pseudo R2     =  0.0661

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
dayofweek#c.adj_div_8_leave_count |
                          Monday  |   .0044955   .0027857     1.61   0.107    -.0009645    .0099554
                         Tuesday  |   .0020844    .002976     0.70   0.484    -.0037485    .0079173
                       Wednesday  |  -.0050421   .0029753    -1.69   0.090    -.0108736    .0007894
                        Thursday  |  -.0082756   .0028371    -2.92   0.004    -.0138362   -.0027151
                          Friday  |  -.0014676   .0027593    -0.53   0.595    -.0068757    .0039405
                                  |
                         main_div |
                               8  |  -1.609528   .4271822    -3.77   0.000     -2.44679   -.7722662
                              10  |  -2.045942   .6433014    -3.18   0.001     -3.30679   -.7850944
                             800  |  -1.288979   .2854849    -4.52   0.000    -1.848519   -.7294391
                             801  |  -1.172296   .2848431    -4.12   0.000    -1.730578   -.6140137
                             803  |  -1.393996   .2850159    -4.89   0.000    -1.952617   -.8353748
                             804  |  -1.290687   .2847001    -4.53   0.000    -1.848689    -.732685
                             805  |  -1.302653   .2866394    -4.54   0.000    -1.864456   -.7408499
                             806  |  -1.350819   .2844662    -4.75   0.000    -1.908362   -.7932751
                             807  |  -1.383864   .2862039    -4.84   0.000    -1.944813   -.8229147
                             808  |  -1.678559   .2973514    -5.65   0.000    -2.261357   -1.095761
                             809  |  -1.303217   .2862178    -4.55   0.000    -1.864194   -.7422405
                             810  |  -1.280687   .2858312    -4.48   0.000    -1.840906   -.7204677
                             811  |  -1.895293   .2834693    -6.69   0.000    -2.450883   -1.339703
                             812  |  -.9327037   .2847574    -3.28   0.001    -1.490818   -.3745896
                             814  |  -1.033517    .287385    -3.60   0.000    -1.596781   -.4702526
                             816  |   -1.09329   .2844788    -3.84   0.000    -1.650859   -.5357222
                             818  |  -1.016357   .2841322    -3.58   0.000    -1.573246   -.4594679
                             819  |  -1.064144    .287068    -3.71   0.000    -1.626788   -.5015015
                             824  |  -.2262751   .2926578    -0.77   0.439    -.7998739    .3473238
                             828  |  -1.008092   .2929846    -3.44   0.001    -1.582331   -.4338525
                                  |
                analysis_workdate |
                           20094  |   .3906602   .1272937     3.07   0.002     .1411691    .6401513
                           20095  |   .4309618   .1264503     3.41   0.001     .1831238    .6787997
                           20097  |   .0050047   .1100048     0.05   0.964    -.2106008    .2206102
                           20100  |  -.0959228   .1127235    -0.85   0.395    -.3168567    .1250112
                           20102  |   .3373064   .1206973     2.79   0.005      .100744    .5738689
                           20104  |  -.0078334   .1092368    -0.07   0.943    -.2219337    .2062668
                           20110  |   .2002065   .1165106     1.72   0.086      -.02815    .4285631
                           20114  |  -.0345481   .1143959    -0.30   0.763    -.2587599    .1896637
                           20117  |   .4218645   .1228457     3.43   0.001     .1810914    .6626376
                           20124  |   .5217381   .1263061     4.13   0.000     .2741826    .7692936
                           20125  |  -.1300218   .1069077    -1.22   0.224    -.3395569    .0795134
                           20131  |   .3565893   .1220435     2.92   0.003     .1173885    .5957901
                           20136  |   .1914773   .1206937     1.59   0.113     -.045078    .4280326
                           20137  |   .1564256   .1174969     1.33   0.183     -.073864    .3867153
                           20138  |   .3389715   .1207974     2.81   0.005     .1022129    .5757302
                           20139  |   .0618791   .1111134     0.56   0.578    -.1558991    .2796573
                           20145  |   .3992482   .1222242     3.27   0.001     .1596932    .6388031
                           20151  |   .4094445   .1225017     3.34   0.001     .1693455    .6495435
                           20152  |   .4217884   .1221302     3.45   0.001     .1824176    .6611592
                           20163  |   .0506501   .1168422     0.43   0.665    -.1783564    .2796565
                           20164  |   .4756371    .128571     3.70   0.000     .2236426    .7276317
                           20166  |   .3494534   .1214485     2.88   0.004     .1114187    .5874881
                           20167  |   .0312422   .1102135     0.28   0.777    -.1847723    .2472567
                           20170  |  -.0820265   .1160044    -0.71   0.480    -.3093908    .1453379
                           20172  |   .5296453   .1293856     4.09   0.000     .2760543    .7832364
                           20173  |   .4666453   .1251187     3.73   0.000     .2214172    .7118733
                           20180  |    .131191   .1180844     1.11   0.267    -.1002502    .3626323
                           20184  |  -.0507995   .1167545    -0.44   0.663    -.2796342    .1780351
                           20185  |   .1861719   .1222968     1.52   0.128    -.0535255    .4258692
                           20186  |   .3324099    .122715     2.71   0.007     .0918929    .5729269
                           20191  |  -.0431838   .1146914    -0.38   0.707    -.2679748    .1816072
                           20192  |   .5438542   .1314025     4.14   0.000       .28631    .8013985
                           20194  |   .4390683   .1233383     3.56   0.000     .1973298    .6808068
                           20200  |   .3775627   .1221916     3.09   0.002     .1380715    .6170539
                           20207  |   .3312907   .1207146     2.74   0.006     .0946945     .567887
                           20209  |   .1150268   .1117553     1.03   0.303    -.1040097    .3340633
                           20215  |   .3382578   .1204131     2.81   0.005     .1022524    .5742633
                           20222  |   .3466947   .1204499     2.88   0.004     .1106173    .5827721
                           20223  |   .1340197   .1126619     1.19   0.234    -.0867936     .354833
                           20234  |   .1708834   .1191578     1.43   0.152    -.0626616    .4044283
                           20235  |   .0292648   .1148317     0.25   0.799    -.1958012    .2543307
                           20236  |   .0948146    .115329     0.82   0.411    -.1312259    .3208552
                           20240  |  -.0831612   .1134929    -0.73   0.464    -.3056032    .1392807
                           20242  |   .2033853   .1181319     1.72   0.085    -.0281489    .4349196
                           20247  |  -.0070626   .1138437    -0.06   0.951    -.2301921    .2160669
                           20248  |   .4558483   .1271496     3.59   0.000     .2066396    .7050569
                           20254  |  -.1248475   .1137116    -1.10   0.272    -.3477182    .0980232
                           20255  |   .3954151   .1262946     3.13   0.002     .1478821     .642948
                           20257  |   .3701794    .120663     3.07   0.002     .1336843    .6066746
                           20258  |  -.0000275   .1095211    -0.00   1.000     -.214685      .21463
                           20262  |   .2974461   .1237649     2.40   0.016     .0548715    .5400208
                           20263  |   .2976951   .1210077     2.46   0.014     .0605243    .5348659
                           20268  |   .0608205   .1172456     0.52   0.604    -.1689766    .2906176
                           20269  |   .4131467   .1265818     3.26   0.001     .1650509    .6612425
                           20275  |  -.0991663   .1140049    -0.87   0.384    -.3226119    .1242793
                           20276  |   .4911293   .1301718     3.77   0.000     .2359973    .7462613
                           20277  |   .2764519   .1196849     2.31   0.021     .0418739      .51103
                           20278  |   .5601148   .1272861     4.40   0.000     .3106386    .8095911
                           20283  |    .375206    .125175     3.00   0.003     .1298676    .6205444
                           20285  |   .4556264   .1244203     3.66   0.000     .2117672    .6994857
                           20286  |  -.0493342   .1090148    -0.45   0.651    -.2629993    .1643308
                           20289  |  -.1443083   .1143682    -1.26   0.207    -.3684658    .0798492
                           20290  |   .3737927   .1264094     2.96   0.003     .1260348    .6215506
                           20291  |   .3173562   .1211763     2.62   0.009      .079855    .5548574
                           20292  |   .5173546   .1268795     4.08   0.000     .2686753    .7660339
                           20293  |   .0317525   .1108887     0.29   0.775    -.1855854    .2490904
                           20296  |  -.1245088   .1141049    -1.09   0.275    -.3481504    .0991327
                           20297  |   .3616777   .1254242     2.88   0.004     .1158508    .6075047
                           20298  |   .3340266   .1221679     2.73   0.006      .094582    .5734712
                           20304  |   .5498757   .1342231     4.10   0.000     .2868032    .8129481
                           20312  |     .27145   .1190164     2.28   0.023     .0381822    .5047179
                           20317  |  -.1868862   .1127055    -1.66   0.097     -.407785    .0340125
                           20326  |   .4869121   .1257341     3.87   0.000     .2404777    .7333465
                           20332  |   .3897262   .1253442     3.11   0.002     .1440561    .6353963
                           20333  |    .424996   .1236674     3.44   0.001     .1826125    .6673796
                           20339  |   .2630899   .1214756     2.17   0.030     .0250021    .5011776
                           20341  |   .3047306    .119002     2.56   0.010      .071491    .5379703
                           20345  |  -.0721573   .1132158    -0.64   0.524    -.2940563    .1497416
                           20352  |  -.1449084   .1134122    -1.28   0.201    -.3671922    .0773754
                           20353  |   .4341323    .127353     3.41   0.001      .184525    .6837397
                           20355  |   .3931261   .1218171     3.23   0.001      .154369    .6318832
                           20359  |  -.0717973    .113476    -0.63   0.527    -.2942061    .1506115
                           20367  |   .5848876   .1328536     4.40   0.000     .3244992    .8452759
                           20368  |   .5736469   .1295888     4.43   0.000     .3196575    .8276364
                           20377  |  -.1123864   .1076531    -1.04   0.297    -.3233826    .0986099
                           20381  |   .5568651    .131136     4.25   0.000     .2998434    .8138869
                           20382  |   .3841922    .122289     3.14   0.002     .1445101    .6238742
                           20383  |   .4645226   .1241594     3.74   0.000     .2211746    .7078705
                           20384  |     .01831   .1093972     0.17   0.867    -.1961047    .2327246
                           20388  |    .484766   .1285167     3.77   0.000     .2328778    .7366542
                           20390  |   .5579589   .1280814     4.36   0.000     .3069239    .8089938
                           20391  |  -.0819975   .1082508    -0.76   0.449    -.2941651    .1301701
                           20394  |  -.0735865   .1131771    -0.65   0.516    -.2954095    .1482366
                           20398  |   .0033432   .1094046     0.03   0.976    -.2110859    .2177722
                           20409  |   .3136904   .1238651     2.53   0.011     .0709193    .5564615
                           20412  |  -.0615387   .1081041    -0.57   0.569    -.2734189    .1503416
                           20415  |  -.3470292   .1101662    -3.15   0.002     -.562951   -.1311073
                           20417  |  -.2946729   .1099374    -2.68   0.007    -.5101462   -.0791997
                           20418  |   1.767393   .2698162     6.55   0.000     1.238563    2.296222
                           20424  |   .1641411   .1183795     1.39   0.166    -.0678785    .3961608
                           20426  |  -.2228612   .1061482    -2.10   0.036    -.4309078   -.0148146
                           20431  |   .1883988   .1180297     1.60   0.110    -.0429351    .4197327
                           20436  |  -.1365031   .1125326    -1.21   0.225     -.357063    .0840568
                           20437  |    .263855   .1232815     2.14   0.032     .0222277    .5054823
                           20438  |   .2428425   .1187169     2.05   0.041     .0101617    .4755234
                           20439  |   .3352526   .1211128     2.77   0.006     .0978758    .5726294
                           20445  |   .2907774   .1221282     2.38   0.017     .0514104    .5301444
                           20451  |   .1997731    .123783     1.61   0.107     -.042837    .4423833
                           20457  |  -.1268745   .1147343    -1.11   0.269    -.3517496    .0980006
                           20459  |   .3016416   .1234021     2.44   0.015     .0597779    .5435053
                           20460  |   .4701096   .1250062     3.76   0.000      .225102    .7151172
                           20461  |   .0591589   .1113286     0.53   0.595    -.1590412    .2773591
                           20465  |   .6019612   .1331935     4.52   0.000     .3409068    .8630157
                           20466  |   .4203817   .1228575     3.42   0.001     .1795855    .6611779
                           20471  |   1.721926   .2679536     6.43   0.000     1.196747    2.247106
                           20475  |  -.1371296   .1068047    -1.28   0.199     -.346463    .0722038
                           20479  |   .4470678   .1248226     3.58   0.000     .2024201    .6917156
                           20482  |  -.0651625   .1081029    -0.60   0.547    -.2770403    .1467153
                           20489  |  -.1033744   .1078097    -0.96   0.338    -.3146776    .1079287
                           20493  |   .5184527   .1312678     3.95   0.000     .2611726    .7757329
                           20494  |   .3769654   .1221623     3.09   0.002     .1375317    .6163991
                           20496  |  -.0347031   .1089741    -0.32   0.750    -.2482884    .1788821
                           20500  |   .2305611   .1215748     1.90   0.058    -.0077211    .4688433
                           20516  |   .4201383   .1213926     3.46   0.001     .1822131    .6580634
                           20521  |    .382327   .1246797     3.07   0.002     .1379594    .6266947
                           20528  |   .4954842   .1288749     3.84   0.000     .2428941    .7480742
                           20535  |   .4804323    .130541     3.68   0.000     .2245767     .736288
                           20536  |   .3849412   .1243013     3.10   0.002     .1413151    .6285673
                           20542  |   .2037074   .1207618     1.69   0.092    -.0329815    .4403962
                           20544  |   .4247607   .1237491     3.43   0.001     .1822169    .6673044
                           20550  |   .3895331   .1223221     3.18   0.001     .1497863    .6292799
                           20559  |   .0110617   .1096467     0.10   0.920    -.2038418    .2259653
                           20562  |  -.1141956   .1123783    -1.02   0.310    -.3344531    .1060618
                           20565  |   .3872542   .1211491     3.20   0.001     .1498064     .624702
                           20570  |   .5203478   .1290918     4.03   0.000     .2673325     .773363
                           20577  |    .494798   .1286807     3.85   0.000     .2425884    .7470076
                           20578  |   .4022296   .1234849     3.26   0.001     .1602037    .6442555
                           20579  |   .5346846    .126558     4.22   0.000     .2866355    .7827337
                           20584  |   .4588043   .1272566     3.61   0.000      .209386    .7082225
                           20585  |   .4458162   .1233045     3.62   0.000     .2041439    .6874885
                           20586  |   .5154896   .1258736     4.10   0.000     .2687819    .7621973
                           20592  |   .5639069   .1289039     4.37   0.000     .3112599    .8165539
                           20604  |    1.98955   .3637637     5.47   0.000     1.276587    2.702514
                           20605  |   .0550302   .1159323     0.47   0.635    -.1721929    .2822534
                           20607  |   .2822156   .1194631     2.36   0.018     .0480721     .516359
                           20608  |  -.1816869   .1071118    -1.70   0.090    -.3916223    .0282485
                           20613  |   .3975205   .1238695     3.21   0.001     .1547408    .6403001
                           20614  |    .573779   .1293732     4.44   0.000     .3202123    .8273458
                           20618  |  -.0733392   .1160654    -0.63   0.527    -.3008233    .1541449
                           20619  |   .4616998   .1303538     3.54   0.000     .2062112    .7171885
                           20621  |   .3859717   .1239922     3.11   0.002     .1429514     .628992
                           20622  |   .0175823   .1110765     0.16   0.874    -.2001236    .2352883
                           20628  |   .3702147   .1228395     3.01   0.003     .1294536    .6109758
                           20629  |  -.0459529   .1099676    -0.42   0.676    -.2614854    .1695795
                           20632  |  -.1035691   .1147127    -0.90   0.367    -.3284019    .1212637
                           20639  |          0  (empty)
                           20643  |  -.0497535   .1105816    -0.45   0.653    -.2664895    .1669825
                           20647  |   .4954629   .1298023     3.82   0.000     .2410552    .7498707
                           20648  |   .3800116   .1230085     3.09   0.002     .1389193    .6211038
                           20653  |  -.0181493   .1152001    -0.16   0.875    -.2439374    .2076388
                           20656  |   .4387395    .121996     3.60   0.000     .1996318    .6778472
                           20657  |   .0187487   .1089016     0.17   0.863    -.1946945    .2321919
                           20661  |   .5698988   .1308162     4.36   0.000     .3135037    .8262939
                           20664  |  -.0053309   .1077512    -0.05   0.961    -.2165195    .2058576
                           20667  |   -.081795   .1134661    -0.72   0.471    -.3041844    .1405944
                           20668  |   .4566569   .1256517     3.63   0.000     .2103841    .7029296
                           20670  |   .4956026   .1228523     4.03   0.000     .2548166    .7363886
                           20671  |   .0266712   .1084437     0.25   0.806    -.1858745     .239217
                           20675  |   .3997929   .1239218     3.23   0.001     .1569105    .6426752
                           20677  |   .4586593   .1226396     3.74   0.000     .2182902    .6990285
                           20678  |  -.0834353   .1069482    -0.78   0.435      -.29305    .1261794
                           20684  |   .6248541   .1292802     4.83   0.000     .3714695    .8782387
                           20690  |   .1853684    .115995     1.60   0.110    -.0419775    .4127144
                           20692  |  -.1135264   .1062585    -1.07   0.285    -.3217893    .0947364
                           20695  |  -.1329179   .1123289    -1.18   0.237    -.3530785    .0872427
                           20697  |   .3741082   .1205012     3.10   0.002     .1379302    .6102863
                                  |
                            _cons |   2.122565   .2942257     7.21   0.000     1.545893    2.699236
---------------------------------------------------------------------------------------------------

. reg work c.adj_div_8_leave_count#i.dayofweek i.main_div i.analysis_workdate if dayofweek!=0 & dayofweek!=6 & has_datevar ==1

      Source |       SS           df       MS      Number of obs   =    71,133
-------------+----------------------------------   F(201, 70931)   =     19.50
       Model |  396.981249       201  1.97503109   Prob > F        =    0.0000
    Residual |  7182.97998    70,931  .101267147   R-squared       =    0.0524
-------------+----------------------------------   Adj R-squared   =    0.0497
       Total |  7579.96123    71,132  .106561902   Root MSE        =    .31822

---------------------------------------------------------------------------------------------------
                             work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------------------+----------------------------------------------------------------
dayofweek#c.adj_div_8_leave_count |
                          Monday  |   .0022789   .0005421     4.20   0.000     .0012163    .0033415
                         Tuesday  |   .0004813   .0005277     0.91   0.362    -.0005529    .0015156
                       Wednesday  |  -.0003563   .0005431    -0.66   0.512    -.0014208    .0007081
                        Thursday  |   -.001067   .0005214    -2.05   0.041     -.002089    -.000045
                          Friday  |   .0009905   .0005346     1.85   0.064    -.0000573    .0020382
                                  |
                         main_div |
                               8  |  -.2061947   .0770768    -2.68   0.007    -.3572651   -.0551243
                              10  |  -.3774332   .1445435    -2.61   0.009    -.6607381   -.0941283
                             800  |  -.1389298   .0256787    -5.41   0.000      -.18926   -.0885996
                             801  |  -.1114698   .0252923    -4.41   0.000    -.1610427    -.061897
                             803  |  -.1650556   .0255466    -6.46   0.000    -.2151269   -.1149844
                             804  |  -.1378666   .0253227    -5.44   0.000     -.187499   -.0882343
                             805  |  -.1388303   .0262181    -5.30   0.000    -.1902176   -.0874429
                             806  |  -.1526495   .0252517    -6.05   0.000    -.2021427   -.1031563
                             807  |  -.1598163   .0260938    -6.12   0.000      -.21096   -.1086726
                             808  |  -.2352075   .0322844    -7.29   0.000    -.2984848   -.1719302
                             809  |  -.1416171   .0260155    -5.44   0.000    -.1926074   -.0906268
                             810  |  -.1375046   .0258163    -5.33   0.000    -.1881045   -.0869048
                             811  |  -.3132426   .0248789   -12.59   0.000    -.3620051   -.2644801
                             812  |  -.0779343   .0251172    -3.10   0.002    -.1271641   -.0287046
                             814  |  -.0999164   .0261058    -3.83   0.000    -.1510838   -.0487491
                             816  |  -.1039558   .0250569    -4.15   0.000    -.1530672   -.0548444
                             818  |  -.0887819   .0248917    -3.57   0.000    -.1375696   -.0399943
                             819  |  -.1051887   .0260072    -4.04   0.000    -.1561628   -.0542146
                             824  |  -.0086026   .0255679    -0.34   0.737    -.0587156    .0415105
                             828  |  -.0840844    .027921    -3.01   0.003    -.1388095   -.0293594
                                  |
                analysis_workdate |
                           20094  |   .0937351   .0240324     3.90   0.000     .0466317    .1408384
                           20095  |   .0996571   .0243962     4.08   0.000     .0518405    .1474736
                           20097  |   .0031423   .0230069     0.14   0.891    -.0419512    .0482358
                           20100  |  -.0139462   .0237483    -0.59   0.557    -.0604929    .0326004
                           20102  |   .0839759   .0237899     3.53   0.000     .0373477     .130604
                           20104  |   .0017122   .0228577     0.07   0.940     -.043089    .0465133
                           20110  |    .058017   .0238865     2.43   0.015     .0111995    .1048345
                           20114  |  -.0016878   .0238407    -0.07   0.944    -.0484155      .04504
                           20117  |   .1005634    .023951     4.20   0.000     .0536194    .1475073
                           20124  |   .1151358   .0239493     4.81   0.000     .0681952    .1620765
                           20125  |  -.0286328   .0228186    -1.25   0.210    -.0733572    .0160916
                           20131  |   .0888491   .0242284     3.67   0.000     .0413614    .1363367
                           20136  |    .061732   .0240468     2.57   0.010     .0146004    .1088636
                           20137  |   .0476851   .0241104     1.98   0.048     .0004288    .0949414
                           20138  |   .0871772   .0241009     3.62   0.000     .0399395    .1344149
                           20139  |   .0179591   .0230057     0.78   0.435    -.0271321    .0630504
                           20145  |   .0961406   .0240288     4.00   0.000     .0490443     .143237
                           20151  |    .096761   .0237389     4.08   0.000     .0502327    .1432892
                           20152  |   .1007692   .0238754     4.22   0.000     .0539734    .1475649
                           20163  |   .0161392   .0240392     0.67   0.502    -.0309776    .0632561
                           20164  |   .1079277   .0238606     4.52   0.000      .061161    .1546944
                           20166  |   .0862883   .0241063     3.58   0.000       .03904    .1335366
                           20167  |   .0125424   .0229691     0.55   0.585     -.032477    .0575618
                           20170  |  -.0166819   .0244502    -0.68   0.495    -.0646043    .0312404
                           20172  |   .1128515   .0242889     4.65   0.000     .0652452    .1604578
                           20173  |   .1073736   .0242005     4.44   0.000     .0599406    .1548066
                           20180  |    .039832   .0246173     1.62   0.106    -.0084179    .0880818
                           20184  |  -.0088055   .0244982    -0.36   0.719    -.0568219    .0392109
                           20185  |   .0593962   .0243679     2.44   0.015     .0116351    .1071572
                           20186  |   .0812955   .0243059     3.34   0.001     .0336559    .1289351
                           20191  |  -.0050179   .0239606    -0.21   0.834    -.0519806    .0419448
                           20192  |   .1173884    .023824     4.93   0.000     .0706934    .1640834
                           20194  |   .1028746   .0239597     4.29   0.000     .0559137    .1498354
                           20200  |   .0917632   .0238908     3.84   0.000     .0449374     .138589
                           20207  |   .0812831   .0238264     3.41   0.001     .0345833    .1279828
                           20209  |    .031457   .0228678     1.38   0.169    -.0133638    .0762778
                           20215  |   .0849299     .02392     3.55   0.000     .0380468    .1318131
                           20222  |   .0876591   .0238983     3.67   0.000     .0408185    .1344997
                           20223  |   .0377039   .0230407     1.64   0.102    -.0074558    .0828636
                           20234  |   .0561793   .0238916     2.35   0.019     .0093518    .1030069
                           20235  |   .0193377   .0240824     0.80   0.422    -.0278638    .0665391
                           20236  |   .0349641   .0241301     1.45   0.147    -.0123307     .082259
                           20240  |  -.0118448   .0239337    -0.49   0.621    -.0587548    .0350651
                           20242  |   .0587087   .0240867     2.44   0.015     .0114988    .1059186
                           20247  |   .0097439   .0237617     0.41   0.682    -.0368289    .0563168
                           20248  |   .1049886   .0238038     4.41   0.000     .0583331    .1516441
                           20254  |  -.0232435   .0241435    -0.96   0.336    -.0705648    .0240777
                           20255  |   .0972746   .0240544     4.04   0.000     .0501281    .1444211
                           20257  |   .0925129   .0239085     3.87   0.000     .0456523    .1393735
                           20258  |   .0052157     .02298     0.23   0.820    -.0398251    .0502565
                           20262  |   .0798623   .0240916     3.31   0.001     .0326428    .1270818
                           20263  |   .0771995   .0241305     3.20   0.001     .0299037    .1244953
                           20268  |    .018708   .0240957     0.78   0.438    -.0285194    .0659355
                           20269  |   .0974618    .023887     4.08   0.000     .0506433    .1442803
                           20275  |  -.0190597   .0240844    -0.79   0.429    -.0662651    .0281457
                           20276  |   .1090139   .0239975     4.54   0.000     .0619789    .1560488
                           20277  |   .0729141   .0240122     3.04   0.002     .0258503    .1199779
                           20278  |   .1221743   .0239495     5.10   0.000     .0752333    .1691154
                           20283  |   .0926439   .0239058     3.88   0.000     .0457885    .1394993
                           20285  |    .105346   .0240794     4.37   0.000     .0581506    .1525415
                           20286  |   -.008978    .023065    -0.39   0.697    -.0541853    .0362292
                           20289  |  -.0298756   .0242898    -1.23   0.219    -.0774836    .0177324
                           20290  |   .0921495   .0240934     3.82   0.000     .0449264    .1393725
                           20291  |   .0808131   .0240699     3.36   0.001     .0336362      .12799
                           20292  |   .1152878   .0242202     4.76   0.000     .0678162    .1627594
                           20293  |   .0107548   .0231528     0.46   0.642    -.0346245    .0561342
                           20296  |  -.0252087    .024193    -1.04   0.297    -.0726268    .0222094
                           20297  |   .0905162   .0240303     3.77   0.000      .043417    .1376155
                           20298  |   .0827974   .0242036     3.42   0.001     .0353585    .1302363
                           20304  |   .1166064   .0241834     4.82   0.000      .069207    .1640057
                           20312  |   .0726253   .0239109     3.04   0.002     .0257599    .1194906
                           20317  |  -.0415332   .0240997    -1.72   0.085    -.0887686    .0057022
                           20326  |   .1085561   .0238919     4.54   0.000     .0617281    .1553842
                           20332  |   .0962294   .0238776     4.03   0.000     .0494294    .1430293
                           20333  |   .0992492   .0239351     4.15   0.000     .0523366    .1461619
                           20339  |   .0739126   .0238826     3.09   0.002     .0271028    .1207224
                           20341  |   .0799947    .023874     3.35   0.001     .0332018    .1267876
                           20345  |  -.0083688   .0238009    -0.35   0.725    -.0550186    .0382809
                           20352  |  -.0292043   .0241022    -1.21   0.226    -.0764446     .018036
                           20353  |   .1025857   .0239277     4.29   0.000     .0556874    .1494839
                           20355  |   .0959521   .0239754     4.00   0.000     .0489603    .1429439
                           20359  |  -.0058882   .0238537    -0.25   0.805    -.0526413    .0408649
                           20367  |   .1215783   .0237734     5.11   0.000     .0749825    .1681742
                           20368  |   .1203355   .0238765     5.04   0.000     .0735376    .1671333
                           20377  |  -.0183406   .0229546    -0.80   0.424    -.0633316    .0266503
                           20381  |   .1181513   .0237405     4.98   0.000     .0716199    .1646826
                           20382  |   .0936039   .0238589     3.92   0.000     .0468405    .1403674
                           20383  |   .1076324   .0238894     4.51   0.000     .0608092    .1544556
                           20384  |   .0111164    .022848     0.49   0.627    -.0336657    .0558985
                           20388  |   .1087787   .0237501     4.58   0.000     .0622286    .1553289
                           20390  |   .1197693   .0238753     5.02   0.000     .0729738    .1665647
                           20391  |  -.0119815   .0229133    -0.52   0.601    -.0568914    .0329285
                           20394  |  -.0051197    .023726    -0.22   0.829    -.0516226    .0413831
                           20398  |   .0130302   .0228269     0.57   0.568    -.0317104    .0577708
                           20409  |   .0828852   .0239483     3.46   0.001     .0359466    .1298238
                           20412  |  -.0083169   .0229092    -0.36   0.717    -.0532188    .0365851
                           20415  |  -.0856335   .0239134    -3.58   0.000    -.1325037   -.0387633
                           20417  |  -.0693225   .0239572    -2.89   0.004    -.1162785   -.0223665
                           20418  |   .1853862   .0233801     7.93   0.000     .1395612    .2312112
                           20424  |    .049285   .0242299     2.03   0.042     .0017945    .0967756
                           20426  |  -.0526239   .0230074    -2.29   0.022    -.0977183   -.0075294
                           20431  |   .0571933   .0240417     2.38   0.017     .0100716    .1043149
                           20436  |  -.0228645   .0238624    -0.96   0.338    -.0696348    .0239057
                           20437  |   .0773819   .0241874     3.20   0.001     .0299747    .1247892
                           20438  |   .0691403   .0239308     2.89   0.004     .0222359    .1160446
                           20439  |   .0849878   .0240898     3.53   0.000     .0377719    .1322038
                           20445  |    .073265   .0243306     3.01   0.003     .0255771    .1209528
                           20451  |   .0648151   .0245312     2.64   0.008     .0167341    .1128962
                           20457  |  -.0262502   .0242752    -1.08   0.280    -.0738295    .0213292
                           20459  |   .0757139   .0246195     3.08   0.002     .0274598    .1239681
                           20460  |   .1076372   .0241311     4.46   0.000     .0603403    .1549342
                           20461  |   .0186295   .0231045     0.81   0.420    -.0266552    .0639141
                           20465  |   .1227775   .0237242     5.18   0.000     .0762781     .169277
                           20466  |   .0992004   .0236861     4.19   0.000     .0527758    .1456251
                           20471  |    .172673   .0233365     7.40   0.000     .1269335    .2184125
                           20475  |  -.0270647   .0228094    -1.19   0.235    -.0717711    .0176416
                           20479  |   .1050858   .0234887     4.47   0.000     .0590481    .1511235
                           20482  |  -.0075425   .0228223    -0.33   0.741    -.0522742    .0371892
                           20489  |  -.0173943    .022858    -0.76   0.447    -.0621959    .0274073
                           20493  |   .1131617   .0239025     4.73   0.000     .0663129    .1600105
                           20494  |   .0921958   .0238446     3.87   0.000     .0454604    .1389311
                           20496  |   .0000667   .0228985     0.00   0.998    -.0448143    .0449477
                           20500  |   .0693225   .0240498     2.88   0.004     .0221849    .1164601
                           20516  |   .1017846   .0235855     4.32   0.000     .0555571    .1480121
                           20521  |   .0956363     .02374     4.03   0.000     .0491061    .1421666
                           20528  |   .1107806   .0237249     4.67   0.000       .06428    .1572813
                           20535  |   .1071787   .0240606     4.45   0.000     .0600201    .1543374
                           20536  |   .0922966   .0242383     3.81   0.000     .0447896    .1398036
                           20542  |   .0633305   .0240326     2.64   0.008     .0162267    .1104343
                           20544  |   .1012569   .0241761     4.19   0.000     .0538719     .148642
                           20550  |   .0944751   .0237188     3.98   0.000     .0479862    .1409639
                           20559  |   .0124849   .0228758     0.55   0.585    -.0323516    .0573214
                           20562  |  -.0170457   .0237605    -0.72   0.473    -.0636163    .0295248
                           20565  |    .095199   .0237015     4.02   0.000      .048744    .1416539
                           20570  |   .1132103   .0236252     4.79   0.000      .066905    .1595157
                           20577  |   .1087614   .0236676     4.60   0.000      .062373    .1551499
                           20578  |    .095874   .0238689     4.02   0.000     .0490911    .1426569
                           20579  |   .1163307   .0237811     4.89   0.000     .0697198    .1629416
                           20584  |   .1060121   .0237329     4.47   0.000     .0594957    .1525285
                           20585  |   .1034633   .0236039     4.38   0.000     .0571996    .1497269
                           20586  |   .1143248   .0237958     4.80   0.000     .0676851    .1609646
                           20592  |   .1197096   .0238019     5.03   0.000      .073058    .1663613
                           20604  |   .1723505   .0233695     7.38   0.000     .1265464    .2181547
                           20605  |    .034117   .0238139     1.43   0.152    -.0125582    .0807921
                           20607  |   .0768815   .0241068     3.19   0.001     .0296322    .1241308
                           20608  |  -.0425452   .0230784    -1.84   0.065    -.0877789    .0026885
                           20613  |   .0950759   .0241278     3.94   0.000     .0477854    .1423663
                           20614  |   .1256734   .0242422     5.18   0.000     .0781588     .173188
                           20618  |  -.0142944   .0244226    -0.59   0.558    -.0621626    .0335739
                           20619  |   .1044497    .024239     4.31   0.000     .0569414     .151958
                           20621  |    .093419   .0245288     3.81   0.000     .0453426    .1414955
                           20622  |   .0075406   .0232264     0.32   0.745     -.037983    .0530643
                           20628  |   .0895248   .0242936     3.69   0.000     .0419094    .1371401
                           20629  |  -.0080284   .0232635    -0.35   0.730    -.0536248     .037568
                           20632  |  -.0190157   .0241975    -0.79   0.432    -.0664428    .0284114
                           20639  |   .1712519   .0234163     7.31   0.000      .125356    .2171477
                           20643  |  -.0120628   .0233862    -0.52   0.606    -.0578997     .033774
                           20647  |   .1095071   .0240033     4.56   0.000     .0624607    .1565536
                           20648  |   .0907384   .0242238     3.75   0.000     .0432599    .1382169
                           20653  |  -.0034297   .0241133    -0.14   0.887    -.0506917    .0438323
                           20656  |   .1055659   .0239666     4.40   0.000     .0585914    .1525403
                           20657  |   .0069996   .0228645     0.31   0.760    -.0378149     .051814
                           20661  |   .1185847   .0237202     5.00   0.000     .0720931    .1650763
                           20664  |    .001743   .0226825     0.08   0.939    -.0427145    .0462006
                           20667  |  -.0167081    .023936    -0.70   0.485    -.0636226    .0302065
                           20668  |   .1031746   .0235958     4.37   0.000     .0569269    .1494223
                           20670  |   .1119648   .0236995     4.72   0.000     .0655138    .1584157
                           20671  |   .0103144   .0226397     0.46   0.649    -.0340595    .0546882
                           20675  |   .0971361   .0236494     4.11   0.000     .0507833    .1434889
                           20677  |   .1067215   .0239104     4.46   0.000     .0598572    .1535859
                           20678  |  -.0182133   .0227635    -0.80   0.424    -.0628297    .0264032
                           20684  |   .1283596   .0238728     5.38   0.000      .081569    .1751503
                           20690  |   .0553818   .0237349     2.33   0.020     .0088614    .1019022
                           20692  |  -.0233284   .0226441    -1.03   0.303    -.0677109     .021054
                           20695  |  -.0271495   .0238476    -1.14   0.255    -.0738908    .0195917
                           20697  |   .0915232   .0236807     3.86   0.000      .045109    .1379374
                                  |
                            _cons |   .9291562   .0298091    31.17   0.000     .8707305    .9875818
---------------------------------------------------------------------------------------------------

. reg work c.adj_div_8_leave_count i.main_div i.analysis_workdate if dayofweek!=0 & dayofweek!=6 & has_datevar ==1

      Source |       SS           df       MS      Number of obs   =    71,133
-------------+----------------------------------   F(197, 70935)   =     19.61
       Model |  391.452068       197  1.98706634   Prob > F        =    0.0000
    Residual |  7188.50916    70,935  .101339383   R-squared       =    0.0516
-------------+----------------------------------   Adj R-squared   =    0.0490
       Total |  7579.96123    71,132  .106561902   Root MSE        =    .31834

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0004559   .0004376     1.04   0.298    -.0004019    .0013137
                      |
             main_div |
                   8  |  -.2027209   .0771009    -2.63   0.009    -.3538386   -.0516033
                  10  |  -.3757233   .1445905    -2.60   0.009    -.6591202   -.0923263
                 800  |  -.1394385   .0256876    -5.43   0.000    -.1897862   -.0890908
                 801  |  -.1117033   .0253011    -4.41   0.000    -.1612934   -.0621132
                 803  |  -.1655016   .0255556    -6.48   0.000    -.2155905   -.1154127
                 804  |  -.1382221   .0253316    -5.46   0.000     -.187872   -.0885722
                 805  |  -.1389326   .0262272    -5.30   0.000    -.1903379   -.0875274
                 806  |  -.1532253   .0252605    -6.07   0.000    -.2027359   -.1037146
                 807  |  -.1599824    .026103    -6.13   0.000    -.2111442   -.1088206
                 808  |  -.2365302   .0322941    -7.32   0.000    -.2998266   -.1732338
                 809  |  -.1419815   .0260247    -5.46   0.000    -.1929898   -.0909731
                 810  |  -.1377719   .0258254    -5.33   0.000    -.1883895   -.0871542
                 811  |   -.314317   .0248863   -12.63   0.000    -.3630941   -.2655399
                 812  |   -.078967   .0251244    -3.14   0.002    -.1282107   -.0297232
                 814  |  -.1015492   .0261113    -3.89   0.000    -.1527273   -.0503712
                 816  |  -.1050784   .0250642    -4.19   0.000    -.1542043   -.0559526
                 818  |   -.089303   .0249003    -3.59   0.000    -.1381075   -.0404985
                 819  |  -.1070419   .0260117    -4.12   0.000    -.1580248   -.0560591
                 824  |   -.008402    .025577    -0.33   0.743    -.0585328    .0417288
                 828  |  -.0840996   .0279308    -3.01   0.003    -.1388439   -.0293553
                      |
    analysis_workdate |
               20094  |   .0854564    .022945     3.72   0.000     .0404843    .1304285
               20095  |   .0783469   .0231282     3.39   0.001     .0330157    .1236781
               20097  |   .0025776    .023013     0.11   0.911    -.0425278     .047683
               20100  |  -.0018823   .0227149    -0.08   0.934    -.0464035    .0426389
               20102  |   .0656074    .022773     2.88   0.004     .0209723    .1102425
               20104  |   .0000339   .0228464     0.00   0.999    -.0447449    .0448127
               20110  |    .029096   .0228185     1.28   0.202    -.0156281    .0738202
               20114  |   .0127274    .022716     0.56   0.575     -.031796    .0572507
               20117  |   .0717993   .0228923     3.14   0.002     .0269305    .1166681
               20124  |   .0859385   .0228716     3.76   0.000     .0411103    .1307667
               20125  |  -.0304098   .0228042    -1.33   0.182    -.0751059    .0142863
               20131  |   .0568909     .02304     2.47   0.014     .0117325    .1020493
               20136  |   .0534496   .0229573     2.33   0.020     .0084534    .0984458
               20137  |   .0276437    .022955     1.20   0.228     -.017348    .0726353
               20138  |   .0573245   .0230018     2.49   0.013     .0122411    .1024079
               20139  |   .0169023   .0230064     0.73   0.463      -.02819    .0619947
               20145  |   .0666095   .0229411     2.90   0.004     .0216449    .1115741
               20151  |   .0790498   .0227731     3.47   0.001     .0344146     .123685
               20152  |   .0729092   .0228521     3.19   0.001     .0281191    .1176993
               20163  |   .0315243   .0228814     1.38   0.168    -.0133232    .0763718
               20164  |   .0995797   .0228323     4.36   0.000     .0548284     .144331
               20166  |   .0566288   .0230159     2.46   0.014     .0115178    .1017398
               20167  |   .0112491    .022966     0.49   0.624    -.0337641    .0562624
               20170  |    .002731   .0231287     0.12   0.906    -.0426011    .0480632
               20172  |   .0922759   .0230897     4.00   0.000     .0470201    .1375318
               20173  |   .0764563   .0230592     3.32   0.001     .0312602    .1216523
               20180  |   .0063775   .0233774     0.27   0.785    -.0394421    .0521972
               20184  |   .0110529   .0231585     0.48   0.633    -.0343377    .0564435
               20185  |   .0511098   .0231888     2.20   0.028     .0056598    .0965598
               20186  |   .0608314    .023119     2.63   0.009     .0155182    .1061447
               20191  |   .0093867   .0228405     0.41   0.681    -.0353806     .054154
               20192  |   .1090305   .0228113     4.78   0.000     .0643203    .1537406
               20194  |   .0754738   .0229586     3.29   0.001      .030475    .1204726
               20200  |   .0732875   .0228681     3.20   0.001      .028466     .118109
               20207  |    .063231   .0228364     2.77   0.006     .0184717    .1079903
               20209  |   .0291369   .0228379     1.28   0.202    -.0156253    .0738991
               20215  |   .0579272    .022933     2.53   0.012     .0129786    .1028758
               20222  |   .0613504   .0229377     2.67   0.007     .0163926    .1063082
               20223  |   .0360402   .0230297     1.56   0.118     -.009098    .0811784
               20234  |   .0478363   .0229825     2.08   0.037     .0027908    .0928819
               20235  |   .0011198   .0230884     0.05   0.961    -.0441335     .046373
               20236  |   .0071642   .0231196     0.31   0.757    -.0381502    .0524785
               20240  |   -.000225    .022926    -0.01   0.992    -.0451599    .0447099
               20242  |   .0400227   .0230528     1.74   0.083    -.0051607    .0852061
               20247  |   .0192053   .0228259     0.84   0.400    -.0255334    .0639439
               20248  |   .0965987   .0229063     4.22   0.000     .0517024     .141495
               20254  |  -.0083683   .0230131    -0.36   0.716     -.053474    .0367374
               20255  |   .0889455   .0230023     3.87   0.000      .043861    .1340299
               20257  |   .0655433   .0229229     2.86   0.004     .0206145    .1104722
               20258  |    .003161   .0229585     0.14   0.890    -.0418376    .0481597
               20262  |   .0715453   .0230534     3.10   0.002     .0263607    .1167299
               20263  |   .0583911    .023089     2.53   0.011     .0131368    .1036454
               20268  |   .0326095   .0230042     1.42   0.156    -.0124788    .0776977
               20269  |   .0891424   .0228771     3.90   0.000     .0443033    .1339815
               20275  |  -.0032355   .0229109    -0.14   0.888    -.0481407    .0416697
               20276  |   .1007087   .0229603     4.39   0.000     .0557067    .1457107
               20277  |   .0535954   .0229192     2.34   0.019     .0086739    .0985169
               20278  |   .0939072   .0229116     4.10   0.000     .0490005     .138814
               20283  |   .0843113   .0229034     3.68   0.000     .0394207    .1292019
               20285  |    .076835   .0230371     3.34   0.001     .0316823    .1219877
               20286  |  -.0102433   .0230617    -0.44   0.657    -.0554443    .0349576
               20289  |   -.013177   .0230882    -0.57   0.568    -.0584298    .0320757
               20290  |   .0838581   .0230155     3.64   0.000     .0387479    .1289684
               20291  |   .0615939   .0229885     2.68   0.007     .0165364    .1066514
               20292  |   .0856354   .0231352     3.70   0.000     .0402905    .1309802
               20293  |   .0097942   .0231544     0.42   0.672    -.0355884    .0551768
               20296  |   -.008914   .0230045    -0.39   0.698    -.0540026    .0361747
               20297  |   .0822061   .0229794     3.58   0.000     .0371666    .1272457
               20298  |   .0627843   .0230548     2.72   0.006      .017597    .1079716
               20304  |    .108325   .0231028     4.69   0.000     .0630436    .1536064
               20312  |   .0539864   .0228745     2.36   0.018     .0091525    .0988203
               20317  |  -.0252202   .0229044    -1.10   0.271    -.0701128    .0196725
               20326  |   .0900145   .0228623     3.94   0.000     .0452044    .1348245
               20332  |   .0879065   .0228818     3.84   0.000     .0430582    .1327549
               20333  |   .0803161   .0228733     3.51   0.000     .0354844    .1251477
               20339  |   .0655741   .0229485     2.86   0.004      .020595    .1105531
               20341  |   .0534179   .0229017     2.33   0.020     .0085307    .0983051
               20345  |   .0018542   .0228402     0.08   0.935    -.0429126     .046621
               20352  |  -.0151922   .0230074    -0.66   0.509    -.0602866    .0299022
               20353  |   .0942499   .0229721     4.10   0.000     .0492247    .1392751
               20355  |   .0687125   .0229812     2.99   0.003     .0236694    .1137557
               20359  |   .0035627   .0229232     0.16   0.876    -.0413667    .0484921
               20367  |   .1132058   .0229362     4.94   0.000      .068251    .1581606
               20368  |   .1034963   .0229826     4.50   0.000     .0584504    .1485422
               20377  |  -.0214359   .0228933    -0.94   0.349    -.0663068     .023435
               20381  |   .1097587   .0228661     4.80   0.000     .0649413    .1545761
               20382  |   .0761935   .0229234     3.32   0.001     .0312637    .1211233
               20383  |   .0824699   .0229724     3.59   0.000     .0374442    .1274957
               20384  |   .0082739   .0227993     0.36   0.717    -.0364126    .0529604
               20388  |   .1003532   .0229183     4.38   0.000     .0554334     .145273
               20390  |    .095452   .0229882     4.15   0.000     .0503953    .1405087
               20391  |  -.0158799   .0228135    -0.70   0.486    -.0605944    .0288345
               20394  |   .0013057   .0228913     0.06   0.955    -.0435612    .0461726
               20398  |   .0084296   .0226823     0.37   0.710    -.0360276    .0528867
               20409  |   .0745601   .0229513     3.25   0.001     .0295756    .1195447
               20412  |  -.0101279   .0228943    -0.44   0.658    -.0550007    .0347449
               20415  |  -.0731903   .0228735    -3.20   0.001    -.1180224   -.0283583
               20417  |  -.0873621   .0229729    -3.80   0.000     -.132389   -.0423352
               20418  |   .1716453   .0227734     7.54   0.000     .1270095     .216281
               20424  |   .0298455   .0231354     1.29   0.197    -.0154997    .0751907
               20426  |  -.0546708   .0229855    -2.38   0.017    -.0997224   -.0096193
               20431  |   .0391482   .0230607     1.70   0.090    -.0060508    .0843472
               20436  |  -.0123024    .022892    -0.54   0.591    -.0571706    .0325658
               20437  |   .0690869    .023097     2.99   0.003     .0238168     .114357
               20438  |   .0514645   .0229751     2.24   0.025     .0064335    .0964956
               20439  |   .0571079   .0230742     2.47   0.013     .0118825    .1023334
               20445  |   .0533725   .0231983     2.30   0.021     .0079038    .0988412
               20451  |   .0565791   .0233636     2.42   0.015     .0107865    .1023718
               20457  |  -.0095067   .0230708    -0.41   0.680    -.0547254     .035712
               20459  |   .0539275   .0233131     2.31   0.021     .0082339    .0996212
               20460  |   .0785501   .0230673     3.41   0.001     .0333384    .1237619
               20461  |   .0173601   .0231015     0.75   0.452    -.0279188     .062639
               20465  |   .1144082   .0228184     5.01   0.000     .0696842    .1591322
               20466  |   .0824502   .0227929     3.62   0.000     .0377762    .1271242
               20471  |   .1710895   .0226988     7.54   0.000        .1266    .2155791
               20475  |  -.0300704   .0227526    -1.32   0.186    -.0746654    .0145247
               20479  |   .0966621   .0227108     4.26   0.000      .052149    .1411753
               20482  |  -.0108014   .0227538    -0.47   0.635    -.0553988     .033796
               20489  |  -.0203585   .0228026    -0.89   0.372    -.0650514    .0243345
               20493  |   .1048151   .0229383     4.57   0.000      .059856    .1497741
               20494  |   .0740923   .0228507     3.24   0.001     .0293051    .1188796
               20496  |  -.0029956   .0228394    -0.13   0.896    -.0477607    .0417694
               20500  |    .061023   .0230605     2.65   0.008     .0158245    .1062215
               20516  |   .0787794   .0227333     3.47   0.001     .0342222    .1233365
               20521  |   .0872364   .0228595     3.82   0.000     .0424318     .132041
               20528  |   .1023749    .022862     4.48   0.000     .0575655    .1471843
               20535  |   .0988261   .0230373     4.29   0.000     .0536731    .1439791
               20536  |   .0729593   .0231547     3.15   0.002      .027576    .1183425
               20542  |   .0549724    .023007     2.39   0.017     .0098788    .1000659
               20544  |   .0717242   .0230959     3.11   0.002     .0264563    .1169921
               20550  |   .0783656   .0228733     3.43   0.001      .033534    .1231972
               20559  |    .008724   .0227831     0.38   0.702    -.0359307    .0533788
               20562  |  -.0083994    .022853    -0.37   0.713    -.0531911    .0363924
               20565  |   .0726661   .0228698     3.18   0.001     .0278415    .1174908
               20570  |   .1047617   .0228293     4.59   0.000     .0600163     .149507
               20577  |   .1003098   .0228541     4.39   0.000     .0555158    .1451038
               20578  |   .0787187   .0229533     3.43   0.001     .0337303     .123707
               20579  |   .0922694   .0228999     4.03   0.000     .0473856    .1371533
               20584  |   .0975825   .0229037     4.26   0.000     .0526913    .1424736
               20585  |   .0879735   .0227967     3.86   0.000     .0432921     .132655
               20586  |   .0904303    .022921     3.95   0.000     .0455052    .1353554
               20592  |   .1030943    .022923     4.50   0.000     .0581652    .1480234
               20604  |   .1722063   .0226996     7.59   0.000     .1277151    .2166974
               20605  |   .0257105   .0229033     1.12   0.262      -.01918     .070601
               20607  |   .0488911   .0230882     2.12   0.034     .0036383    .0941438
               20608  |  -.0444757   .0230609    -1.93   0.054    -.0896749    .0007236
               20613  |   .0761537   .0230766     3.30   0.001     .0309236    .1213838
               20614  |   .0965395   .0231813     4.16   0.000     .0511042    .1419748
               20618  |   .0027735   .0232093     0.12   0.905    -.0427167    .0482636
               20619  |   .0961042   .0231481     4.15   0.000      .050734    .1414744
               20621  |   .0618934   .0233769     2.65   0.008     .0160747     .107712
               20622  |   .0063616   .0232256     0.27   0.784    -.0391606    .0518837
               20628  |   .0594798   .0231966     2.56   0.010     .0140146    .1049451
               20629  |  -.0088441   .0232677    -0.38   0.704    -.0544486    .0367605
               20632  |  -.0048679   .0230985    -0.21   0.833     -.050141    .0404051
               20639  |   .1730858   .0226993     7.63   0.000     .1285952    .2175765
               20643  |  -.0124621   .0233937    -0.53   0.594    -.0583136    .0333894
               20647  |   .1012041   .0228386     4.43   0.000     .0564405    .1459678
               20648  |   .0692076   .0229241     3.02   0.003     .0242764    .1141387
               20653  |   .0143291   .0228536     0.63   0.531    -.0304639     .059122
               20656  |   .0752428   .0228421     3.29   0.001     .0304723    .1200134
               20657  |   .0061224   .0228676     0.27   0.789    -.0386979    .0509428
               20661  |   .1102384   .0226894     4.86   0.000     .0657673    .1547096
               20664  |    .000309   .0226764     0.01   0.989    -.0441367    .0447547
               20667  |   -.000585   .0227419    -0.03   0.979    -.0451592    .0439891
               20668  |   .0948009   .0226252     4.19   0.000     .0504556    .1391462
               20670  |   .0835943   .0226479     3.69   0.000     .0392044    .1279842
               20671  |   .0081191   .0226139     0.36   0.720    -.0362041    .0524424
               20675  |   .0887898   .0226307     3.92   0.000     .0444337    .1331459
               20677  |   .0761095   .0227689     3.34   0.001     .0314826    .1207364
               20678  |  -.0194373   .0227612    -0.85   0.393    -.0640493    .0251747
               20684  |   .0988488   .0227786     4.34   0.000     .0542027    .1434949
               20690  |   .0363352   .0226542     1.60   0.109     -.008067    .0807374
               20692  |  -.0254328   .0226204    -1.12   0.261    -.0697687    .0189032
               20695  |  -.0117932   .0226819    -0.52   0.603    -.0562497    .0326633
               20697  |   .0730862   .0226513     3.23   0.001     .0286897    .1174827
                      |
                _cons |   .9389065   .0293841    31.95   0.000     .8813138    .9964991
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count i.main_div i.analysis_workdate if dayofweek!=0 & dayofweek!=6 & has_datevar ==1

note: 20639.analysis_workdate != 0 predicts success perfectly;
      20639.analysis_workdate omitted and 446 obs not used.

Iteration 0:  Log likelihood = -26221.486  
Iteration 1:  Log likelihood = -24573.596  
Iteration 2:  Log likelihood = -24509.051  
Iteration 3:  Log likelihood = -24505.066  
Iteration 4:  Log likelihood = -24504.968  
Iteration 5:  Log likelihood = -24504.968  

Probit regression                                      Number of obs =  70,687
                                                       LR chi2(196)  = 3433.04
                                                       Prob > chi2   =  0.0000
Log likelihood = -24504.968                            Pseudo R2     =  0.0655

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0013233   .0023821    -0.56   0.579    -.0059921    .0033456
                      |
             main_div |
                   8  |  -1.569517   .4266902    -3.68   0.000    -2.405814   -.7332195
                  10  |  -2.010228   .6398486    -3.14   0.002    -3.264308   -.7561474
                 800  |  -1.278573   .2826849    -4.52   0.000    -1.832625   -.7245205
                 801  |    -1.1585    .282042    -4.11   0.000    -1.711292   -.6057079
                 803  |  -1.383134   .2822119    -4.90   0.000    -1.936259    -.830009
                 804  |  -1.277453   .2818986    -4.53   0.000    -1.829964   -.7249419
                 805  |  -1.287449   .2838507    -4.54   0.000    -1.843786   -.7311123
                 806  |   -1.33932   .2816644    -4.76   0.000    -1.891372   -.7872682
                 807  |  -1.372414   .2834005    -4.84   0.000    -1.927869   -.8169592
                 808  |  -1.666338   .2946654    -5.66   0.000    -2.243871   -1.088804
                 809  |  -1.292041   .2834222    -4.56   0.000    -1.847538   -.7365438
                 810  |  -1.268991   .2830318    -4.48   0.000    -1.823723   -.7142585
                 811  |  -1.882556   .2806603    -6.71   0.000     -2.43264   -1.332472
                 812  |  -.9220746   .2819687    -3.27   0.001    -1.474723    -.369426
                 814  |  -1.026781   .2846207    -3.61   0.000    -1.584627   -.4689346
                 816  |  -1.083289   .2816892    -3.85   0.000    -1.635389   -.5311881
                 818  |  -1.005456   .2813338    -3.57   0.000     -1.55686   -.4540519
                 819  |  -1.058679   .2843019    -3.72   0.000      -1.6159   -.5014575
                 824  |  -.2127745   .2899401    -0.73   0.463    -.7810465    .3554976
                 828  |  -.9962545   .2902189    -3.43   0.001    -1.565073   -.4274358
                      |
    analysis_workdate |
               20094  |   .4372109   .1221895     3.58   0.000     .1977237     .676698
               20095  |    .376781   .1206457     3.12   0.002     .1403199    .6132422
               20097  |   .0050841   .1100002     0.05   0.963    -.2105123    .2206806
               20100  |  -.0299651   .1080203    -0.28   0.781     -.241681    .1817507
               20102  |   .2954421   .1160182     2.55   0.011     .0680507    .5228336
               20104  |  -.0076584   .1091394    -0.07   0.944    -.2215676    .2062508
               20110  |   .1114305   .1113445     1.00   0.317    -.1068007    .3296618
               20114  |   .0374739   .1093769     0.34   0.732    -.1769009    .2518486
               20117  |   .3317411   .1177879     2.82   0.005     .1008811    .5626011
               20124  |   .4293054    .121234     3.54   0.000     .1916911    .6669197
               20125  |  -.1296582   .1067851    -1.21   0.225    -.3389532    .0796369
               20131  |    .252074   .1161546     2.17   0.030     .0244152    .4797328
               20136  |   .2390836   .1152821     2.07   0.038     .0131349    .4650323
               20137  |   .1076835   .1118894     0.96   0.336    -.1116157    .3269826
               20138  |   .2447416   .1154423     2.12   0.034     .0184789    .4710044
               20139  |   .0619576   .1110574     0.56   0.577    -.1557109     .279626
               20145  |    .307648   .1171512     2.63   0.009     .0780358    .5372601
               20151  |   .3708956   .1182038     3.14   0.002     .1392204    .6025707
               20152  |   .3385841   .1175229     2.88   0.004     .1082435    .5689247
               20163  |   .1251925   .1117796     1.12   0.263    -.0938914    .3442765
               20164  |   .5169303   .1240377     4.17   0.000     .2738209    .7600398
               20166  |   .2566476   .1162515     2.21   0.027     .0287989    .4844963
               20167  |   .0313614   .1101434     0.28   0.776    -.1845158    .2472386
               20170  |   .0047261    .110148     0.04   0.966      -.21116    .2206122
               20172  |   .4797568   .1242091     3.86   0.000     .2363114    .7232022
               20173  |   .3697582   .1198935     3.08   0.002     .1347712    .6047452
               20180  |   .0219543   .1117815     0.20   0.844    -.1971334    .2410421
               20184  |    .038192   .1108251     0.34   0.730    -.1790212    .2554052
               20185  |    .237096   .1164161     2.04   0.042     .0089246    .4652673
               20186  |   .2831632   .1173472     2.41   0.016     .0531668    .5131595
               20191  |   .0281059   .1097017     0.26   0.798    -.1869054    .2431173
               20192  |   .5856387    .126997     4.61   0.000     .3367291    .8345482
               20194  |   .3578067   .1188433     3.01   0.003      .124878    .5907354
               20200  |   .3360155   .1176135     2.86   0.004     .1054972    .5665337
               20207  |   .2926811   .1164142     2.51   0.012     .0645135    .5208487
               20209  |   .1154808   .1115672     1.04   0.301     -.103187    .3341486
               20215  |   .2578123   .1158211     2.23   0.026     .0308071    .4848176
               20222  |   .2705713    .116119     2.33   0.020     .0429823    .4981603
               20223  |   .1342798   .1125768     1.19   0.233    -.0863667    .3549263
               20234  |   .2084885   .1148076     1.82   0.069    -.0165303    .4335073
               20235  |  -.0113657   .1100369    -0.10   0.918     -.227034    .2043025
               20236  |    .011317   .1103944     0.10   0.918     -.205052    .2276861
               20240  |  -.0201036   .1089414    -0.18   0.854    -.2336248    .1934176
               20242  |   .1617972   .1133894     1.43   0.154     -.060442    .3840364
               20247  |   .0502252   .1096659     0.46   0.647     -.164716    .2651665
               20248  |   .4905816   .1232438     3.98   0.000     .2490283    .7321349
               20254  |  -.0518005   .1086029    -0.48   0.633    -.2646582    .1610572
               20255  |   .4381864   .1215316     3.61   0.000     .1999889     .676384
               20257  |   .2909516   .1161594     2.50   0.012     .0632833    .5186199
               20258  |   .0004329   .1093657     0.00   0.997    -.2139199    .2147858
               20262  |   .3412225   .1188482     2.87   0.004     .1082845    .5741606
               20263  |   .2549174   .1162541     2.19   0.028     .0270636    .4827712
               20268  |    .129341   .1124869     1.15   0.250    -.0911293    .3498113
               20269  |   .4549112   .1220009     3.73   0.000     .2157938    .6940286
               20275  |  -.0235429   .1087322    -0.22   0.829    -.2366541    .1895684
               20276  |   .5336196   .1255885     4.25   0.000     .2874707    .7797685
               20277  |   .2315235   .1146222     2.02   0.043      .006868     .456179
               20278  |   .4762499   .1228415     3.88   0.000     .2354851    .7170148
               20283  |   .4167493   .1205768     3.46   0.001     .1804231    .6530755
               20285  |   .3705071   .1198329     3.09   0.002      .135639    .6053752
               20286  |  -.0489561   .1089483    -0.45   0.653    -.2624908    .1645787
               20289  |  -.0653986   .1089204    -0.60   0.548    -.2788787    .1480814
               20290  |      .4192   .1214021     3.45   0.001     .1812563    .6571437
               20291  |   .2728823   .1162383     2.35   0.019     .0450594    .5007052
               20292  |   .4296649   .1223789     3.51   0.000     .1898065    .6695232
               20293  |   .0320163   .1108423     0.29   0.773    -.1852306    .2492632
               20296  |  -.0475887   .1087434    -0.44   0.662    -.2607219    .1655444
               20297  |   .4050003   .1205862     3.36   0.001     .1686557    .6413448
               20298  |   .2863652   .1169236     2.45   0.014     .0571991    .5155313
               20304  |   .5954415   .1294979     4.60   0.000     .3416302    .8492527
               20312  |   .2297033   .1142898     2.01   0.044     .0056994    .4537072
               20317  |  -.1081324   .1072268    -1.01   0.313     -.318293    .1020282
               20326  |   .4454749   .1212788     3.67   0.000     .2077729    .6831769
               20332  |   .4315654   .1207767     3.57   0.000     .1948474    .6682833
               20333  |     .38157   .1189152     3.21   0.001     .1485005    .6146395
               20339  |   .3010131   .1171413     2.57   0.010     .0714204    .5306059
               20341  |   .2270668   .1145064     1.98   0.047     .0026385    .4514952
               20345  |  -.0123765   .1088641    -0.11   0.909    -.2257461    .2009931
               20352  |  -.0739223    .108415    -0.68   0.495    -.2864119    .1385672
               20353  |   .4738853   .1230743     3.85   0.000     .2326642    .7151065
               20355  |   .3134524   .1173955     2.67   0.008     .0833614    .5435434
               20359  |  -.0142958   .1092722    -0.13   0.896    -.2284654    .1998737
               20367  |   .6174571    .129384     4.77   0.000      .363869    .8710452
               20368  |   .5402722   .1260137     4.29   0.000     .2932899    .7872546
               20377  |   -.111512   .1073339    -1.04   0.299    -.3218825    .0988585
               20381  |   .5907597   .1274488     4.64   0.000     .3409647    .8405547
               20382  |   .3477821   .1182269     2.94   0.003     .1160615    .5795026
               20383  |   .3932344    .120149     3.27   0.001     .1577466    .6287222
               20384  |   .0188138   .1091099     0.17   0.863    -.1950376    .2326652
               20388  |   .5185591   .1248983     4.15   0.000      .273763    .7633552
               20390  |   .4907981   .1244152     3.94   0.000     .2469489    .7346473
               20391  |   -.081202   .1077738    -0.75   0.451    -.2924347    .1300308
               20394  |  -.0241248   .1093922    -0.22   0.825    -.2385295      .19028
               20398  |   .0045157   .1087331     0.04   0.967    -.2085972    .2176285
               20409  |   .3566828   .1191379     2.99   0.003     .1231767    .5901888
               20412  |  -.0610924   .1080006    -0.57   0.572    -.2727697    .1505849
               20415  |  -.2793642   .1052422    -2.65   0.008     -.485635   -.0730933
               20417  |  -.3350675   .1049177    -3.19   0.001    -.5407024   -.1294325
               20418  |   1.753072    .269599     6.50   0.000     1.224668    2.281476
               20424  |   .1180918   .1131294     1.04   0.297    -.1036378    .3398213
               20426  |  -.2222731   .1060112    -2.10   0.036    -.4300512    -.014495
               20431  |   .1480305   .1133625     1.31   0.192     -.074156     .370217
               20436  |  -.0741809   .1080708    -0.69   0.492    -.2859958     .137634
               20437  |   .3123794   .1179003     2.65   0.008      .081299    .5434598
               20438  |    .204604   .1143019     1.79   0.073    -.0194235    .4286315
               20439  |   .2520563   .1164785     2.16   0.030     .0237627    .4803499
               20445  |   .2437758   .1169992     2.08   0.037     .0144616      .47309
               20451  |   .2531153    .117806     2.15   0.032     .0222198    .4840108
               20457  |  -.0468573   .1092509    -0.43   0.668    -.2609852    .1672705
               20459  |   .2458435    .117242     2.10   0.036     .0160534    .4756336
               20460  |   .3834014   .1204516     3.18   0.001     .1473206    .6194822
               20461  |   .0594098   .1112625     0.53   0.593    -.1586608    .2774804
               20465  |      .6375   .1294329     4.93   0.000     .3838161    .8911839
               20466  |   .3863898   .1190098     3.25   0.001     .1531349    .6196447
               20471  |   1.742044   .2666484     6.53   0.000     1.219422    2.264665
               20475  |  -.1363402   .1065228    -1.28   0.201    -.3451211    .0724407
               20479  |   .4754053   .1215184     3.91   0.000     .2372336     .713577
               20482  |   -.064336   .1077651    -0.60   0.551    -.2755517    .1468797
               20489  |  -.1025206   .1075483    -0.95   0.340    -.3133114    .1082703
               20493  |   .5599372   .1269843     4.41   0.000     .3110525     .808822
               20494  |   .3364071   .1176534     2.86   0.004     .1058107    .5670036
               20496  |  -.0339436   .1086729    -0.31   0.755    -.2469385    .1790514
               20500  |   .2723924    .116851     2.33   0.020     .0433687     .501416
               20516  |   .3555078   .1174438     3.03   0.002     .1253223    .5856933
               20521  |   .4192853   .1206688     3.47   0.001     .1827788    .6557918
               20528  |   .5306466   .1251207     4.24   0.000     .2854146    .7758787
               20535  |   .5243502    .125911     4.16   0.000     .2775691    .7711312
               20536  |   .3393147   .1193645     2.84   0.004     .1053646    .5732649
               20542  |   .2481899   .1157158     2.14   0.032     .0213911    .4749887
               20544  |   .3322359   .1186406     2.80   0.005     .0997046    .5647672
               20550  |   .3576066   .1185886     3.02   0.003     .1251773     .590036
               20559  |   .0119097   .1091974     0.11   0.913    -.2021133    .2259328
               20562  |  -.0580508   .1082287    -0.54   0.592    -.2701751    .1540735
               20565  |   .3280559   .1175505     2.79   0.005     .0976611    .5584507
               20570  |   .5505776   .1257355     4.38   0.000     .3041406    .7970146
               20577  |   .5271732   .1251756     4.21   0.000     .2818336    .7725129
               20578  |   .3643188   .1192069     3.06   0.002     .1306775    .5979601
               20579  |   .4676087    .122812     3.81   0.000     .2269016    .7083158
               20584  |   .4912053   .1236606     3.97   0.000      .248835    .7335756
               20585  |   .4180415   .1199618     3.48   0.000     .1829206    .6531623
               20586  |   .4499983   .1221537     3.68   0.000     .2105814    .6894151
               20592  |   .5304528   .1252682     4.23   0.000     .2849317    .7759739
               20604  |    2.01294   .3620979     5.56   0.000     1.303241    2.722639
               20605  |   .0931542   .1114264     0.84   0.403    -.1252374    .3115458
               20607  |   .1970065   .1145757     1.72   0.086    -.0275577    .4215707
               20608  |  -.1813398   .1069973    -1.69   0.090    -.3910506     .028371
               20613  |   .3545631   .1192242     2.97   0.003      .120888    .5882382
               20614  |   .4839994   .1246399     3.88   0.000     .2397096    .7282891
               20618  |   .0063135   .1106445     0.06   0.954    -.2105457    .2231728
               20619  |   .5068041   .1254522     4.04   0.000     .2609224    .7526858
               20621  |   .2863282   .1185992     2.41   0.016     .0538781    .5187783
               20622  |   .0175836   .1110331     0.16   0.874    -.2000373    .2352045
               20628  |   .2769262   .1177696     2.35   0.019     .0461021    .5077504
               20629  |  -.0459841    .109949    -0.42   0.676    -.2614801    .1695119
               20632  |  -.0305495   .1097038    -0.28   0.781    -.2455649    .1844659
               20639  |          0  (empty)
               20643  |  -.0499849   .1105753    -0.45   0.651    -.2667085    .1667386
               20647  |   .5436821    .124536     4.37   0.000      .299596    .7877682
               20648  |   .3248272   .1168562     2.78   0.005     .0957932    .5538611
               20653  |   .0614465   .1097087     0.56   0.575    -.1535785    .2764715
               20656  |   .3444271   .1167622     2.95   0.003     .1155774    .5732767
               20657  |    .018677    .108867     0.17   0.864    -.1946983    .2320524
               20661  |   .6093169   .1264472     4.82   0.000      .361485    .8571488
               20664  |  -.0052697   .1076635    -0.05   0.961    -.2162863    .2057468
               20667  |  -.0055844   .1081438    -0.05   0.959    -.2175422    .2063735
               20668  |   .4939842   .1213978     4.07   0.000     .2560488    .7319196
               20670  |   .4134486   .1184511     3.49   0.000     .1812888    .6456084
               20671  |   .0268622   .1082434     0.25   0.804     -.185291    .2390153
               20675  |   .4415817   .1192657     3.70   0.000     .2078252    .6753381
               20677  |   .3653809   .1175978     3.11   0.002     .1348935    .5958683
               20678  |  -.0833118   .1068848    -0.78   0.436    -.2928022    .1261786
               20684  |   .5353776   .1247324     4.29   0.000     .2909065    .7798487
               20690  |   .1408772   .1108017     1.27   0.204    -.0762901    .3580446
               20692  |  -.1130942   .1060986    -1.07   0.286    -.3210436    .0948552
               20695  |  -.0576164   .1070413    -0.54   0.590    -.2674135    .1521808
               20697  |   .3332659   .1159323     2.87   0.004     .1060428     .560489
                      |
                _cons |   2.110857   .2906608     7.26   0.000     1.541173    2.680542
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count ii.grouped_div i.dayofweek if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -61577.132  
Iteration 2:  Log likelihood = -61509.927  
Iteration 3:  Log likelihood = -61508.945  
Iteration 4:  Log likelihood = -61508.944  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(22)   = 6098.73
                                                       Prob > chi2   =  0.0000
Log likelihood = -61508.944                            Pseudo R2     =  0.0472

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0202272   .0010886   -18.58   0.000    -.0223608   -.0180936
                      |
          grouped_div |
                 803  |  -.2307599   .0329515    -7.00   0.000    -.2953436   -.1661761
                 804  |  -.1149075   .0320636    -3.58   0.000     -.177751   -.0520639
                 805  |  -.1216765   .0382665    -3.18   0.001    -.1966774   -.0466756
                 806  |  -.1007608   .0311692    -3.23   0.001    -.1618513   -.0396704
                 807  |   -.191954   .0369353    -5.20   0.000    -.2643458   -.1195622
                 808  |  -.3557242   .0697249    -5.10   0.000    -.4923825   -.2190658
                 809  |  -.0885902   .0366756    -2.42   0.016     -.160473   -.0167074
                 810  |  -.1323708    .035201    -3.76   0.000    -.2013634   -.0633781
                 811  |  -.6226439   .0266658   -23.35   0.000    -.6749078     -.57038
                 812  |   .4498277   .0278404    16.16   0.000     .3952615    .5043939
                 814  |   .5008635   .0321505    15.58   0.000     .4378497    .5638774
                 816  |   .2499143   .0274872     9.09   0.000     .1960403    .3037882
                 818  |    .224238   .0290047     7.73   0.000     .1673899    .2810861
                 819  |   .4363303   .0316206    13.80   0.000      .374355    .4983055
                 824  |   1.008118   .0564796    17.85   0.000     .8974204    1.118816
                 828  |   .1490862    .053216     2.80   0.005     .0447849    .2533876
                 999  |  -.0662022   .0334832    -1.98   0.048    -.1318281   -.0005763
                      |
            dayofweek |
             Tuesday  |   .3389315   .0128873    26.30   0.000      .313673    .3641901
           Wednesday  |   .2018883   .0123946    16.29   0.000     .1775954    .2261812
            Thursday  |   .2605541   .0126619    20.58   0.000     .2357372    .2853711
              Friday  |  -.0788446   .0116309    -6.78   0.000    -.1016408   -.0560484
                      |
                _cons |   1.064866   .0241279    44.13   0.000     1.017577    1.112156
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count i.grouped_div i.dayofweek if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -61577.132  
Iteration 2:  Log likelihood = -61509.927  
Iteration 3:  Log likelihood = -61508.945  
Iteration 4:  Log likelihood = -61508.944  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(22)   = 6098.73
                                                       Prob > chi2   =  0.0000
Log likelihood = -61508.944                            Pseudo R2     =  0.0472

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |  -.0202272   .0010886   -18.58   0.000    -.0223608   -.0180936
                      |
          grouped_div |
                 803  |  -.2307599   .0329515    -7.00   0.000    -.2953436   -.1661761
                 804  |  -.1149075   .0320636    -3.58   0.000     -.177751   -.0520639
                 805  |  -.1216765   .0382665    -3.18   0.001    -.1966774   -.0466756
                 806  |  -.1007608   .0311692    -3.23   0.001    -.1618513   -.0396704
                 807  |   -.191954   .0369353    -5.20   0.000    -.2643458   -.1195622
                 808  |  -.3557242   .0697249    -5.10   0.000    -.4923825   -.2190658
                 809  |  -.0885902   .0366756    -2.42   0.016     -.160473   -.0167074
                 810  |  -.1323708    .035201    -3.76   0.000    -.2013634   -.0633781
                 811  |  -.6226439   .0266658   -23.35   0.000    -.6749078     -.57038
                 812  |   .4498277   .0278404    16.16   0.000     .3952615    .5043939
                 814  |   .5008635   .0321505    15.58   0.000     .4378497    .5638774
                 816  |   .2499143   .0274872     9.09   0.000     .1960403    .3037882
                 818  |    .224238   .0290047     7.73   0.000     .1673899    .2810861
                 819  |   .4363303   .0316206    13.80   0.000      .374355    .4983055
                 824  |   1.008118   .0564796    17.85   0.000     .8974204    1.118816
                 828  |   .1490862    .053216     2.80   0.005     .0447849    .2533876
                 999  |  -.0662022   .0334832    -1.98   0.048    -.1318281   -.0005763
                      |
            dayofweek |
             Tuesday  |   .3389315   .0128873    26.30   0.000      .313673    .3641901
           Wednesday  |   .2018883   .0123946    16.29   0.000     .1775954    .2261812
            Thursday  |   .2605541   .0126619    20.58   0.000     .2357372    .2853711
              Friday  |  -.0788446   .0116309    -6.78   0.000    -.1016408   -.0560484
                      |
                _cons |   1.064866   .0241279    44.13   0.000     1.017577    1.112156
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count i.dayofweek if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -63676.285  
Iteration 2:  Log likelihood = -63673.173  
Iteration 3:  Log likelihood = -63673.173  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(5)    = 1770.27
                                                       Prob > chi2   =  0.0000
Log likelihood = -63673.173                            Pseudo R2     =  0.0137

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |    .007543   .0004851    15.55   0.000     .0065922    .0084938
                      |
            dayofweek |
             Tuesday  |   .3018855   .0126085    23.94   0.000     .2771732    .3265978
           Wednesday  |   .1759593    .012155    14.48   0.000     .1521359    .1997827
            Thursday  |   .2211165   .0123871    17.85   0.000     .1968383    .2453947
              Friday  |  -.1035645   .0114208    -9.07   0.000    -.1259488   -.0811801
                      |
                _cons |   .9803513    .009657   101.52   0.000      .961424    .9992786
---------------------------------------------------------------------------------------

. probit work c.adj_div_8_leave_count  if dayofweek!=0 & dayofweek!=6

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood =  -64419.96  
Iteration 2:  Log likelihood = -64419.894  
Iteration 3:  Log likelihood = -64419.894  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(1)    =  276.83
                                                       Prob > chi2   =  0.0000
Log likelihood = -64419.894                            Pseudo R2     =  0.0021

---------------------------------------------------------------------------------------
                 work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
----------------------+----------------------------------------------------------------
adj_div_8_leave_count |   .0079947   .0004819    16.59   0.000     .0070502    .0089392
                _cons |   1.079897   .0067023   161.12   0.000     1.066761    1.093034
---------------------------------------------------------------------------------------

. lookfor seniority

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
seniority_rank  double  %10.0g                Seniority Rank

. probit work seniority_rank

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -157776.69  
Iteration 2:  Log likelihood = -157776.69  

Probit regression                                      Number of obs = 259,080
                                                       LR chi2(1)    =   55.05
                                                       Prob > chi2   =  0.0000
Log likelihood = -157776.69                            Pseudo R2     =  0.0002

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |    .000763   .0001029     7.42   0.000     .0005614    .0009647
         _cons |   .5073642   .0040394   125.60   0.000     .4994471    .5152814
--------------------------------------------------------------------------------

. probit work seniority_rank tenure

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -157752.31  
Iteration 2:  Log likelihood = -157752.31  

Probit regression                                      Number of obs = 259,080
                                                       LR chi2(2)    =  103.81
                                                       Prob > chi2   =  0.0000
Log likelihood = -157752.31                            Pseudo R2     =  0.0003

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |   .0001025   .0001399     0.73   0.464    -.0001717    .0003767
        tenure |  -.0031225   .0004473    -6.98   0.000    -.0039992   -.0022457
         _cons |   .5734434   .0103023    55.66   0.000     .5532512    .5936356
--------------------------------------------------------------------------------

. probit work seniority_rank tenure if dayofweek<6 & dayofweek>0

Iteration 0:  Log likelihood = -64558.309  
Iteration 1:  Log likelihood = -64045.378  
Iteration 2:  Log likelihood =  -64044.33  
Iteration 3:  Log likelihood =  -64044.33  

Probit regression                                      Number of obs = 175,359
                                                       LR chi2(2)    = 1027.96
                                                       Prob > chi2   =  0.0000
Log likelihood = -64044.33                             Pseudo R2     =  0.0080

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |   .0064068   .0002034    31.50   0.000     .0060081    .0068054
        tenure |   .0161789   .0006484    24.95   0.000      .014908    .0174497
         _cons |   .7490652   .0143661    52.14   0.000      .720908    .7772223
--------------------------------------------------------------------------------

. probit work seniority_rank tenure if dayofweek==6

Iteration 0:  Log likelihood = -27872.571  
Iteration 1:  Log likelihood = -27656.305  
Iteration 2:  Log likelihood = -27656.249  
Iteration 3:  Log likelihood = -27656.249  

Probit regression                                       Number of obs = 41,514
                                                        LR chi2(2)    = 432.64
                                                        Prob > chi2   = 0.0000
Log likelihood = -27656.249                             Pseudo R2     = 0.0078

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |  -.0029741   .0003371    -8.82   0.000    -.0036348   -.0023133
        tenure |  -.0213264   .0010814   -19.72   0.000    -.0234459   -.0192069
         _cons |   .1427842   .0248893     5.74   0.000      .094002    .1915665
--------------------------------------------------------------------------------

. probit work seniority_rank tenure if dayofweek==0

Iteration 0:  Log likelihood = -24463.116  
Iteration 1:  Log likelihood = -23954.892  
Iteration 2:  Log likelihood = -23954.229  
Iteration 3:  Log likelihood = -23954.229  

Probit regression                                      Number of obs =  42,207
                                                       LR chi2(2)    = 1017.77
                                                       Prob > chi2   =  0.0000
Log likelihood = -23954.229                            Pseudo R2     =  0.0208

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |  -.0113271   .0003576   -31.68   0.000     -.012028   -.0106263
        tenure |  -.0220114   .0011011   -19.99   0.000    -.0241695   -.0198533
         _cons |   .0325779    .025306     1.29   0.198    -.0170211    .0821768
--------------------------------------------------------------------------------

. probit work seniority_rank tenure i.dayofweek

Iteration 0:  Log likelihood = -157804.21  
Iteration 1:  Log likelihood = -116314.54  
Iteration 2:  Log likelihood = -116107.43  
Iteration 3:  Log likelihood = -116107.37  
Iteration 4:  Log likelihood = -116107.37  

Probit regression                                     Number of obs =  259,080
                                                      LR chi2(8)    = 83393.69
                                                      Prob > chi2   =   0.0000
Log likelihood = -116107.37                           Pseudo R2     =   0.2642

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |   .0009555   .0001572     6.08   0.000     .0006474    .0012636
        tenure |   .0009024   .0005011     1.80   0.072    -.0000797    .0018845
               |
     dayofweek |
       Monday  |   1.685091   .0104802   160.79   0.000      1.66455    1.705631
      Tuesday  |   1.993574    .011598   171.89   0.000     1.970842    2.016306
    Wednesday  |    1.86765   .0111095   168.11   0.000     1.845876    1.889425
     Thursday  |   1.915901   .0113534   168.75   0.000     1.893649    1.938154
       Friday  |   1.588987   .0102988   154.29   0.000     1.568802    1.609172
     Saturday  |   .3599685   .0090386    39.83   0.000     .3422531    .3776839
               |
         _cons |  -.6655161   .0129146   -51.53   0.000    -.6908283   -.6402039
--------------------------------------------------------------------------------

. cor seniority_rank tenure
(obs=259,080)

             | senior~k   tenure
-------------+------------------
seniority_~k |   1.0000
      tenure |  -0.6764   1.0000


. reg work seniority_rank tenure i.dayofweek

      Source |       SS           df       MS      Number of obs   =   259,080
-------------+----------------------------------   F(8, 259071)    =  15553.10
       Model |  17582.0461         8  2197.75577   Prob > F        =    0.0000
    Residual |  36608.4367   259,071  .141306579   R-squared       =    0.3244
-------------+----------------------------------   Adj R-squared   =    0.3244
       Total |  54190.4828   259,079  .209165864   Root MSE        =    .37591

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |   .0001343   .0000397     3.38   0.001     .0000565    .0002121
        tenure |  -.0001589   .0001277    -1.24   0.213    -.0004091    .0000914
               |
     dayofweek |
       Monday  |   .5892297   .0027017   218.10   0.000     .5839345    .5945249
      Tuesday  |   .6481459   .0027176   238.50   0.000     .6428195    .6534723
    Wednesday  |   .6267798   .0027177   230.63   0.000     .6214531    .6321065
     Thursday  |   .6353826   .0027314   232.62   0.000     .6300292     .640736
       Friday  |   .5662191   .0027137   208.65   0.000     .5609004    .5715378
     Saturday  |   .1297753   .0025984    49.94   0.000     .1246824    .1348681
               |
         _cons |   .2646982   .0033905    78.07   0.000     .2580529    .2713435
--------------------------------------------------------------------------------

. binscatter work seniority_rank

. binscatter work seniority_rank, by(dayofweek )
(note:  named style i not found in class symbol, default attributes used)

. binscatter work seniority_rank if dayofweek !=0 & dayofweek !=6, by(dayofweek )

. reg work seniority_rank tenure i.dayofweek i.grouped_div

      Source |       SS           df       MS      Number of obs   =   259,080
-------------+----------------------------------   F(25, 259054)   =   5050.15
       Model |  17756.5866        25  710.263465   Prob > F        =    0.0000
    Residual |  36433.8962   259,054  .140642091   R-squared       =    0.3277
-------------+----------------------------------   Adj R-squared   =    0.3276
       Total |  54190.4828   259,079  .209165864   Root MSE        =    .37502

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |  -.0000492   .0000666    -0.74   0.460    -.0001797    .0000813
        tenure |  -.0011156   .0001757    -6.35   0.000      -.00146   -.0007712
               |
     dayofweek |
       Monday  |   .5889838   .0026954   218.51   0.000     .5837009    .5942668
      Tuesday  |   .6477924   .0027113   238.92   0.000     .6424783    .6531065
    Wednesday  |   .6264537   .0027115   231.04   0.000     .6211393    .6317681
     Thursday  |   .6350119   .0027251   233.03   0.000     .6296709     .640353
       Friday  |   .5663076   .0027074   209.17   0.000     .5610012    .5716139
     Saturday  |   .1297506   .0025923    50.05   0.000     .1246697    .1348315
               |
   grouped_div |
          803  |  -.0168372   .0066301    -2.54   0.011    -.0298321   -.0038424
          804  |  -.0143853   .0062917    -2.29   0.022    -.0267168   -.0020538
          805  |  -.0025674   .0076337    -0.34   0.737    -.0175293    .0123944
          806  |  -.0317889   .0061223    -5.19   0.000    -.0437884   -.0197894
          807  |  -.0339095   .0075498    -4.49   0.000    -.0487069   -.0191122
          808  |  -.1365372   .0154116    -8.86   0.000    -.1667435   -.1063309
          809  |    .009132   .0071785     1.27   0.203    -.0049377    .0232017
          810  |  -.0203028   .0070632    -2.87   0.004    -.0341464   -.0064591
          811  |  -.1337107   .0054157   -24.69   0.000    -.1443252   -.1230961
          812  |  -.0264069   .0053943    -4.90   0.000    -.0369795   -.0158343
          814  |  -.0422869   .0053174    -7.95   0.000    -.0527089    -.031865
          816  |  -.0363886   .0051054    -7.13   0.000    -.0463951   -.0263821
          818  |  -.0252896   .0055355    -4.57   0.000    -.0361391   -.0144402
          819  |  -.0428247   .0053192    -8.05   0.000    -.0532501   -.0323993
          824  |  -.0235887   .0066408    -3.55   0.000    -.0366045   -.0105729
          828  |  -.0355987   .0094888    -3.75   0.000    -.0541965   -.0170009
          999  |  -.0502237   .0066024    -7.61   0.000    -.0631642   -.0372833
               |
         _cons |   .3224603   .0054987    58.64   0.000     .3116829    .3332376
--------------------------------------------------------------------------------

. reg work seniority_rank tenure i.dayofweek i.grouped_div & dayofweek!=0 & dayofweek!=6
& invalid name
r(198);

. reg work seniority_rank tenure i.grouped_div & dayofweek!=0 & dayofweek!=6
& invalid name
r(198);

. reg work seniority_rank tenure i.grouped_div &ifdayofweek!=0 & dayofweek!=6
& invalid name
r(198);

. reg work seniority_rank tenure i.grouped_div if dayofweek!=0 & dayofweek!=6

      Source |       SS           df       MS      Number of obs   =   175,359
-------------+----------------------------------   F(19, 175339)   =    264.40
       Model |  518.063262        19  27.2664875   Prob > F        =    0.0000
    Residual |  18081.7999   175,339  .103124804   R-squared       =    0.0279
-------------+----------------------------------   Adj R-squared   =    0.0277
       Total |  18599.8632   175,358  .106067948   Root MSE        =    .32113

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |  -.0000513   .0000694    -0.74   0.460    -.0001874    .0000848
        tenure |  -.0000366    .000184    -0.20   0.842    -.0003973    .0003241
               |
   grouped_div |
          803  |  -.0516389   .0068466    -7.54   0.000    -.0650582   -.0382196
          804  |  -.0243019   .0065198    -3.73   0.000    -.0370805   -.0115232
          805  |  -.0263549   .0079277    -3.32   0.001     -.041893   -.0108169
          806  |  -.0277917   .0063503    -4.38   0.000    -.0402382   -.0153453
          807  |  -.0429612   .0078804    -5.45   0.000    -.0584066   -.0275157
          808  |   -.078038   .0156032    -5.00   0.000    -.1086201    -.047456
          809  |  -.0189637   .0075042    -2.53   0.012    -.0336718   -.0042556
          810  |  -.0314911   .0073851    -4.26   0.000    -.0459656   -.0170165
          811  |  -.1902406   .0056103   -33.91   0.000    -.2012366   -.1792446
          812  |   .0427156   .0056301     7.59   0.000     .0316806    .0537505
          814  |   .0258148   .0055509     4.65   0.000     .0149351    .0366945
          816  |   .0131677   .0053171     2.48   0.013     .0027464    .0235891
          818  |   .0279855   .0057592     4.86   0.000     .0166976    .0392734
          819  |   .0165087   .0055595     2.97   0.003     .0056122    .0274052
          824  |   .1096794   .0068747    15.95   0.000     .0962052    .1231536
          828  |   .0319035   .0098597     3.24   0.001     .0125787    .0512283
          999  |  -.0169858   .0069111    -2.46   0.014    -.0305314   -.0034402
               |
         _cons |   .8761142   .0053938   162.43   0.000     .8655425    .8866858
--------------------------------------------------------------------------------

. reg work seniority_rank i.grouped_div if dayofweek!=0 & dayofweek!=6

      Source |       SS           df       MS      Number of obs   =   175,359
-------------+----------------------------------   F(18, 175340)   =    279.09
       Model |  518.059187        18   28.781066   Prob > F        =    0.0000
    Residual |   18081.804   175,340  .103124239   R-squared       =    0.0279
-------------+----------------------------------   Adj R-squared   =    0.0278
       Total |  18599.8632   175,358  .106067948   Root MSE        =    .32113

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |    -.00004   .0000398    -1.00   0.316    -.0001181    .0000381
               |
   grouped_div |
          803  |  -.0517111    .006837    -7.56   0.000    -.0651114   -.0383108
          804  |  -.0242788   .0065187    -3.72   0.000    -.0370553   -.0115022
          805  |   -.026565   .0078569    -3.38   0.001    -.0419644   -.0111657
          806  |  -.0277224   .0063407    -4.37   0.000      -.04015   -.0152948
          807  |  -.0433137   .0076782    -5.64   0.000    -.0583628   -.0282647
          808  |  -.0775713   .0154255    -5.03   0.000    -.1078051   -.0473376
          809  |  -.0191484   .0074465    -2.57   0.010    -.0337433   -.0045535
          810  |  -.0317996   .0072201    -4.40   0.000    -.0459508   -.0176484
          811  |  -.1902253   .0056097   -33.91   0.000    -.2012203   -.1792304
          812  |   .0422405   .0050976     8.29   0.000     .0322493    .0522316
          814  |   .0253912   .0051255     4.95   0.000     .0153454     .035437
          816  |    .012884   .0051219     2.52   0.012     .0028453    .0229228
          818  |   .0276953    .005571     4.97   0.000     .0167762    .0386143
          819  |   .0160887   .0051423     3.13   0.002     .0060099    .0261676
          824  |   .1096077   .0068652    15.97   0.000     .0961521    .1230633
          828  |   .0317715   .0098373     3.23   0.001     .0124906    .0510524
          999  |   -.017269   .0067626    -2.55   0.011    -.0305236   -.0040144
               |
         _cons |   .8755448   .0045703   191.57   0.000     .8665871    .8845024
--------------------------------------------------------------------------------

. reg work seniority_rank  if dayofweek!=0 & dayofweek!=6

      Source |       SS           df       MS      Number of obs   =   175,359
-------------+----------------------------------   F(1, 175357)    =    396.49
       Model |  41.9606009         1  41.9606009   Prob > F        =    0.0000
    Residual |  18557.9026   175,357  .105829266   R-squared       =    0.0023
-------------+----------------------------------   Adj R-squared   =    0.0023
       Total |  18599.8632   175,358  .106067948   Root MSE        =    .32531

--------------------------------------------------------------------------------
          work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------+----------------------------------------------------------------
seniority_rank |   .0006114   .0000307    19.91   0.000     .0005513    .0006716
         _cons |   .8607616   .0012158   707.97   0.000     .8583786    .8631446
--------------------------------------------------------------------------------

. reg work c.seniority_rank##c.adj_div_8_leave_count   if dayofweek!=0 & dayofweek!=6

      Source |       SS           df       MS      Number of obs   =   175,359
-------------+----------------------------------   F(3, 175355)    =    200.54
       Model |  63.5944637         3  21.1981546   Prob > F        =    0.0000
    Residual |  18536.2687   175,355  .105707101   R-squared       =    0.0034
-------------+----------------------------------   Adj R-squared   =    0.0034
       Total |  18599.8632   175,358  .106067948   Root MSE        =    .32513

----------------------------------------------------------------------------------------------------------
                                    work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------------------+----------------------------------------------------------------
                          seniority_rank |   .0012823   .0000741    17.31   0.000     .0011371    .0014276
                   adj_div_8_leave_count |   .0021501   .0001583    13.58   0.000     .0018398    .0024604
                                         |
c.seniority_rank#c.adj_div_8_leave_count |  -.0000563   4.47e-06   -12.58   0.000     -.000065   -.0000475
                                         |
                                   _cons |   .8415285   .0018159   463.41   0.000     .8379693    .8450877
----------------------------------------------------------------------------------------------------------

. reg work c.seniority_rank##c.adj_div_8_leave_count   tenureif dayofweek!=0 & dayofweek!=6
variable tenureif not found
r(111);

. reg work c.seniority_rank##c.adj_div_8_leave_count   tenure if dayofweek!=0 & dayofweek!=6

      Source |       SS           df       MS      Number of obs   =   175,359
-------------+----------------------------------   F(4, 175354)    =    294.89
       Model |  124.280807         4  31.0702018   Prob > F        =    0.0000
    Residual |  18475.5824   175,354  .105361625   R-squared       =    0.0067
-------------+----------------------------------   Adj R-squared   =    0.0067
       Total |  18599.8632   175,358  .106067948   Root MSE        =    .32459

----------------------------------------------------------------------------------------------------------
                                    work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-----------------------------------------+----------------------------------------------------------------
                          seniority_rank |   .0020128     .00008    25.16   0.000      .001856    .0021696
                   adj_div_8_leave_count |   .0007421   .0001686     4.40   0.000     .0004117    .0010726
                                         |
c.seniority_rank#c.adj_div_8_leave_count |  -.0000434   4.50e-06    -9.65   0.000    -.0000522   -.0000346
                                         |
                                  tenure |   .0034891   .0001454    24.00   0.000     .0032041     .003774
                                   _cons |   .7788459   .0031794   244.97   0.000     .7726144    .7850774
----------------------------------------------------------------------------------------------------------

. d,f

Contains data from data/01_01_estimation_sample.dta
 Observations:       259,080                  
    Variables:           124                  17 Jan 2025 11:09
-------------------------------------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------
employee_name   str12   %12s                  EMPLOYEE_NAME
job_class_title str15   %15s                  JOB_CLASS_TITLE
dept            int     %8.0g                 DEPT
yearsoldonworkdate
                double  %10.0g                Years Old on Workdate
maximum_gap_2015
                int     %10.0g                Maximum # days between raw pay obs for gaps ending after 01012015
gap_end         int     %10.0g                
max_rate        double  %10.0g                Wage
div1            double  %10.0g                
div2            int     %10.0g                
lhours_1        byte    %10.0g                
lhours_2        byte    %10.0g                
shours_1        byte    %10.0g                
shours_2        byte    %10.0g                
leave_hours     byte    %10.0g                (sum) leave_hours
tot_hours       byte    %8.0g                 (sum) tot_hours
sick_hours      byte    %10.0g                (sum) sick_hours
varstandard_hours
                byte    %10.0g                (sum) varstandard_hours
varot_hours     byte    %10.0g                (sum) varot_hours
work_pay_amount int     %10.0g                Pay from Work Pay Codes
ot_pay_amount   int     %10.0g                Pay from OT Pay Codes
iod_flag        byte    %10.0g                (firstnm) iod_flag
term_observed   byte    %10.0g                (firstnm) term_observed
flag_hours_zeroed
                byte    %10.0g                
analysis_workdate
                int     %td                   
doi             int     %td                   
timeofinj       double  %tc                   Time of Inj
natureofinjury  str29   %29s                  Nature of Injury
bodypart        str28   %28s                  Body Part
claimcause      str29   %29s                  Claim Cause
claimcausegroup str25   %25s                  Claim Cause Group
contribcause    str38   %38s                  Contrib Cause
medpd           double  %10.0g                Medical Expenses Paid
matched_injury  byte    %10.0g                Injury
not_worked      byte    %10.0g                Created to denote observations created to fill in time gaps.
cum_tot_hours   int     %10.0g                
cum_varstandard_hours
                int     %10.0g                
cum_varot_hours int     %10.0g                Cum. Sum. of all OT Hours Based on Var Desc.
original_hire_date
                double  %tc                   ORIGINAL_HIRE_DATE
job_end_date    byte    %8.0g                 JOB_END_DATE
job_status      str19   %19s                  JOB_STATUS
roll_7days_varot_hours
                int     %10.0g                Rolling sum of OT Based on var Desc
an_week         int     %tw                   
an_month        int     %10.0g                
exp_40wk        byte    %10.0g                Worked more than 40 hours this week?
m_exp_40wk      byte    %10.0g                Worked more than 40 hours in a week this month?
m_weekly_overtime_40
                int     %10.0g                Month sum of all Hours Worked Over 40 in a Week
exp_60wk        byte    %10.0g                Worked more than 60 hours this week?
m_exp_60wk      byte    %10.0g                Worked more than 60 hours in a week this month?
m_weekly_overtime_60
                int     %10.0g                Month Sum of all Hours Worked Over 60 in A Week
exp_8day        byte    %10.0g                Worked more than 8 hours in a day this week?
m_exp_8day      byte    %10.0g                Worked more than 8 hours in a day this month?
m_daily_overtime_8
                int     %10.0g                Sum of all Hours Worked Over 8 in a Day this month
r_over8day_2days
                int     %10.0g                Rolling sum of hours over 8, 2 day
r_over8day_7days
                int     %10.0g                Rolling sum of hours over 8 in a day 7 window
exp_12day       byte    %10.0g                Worked more than 12 hours in a day this week?
m_exp_12day     byte    %10.0g                Worked more than 12 hours in a day this month?
m_daily_overtime_12
                int     %10.0g                Sum of all Hours Worked Over 12 in a day this month
r_over12day_7days
                int     %10.0g                Rolling sum of hours over 12 in a day 7 window
r_over12day_2days
                byte    %10.0g                Rolling sum of hours over 12, 2 day
exp_7days       byte    %10.0g                Worked 7 days straight this week?
m_exp_7days     byte    %10.0g                Worked 7 days straight this month?
r_over40_7day   int     %10.0g                Rolling sum of hours over 40 in 7 day window
r_over40_2day   byte    %10.0g                Rolling sum of hours over 40 in 2 day window
r_over60_7day   int     %10.0g                Rolling sum of hours over 60 in 7 day window
r_over60_2day   byte    %10.0g                Rolling sum of hours over 60 in 2 day window
r_workeddays_7day
                byte    %10.0g                Rolling sum of days worked in 7 day window
r_workeddays_2day
                byte    %10.0g                Rolling sum of days worked in 2 day window
tot_hours_lag1  byte    %10.0g                
tot_hours_lag2  byte    %10.0g                
tot_hours_lag3  byte    %10.0g                
tot_hours_lag4  byte    %10.0g                
tot_hours_lag5  byte    %10.0g                
tot_hours_lag6  byte    %10.0g                
prcp            double  %10.0g                Amount Rain (in.)
tmax            int     %8.0g                 Max. Daily Temp.
tmin            byte    %8.0g                 TMIN
holiday         str35   %35s                  Holiday
is_holiday      byte    %10.0g                Holiday
rain            byte    %10.0g                RAIN
took_leave      byte    %10.0g                
main_div        int     %10.0g                DIV
flag_div_corrected
                byte    %10.0g                
div_emps        int     %10.0g                
tot_working     int     %10.0g                
tot_leave       int     %10.0g                
div_leave_count byte    %10.0g                
pct_others_indiv_leave
                double  %10.0g                Leave of Coworkers (%)
adj_div_leave_count
                byte    %10.0g                
alt_leave_nosick
                byte    %10.0g                
div_leave_8_count
                byte    %10.0g                
adj_div_leave_hours
                int     %10.0g                Leave of Coworkers (hours)
adj_div_8_leave_count
                byte    %10.0g                Coworkers on Leave
empid           long    %12.0g     empid      EMPLOYEE_NAME
year            double  %10.0g                
month           double  %10.0g                
dayofweek       double  %10.0g     weekday    
week            double  %10.0g                
grouped_div     double  %10.0g                
grouped         double  %10.0g                group(grouped_div analysis_workdate)
isweekend       double  %10.0g                
_week           double  %10.0g                
_gap            double  %10.0g                
_stint          double  %10.0g                
inj_immediately double  %10.0g                
work            double  %10.0g                Either tot_hours>0 or inj_imm==1
days_worked_since20150101
                double  %10.0g                
tot_days_worked_fullperiod
                double  %10.0g                
workflag        double  %10.0g                
stints          double  %10.0g                
stint_length    double  %10.0g                
modelength      double  %10.0g                
tenure          double  %10.0g                Tenure (years)
seniority_rank  double  %10.0g                Seniority Rank
an_age          double  %10.0g                Age
workhours_last6 double  %10.0g                
age_20150101    double  %10.0g                Age
first_inj_date  double  %10.0g                
div_before      double  %10.0g                
bar_adj_div_8_leave_count
                double  %10.0g                Avg. Coworkers on Leave
bar_max_rate    double  %10.0g                Avg. Wage
lastinj         double  %10.0g                
firstworkday    double  %10.0g                
has_datevar     double  %10.0g                
mod             double  %10.0g                
-------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: analysis_workdate  matched_injury
     Note: Dataset has changed since last saved.

. collapse (mean) work, by(analysis_workdate )

. list

     +-----------------------+
     | analysi~e        work |
     |-----------------------|
  1. | 02jan2015        .832 |
  2. | 03jan2015   .43181818 |
  3. | 04jan2015   .17391304 |
  4. | 05jan2015    .8516624 |
  5. | 06jan2015   .91687657 |
     |-----------------------|
  6. | 07jan2015   .91122715 |
  7. | 08jan2015   .88372093 |
  8. | 09jan2015   .83375959 |
  9. | 10jan2015    .3553719 |
 10. | 11jan2015   .22839506 |
     |-----------------------|
 11. | 12jan2015   .82816229 |
 12. | 13jan2015   .94059406 |
 13. | 14jan2015   .89588378 |
 14. | 15jan2015   .93120393 |
 15. | 16jan2015   .82962963 |
     |-----------------------|
 16. | 17jan2015   .33264033 |
 17. | 18jan2015   .15495868 |
 18. | 19jan2015   .99337748 |
 19. | 20jan2015   .90214797 |
 20. | 21jan2015   .85888078 |
     |-----------------------|
 21. | 22jan2015   .85995086 |
 22. | 23jan2015    .8097561 |
 23. | 24jan2015   .31355932 |
 24. | 25jan2015   .25614754 |
 25. | 26jan2015      .84375 |
     |-----------------------|
 26. | 27jan2015   .91831683 |
 27. | 28jan2015   .89408867 |
 28. | 29jan2015   .90298507 |
 29. | 30jan2015   .77777778 |
 30. | 31jan2015   .33052632 |
     |-----------------------|
 31. | 01feb2015   .18556701 |
 32. | 02feb2015   .82151589 |
 33. | 03feb2015   .92647059 |
 34. | 04feb2015   .88674699 |
 35. | 05feb2015   .91811414 |
     |-----------------------|
 36. | 06feb2015     .799511 |
 37. | 07feb2015   .31914894 |
 38. | 08feb2015   .32505176 |
 39. | 09feb2015   .83418367 |
 40. | 10feb2015    .9120603 |
     |-----------------------|
 41. | 11feb2015   .88916877 |
 42. | 12feb2015   .88946015 |
 43. | 13feb2015   .82871537 |
 44. | 14feb2015   .30379747 |
 45. | 15feb2015   .15876289 |
     |-----------------------|
 46. | 16feb2015   .99113082 |
 47. | 17feb2015   .88383838 |
 48. | 18feb2015   .85858586 |
 49. | 19feb2015   .88804071 |
 50. | 20feb2015   .84693878 |
     |-----------------------|
 51. | 21feb2015   .45492662 |
 52. | 22feb2015   .30515464 |
 53. | 23feb2015   .86111111 |
 54. | 24feb2015       .9075 |
 55. | 25feb2015   .89620253 |
     |-----------------------|
 56. | 26feb2015   .89672544 |
 57. | 27feb2015   .80788177 |
 58. | 28feb2015    .3946281 |
 59. | 01mar2015   .22633745 |
 60. | 02mar2015   .83894231 |
     |-----------------------|
 61. | 03mar2015   .91293532 |
 62. | 04mar2015   .90843373 |
 63. | 05mar2015   .90123457 |
 64. | 06mar2015   .85749386 |
 65. | 07mar2015   .33966245 |
     |-----------------------|
 66. | 08mar2015   .21161826 |
 67. | 09mar2015   .82063882 |
 68. | 10mar2015   .92982456 |
 69. | 11mar2015   .88206388 |
 70. | 12mar2015   .88888889 |
     |-----------------------|
 71. | 13mar2015   .83709273 |
 72. | 14mar2015   .36099585 |
 73. | 15mar2015   .48760331 |
 74. | 16mar2015   .86069652 |
 75. | 17mar2015   .92857143 |
     |-----------------------|
 76. | 18mar2015       .8775 |
 77. | 19mar2015    .8877551 |
 78. | 20mar2015   .84050633 |
 79. | 21mar2015   .35957447 |
 80. | 22mar2015   .35355649 |
     |-----------------------|
 81. | 23mar2015   .83289817 |
 82. | 24mar2015    .9258312 |
 83. | 25mar2015   .92227979 |
 84. | 26mar2015   .90721649 |
 85. | 27mar2015   .79427083 |
     |-----------------------|
 86. | 28mar2015   .36210526 |
 87. | 29mar2015   .23602484 |
 88. | 30mar2015   .99559471 |
 89. | 31mar2015   .86422977 |
 90. | 01apr2015   .74285714 |
     |-----------------------|
 91. | 02apr2015   .83651226 |
 92. | 03apr2015   .79466667 |
 93. | 04apr2015    .3907563 |
 94. | 05apr2015   .23799582 |
 95. | 06apr2015   .83989501 |
     |-----------------------|
 96. | 07apr2015   .88126649 |
 97. | 08apr2015     .890625 |
 98. | 09apr2015   .91494845 |
 99. | 10apr2015   .81201044 |
100. | 11apr2015   .47058824 |
     |-----------------------|
101. | 12apr2015   .23395445 |
102. | 13apr2015   .83990148 |
103. | 14apr2015   .93872549 |
104. | 15apr2015   .90617284 |
105. | 16apr2015   .90452261 |
     |-----------------------|
106. | 17apr2015   .84771574 |
107. | 18apr2015   .39914163 |
108. | 19apr2015   .30833333 |
109. | 20apr2015   .82469136 |
110. | 21apr2015   .91687042 |
     |-----------------------|
111. | 22apr2015    .9037037 |
112. | 23apr2015   .91041162 |
113. | 24apr2015   .88433735 |
114. | 25apr2015   .42372881 |
115. | 26apr2015   .30543933 |
     |-----------------------|
116. | 27apr2015   .84691358 |
117. | 28apr2015   .91463415 |
118. | 29apr2015   .89242054 |
119. | 30apr2015   .91183879 |
120. | 01may2015   .85784314 |
     |-----------------------|
121. | 02may2015   .32765957 |
122. | 03may2015   .21775899 |
123. | 04may2015   .83046683 |
124. | 05may2015   .90338164 |
125. | 06may2015     .908867 |
     |-----------------------|
126. | 07may2015   .88778055 |
127. | 08may2015   .82278481 |
128. | 09may2015   .38461538 |
129. | 10may2015   .17473684 |
130. | 11may2015   .80693069 |
     |-----------------------|
131. | 12may2015   .91139241 |
132. | 13may2015   .91240876 |
133. | 14may2015   .89054726 |
134. | 15may2015   .86479592 |
135. | 16may2015   .40042373 |
     |-----------------------|
136. | 17may2015    .4360587 |
137. | 18may2015   .87128713 |
138. | 19may2015   .91646192 |
139. | 20may2015   .89731051 |
140. | 21may2015   .90176322 |
     |-----------------------|
141. | 22may2015   .79901961 |
142. | 23may2015   .37526205 |
143. | 24may2015      .24375 |
144. | 25may2015   .99563319 |
145. | 26may2015   .87531172 |
     |-----------------------|
146. | 27may2015    .8286445 |
147. | 28may2015   .83462532 |
148. | 29may2015   .78516624 |
149. | 30may2015   .34819533 |
150. | 31may2015   .25469729 |
     |-----------------------|
151. | 01jun2015   .82673267 |
152. | 02jun2015   .92443325 |
153. | 03jun2015   .86734694 |
154. | 04jun2015   .88528678 |
155. | 05jun2015   .82222222 |
     |-----------------------|
156. | 06jun2015   .42138365 |
157. | 07jun2015     .278826 |
158. | 08jun2015   .84578313 |
159. | 09jun2015   .92364532 |
160. | 10jun2015   .90123457 |
     |-----------------------|
161. | 11jun2015   .88536585 |
162. | 12jun2015   .80487805 |
163. | 13jun2015   .35991379 |
164. | 14jun2015   .21141649 |
165. | 15jun2015   .81933842 |
     |-----------------------|
166. | 16jun2015   .91603053 |
167. | 17jun2015    .9127182 |
168. | 18jun2015   .89276808 |
169. | 19jun2015   .82914573 |
170. | 20jun2015   .41825902 |
     |-----------------------|
171. | 21jun2015   .24524313 |
172. | 22jun2015   .81612091 |
173. | 23jun2015          .9 |
174. | 24jun2015   .88688946 |
175. | 25jun2015   .91361257 |
     |-----------------------|
176. | 26jun2015   .81912145 |
177. | 27jun2015   .46551724 |
178. | 28jun2015   .23578947 |
179. | 29jun2015   .86075949 |
180. | 30jun2015   .91831683 |
     |-----------------------|
181. | 01jul2015   .92443325 |
182. | 02jul2015   .85897436 |
183. | 03jul2015   .99363057 |
184. | 04jul2015    .5010395 |
185. | 05jul2015   .21325052 |
     |-----------------------|
186. | 06jul2015        .825 |
187. | 07jul2015   .92947103 |
188. | 08jul2015       .8825 |
189. | 09jul2015   .92269327 |
190. | 10jul2015       .8525 |
     |-----------------------|
191. | 11jul2015   .41649049 |
192. | 12jul2015   .23908524 |
193. | 13jul2015   .84405941 |
194. | 14jul2015   .91293532 |
195. | 15jul2015   .88220551 |
     |-----------------------|
196. | 16jul2015   .90561224 |
197. | 17jul2015   .81748072 |
198. | 18jul2015   .33402923 |
199. | 19jul2015    .1884058 |
200. | 20jul2015   .81653747 |
     |-----------------------|
201. | 21jul2015   .91326531 |
202. | 22jul2015   .89113924 |
203. | 23jul2015    .9140625 |
204. | 24jul2015   .83769634 |
205. | 25jul2015   .45894737 |
     |-----------------------|
206. | 26jul2015          .2 |
207. | 27jul2015   .81933842 |
208. | 28jul2015   .91139241 |
209. | 29jul2015   .89203085 |
210. | 30jul2015   .92167102 |
     |-----------------------|
211. | 31jul2015    .8556701 |
212. | 01aug2015   .38541667 |
213. | 02aug2015   .29875519 |
214. | 03aug2015   .82908163 |
215. | 04aug2015   .93782383 |
     |-----------------------|
216. | 05aug2015   .90101523 |
217. | 06aug2015   .90837696 |
218. | 07aug2015   .82989691 |
219. | 08aug2015   .37605042 |
220. | 09aug2015   .30434783 |
     |-----------------------|
221. | 10aug2015       .8425 |
222. | 11aug2015    .9164557 |
223. | 12aug2015   .88148148 |
224. | 13aug2015    .9009901 |
225. | 14aug2015   .84303797 |
     |-----------------------|
226. | 15aug2015   .42071882 |
227. | 16aug2015   .26458333 |
228. | 17aug2015       .8025 |
229. | 18aug2015   .91708543 |
230. | 19aug2015   .91133005 |
     |-----------------------|
231. | 20aug2015    .9040404 |
232. | 21aug2015   .81185567 |
233. | 22aug2015   .39368421 |
234. | 23aug2015   .23012552 |
235. | 24aug2015    .8504902 |
     |-----------------------|
236. | 25aug2015   .93580247 |
237. | 26aug2015   .91871921 |
238. | 27aug2015   .90997567 |
239. | 28aug2015   .83009709 |
240. | 29aug2015   .40336134 |
     |-----------------------|
241. | 30aug2015   .23443983 |
242. | 31aug2015   .84855769 |
243. | 01sep2015   .91584158 |
244. | 02sep2015   .90841584 |
245. | 03sep2015       .9025 |
     |-----------------------|
246. | 04sep2015    .8345679 |
247. | 05sep2015   .46638655 |
248. | 06sep2015   .27196653 |
249. | 07sep2015   .99353448 |
250. | 08sep2015   .89303483 |
     |-----------------------|
251. | 09sep2015   .86618005 |
252. | 10sep2015   .88118812 |
253. | 11sep2015   .81424936 |
254. | 12sep2015   .43459916 |
255. | 13sep2015          .3 |
     |-----------------------|
256. | 14sep2015   .82808717 |
257. | 15sep2015   .90792839 |
258. | 16sep2015   .92009685 |
259. | 17sep2015   .91666667 |
260. | 18sep2015   .84352078 |
     |-----------------------|
261. | 19sep2015   .46736842 |
262. | 20sep2015    .3312369 |
263. | 21sep2015   .81265823 |
264. | 22sep2015   .92230576 |
265. | 23sep2015    .8960396 |
     |-----------------------|
266. | 24sep2015   .89672544 |
267. | 25sep2015   .83709273 |
268. | 26sep2015   .38115632 |
269. | 27sep2015      .26875 |
270. | 28sep2015   .83129584 |
     |-----------------------|
271. | 29sep2015   .92982456 |
272. | 30sep2015   .88106796 |
273. | 01oct2015   .91089109 |
274. | 02oct2015   .85503686 |
275. | 03oct2015   .49784483 |
     |-----------------------|
276. | 04oct2015   .26890756 |
277. | 05oct2015   .84029484 |
278. | 06oct2015   .94146341 |
279. | 07oct2015    .9308642 |
280. | 08oct2015   .92874693 |
     |-----------------------|
281. | 09oct2015   .82758621 |
282. | 10oct2015   .42161017 |
283. | 11oct2015   .28242678 |
284. | 12oct2015   .99559471 |
285. | 13oct2015   .88377724 |
     |-----------------------|
286. | 14oct2015   .84745763 |
287. | 15oct2015    .8997555 |
288. | 16oct2015   .80487805 |
289. | 17oct2015    .4787234 |
290. | 18oct2015   .37759336 |
     |-----------------------|
291. | 19oct2015   .83698297 |
292. | 20oct2015    .9368932 |
293. | 21oct2015   .90394089 |
294. | 22oct2015   .91044776 |
295. | 23oct2015   .83333333 |
     |-----------------------|
296. | 24oct2015   .45531915 |
297. | 25oct2015   .36590437 |
298. | 26oct2015   .80382775 |
299. | 27oct2015   .92944039 |
300. | 28oct2015   .92647059 |
     |-----------------------|
301. | 29oct2015   .92555831 |
302. | 30oct2015   .80997625 |
303. | 31oct2015   .43010753 |
304. | 01nov2015   .23578947 |
305. | 02nov2015   .83054893 |
     |-----------------------|
306. | 03nov2015   .92180095 |
307. | 04nov2015   .89647059 |
308. | 05nov2015   .89929742 |
309. | 06nov2015   .83371298 |
310. | 07nov2015   .48016701 |
     |-----------------------|
311. | 08nov2015   .27160494 |
312. | 09nov2015   .82033097 |
313. | 10nov2015   .90407674 |
314. | 11nov2015   .99784483 |
315. | 12nov2015   .86714976 |
     |-----------------------|
316. | 13nov2015   .79713604 |
317. | 14nov2015   .45511482 |
318. | 15nov2015   .20164609 |
319. | 16nov2015   .82587065 |
320. | 17nov2015    .9047619 |
     |-----------------------|
321. | 18nov2015          .9 |
322. | 19nov2015   .92288557 |
323. | 20nov2015   .81840796 |
324. | 21nov2015   .38947368 |
325. | 22nov2015   .20987654 |
     |-----------------------|
326. | 23nov2015   .75429975 |
327. | 24nov2015   .82070707 |
328. | 25nov2015       .7425 |
329. | 26nov2015   .99570815 |
330. | 27nov2015    .9957265 |
     |-----------------------|
331. | 28nov2015   .39148936 |
332. | 29nov2015   .37006237 |
333. | 30nov2015   .80306905 |
334. | 01dec2015   .89405685 |
335. | 02dec2015   .85974026 |
     |-----------------------|
336. | 03dec2015   .87172775 |
337. | 04dec2015   .77329975 |
338. | 05dec2015   .41806723 |
339. | 06dec2015   .32016632 |
340. | 07dec2015   .79695431 |
     |-----------------------|
341. | 08dec2015   .90656566 |
342. | 09dec2015    .8680203 |
343. | 10dec2015   .87338501 |
344. | 11dec2015   .80357143 |
345. | 12dec2015   .44186047 |
     |-----------------------|
346. | 13dec2015    .3436853 |
347. | 14dec2015   .81662592 |
348. | 15dec2015   .89896373 |
349. | 16dec2015   .88029925 |
350. | 17dec2015   .88717949 |
     |-----------------------|
351. | 18dec2015   .83291139 |
352. | 19dec2015   .35622318 |
353. | 20dec2015   .31666667 |
354. | 21dec2015   .83458647 |
355. | 22dec2015   .85459184 |
     |-----------------------|
356. | 23dec2015   .88421053 |
357. | 24dec2015   .78085642 |
358. | 25dec2015   .99563319 |
359. | 26dec2015   .35355649 |
360. | 27dec2015   .20867769 |
     |-----------------------|
361. | 28dec2015   .84097035 |
362. | 29dec2015   .88858696 |
363. | 30dec2015   .85488127 |
364. | 31dec2015   .81794195 |
365. | 01jan2016   .99779249 |
     |-----------------------|
366. | 02jan2016   .32704403 |
367. | 03jan2016   .21991701 |
368. | 04jan2016   .81958763 |
369. | 05jan2016   .93297587 |
370. | 06jan2016   .88409704 |
     |-----------------------|
371. | 07jan2016   .90745501 |
372. | 08jan2016   .84455959 |
373. | 09jan2016   .38347458 |
374. | 10jan2016   .24688797 |
375. | 11jan2016   .82324455 |
     |-----------------------|
376. | 12jan2016   .94188862 |
377. | 13jan2016   .91148325 |
378. | 14jan2016   .91148325 |
379. | 15jan2016   .83610451 |
380. | 16jan2016   .36764706 |
     |-----------------------|
381. | 17jan2016   .21020408 |
382. | 18jan2016    .9957265 |
383. | 19jan2016    .8902148 |
384. | 20jan2016   .86396181 |
385. | 21jan2016    .8708134 |
     |-----------------------|
386. | 22jan2016   .79713604 |
387. | 23jan2016   .37966805 |
388. | 24jan2016   .29303279 |
389. | 25jan2016   .85348837 |
390. | 26jan2016   .92396313 |
     |-----------------------|
391. | 27jan2016   .91549296 |
392. | 28jan2016   .91826923 |
393. | 29jan2016   .81710214 |
394. | 30jan2016   .38923395 |
395. | 31jan2016   .20082816 |
     |-----------------------|
396. | 01feb2016   .83253589 |
397. | 02feb2016   .93794749 |
398. | 03feb2016   .90669856 |
399. | 04feb2016   .91885442 |
400. | 05feb2016   .81009615 |
     |-----------------------|
401. | 06feb2016   .37995825 |
402. | 07feb2016          .2 |
403. | 08feb2016   .82338308 |
404. | 09feb2016   .93516209 |
405. | 10feb2016   .90441176 |
     |-----------------------|
406. | 11feb2016   .92462312 |
407. | 12feb2016   .82566586 |
408. | 13feb2016   .45867769 |
409. | 14feb2016   .45379877 |
410. | 15feb2016   .99785408 |
     |-----------------------|
411. | 16feb2016   .89030612 |
412. | 17feb2016   .87593052 |
413. | 18feb2016    .8877551 |
414. | 19feb2016   .82222222 |
415. | 20feb2016   .38477801 |
     |-----------------------|
416. | 21feb2016   .22680412 |
417. | 22feb2016   .82891566 |
418. | 23feb2016   .92180095 |
419. | 24feb2016   .91608392 |
420. | 25feb2016   .93160377 |
     |-----------------------|
421. | 26feb2016   .82269504 |
422. | 27feb2016    .3836478 |
423. | 28feb2016   .29774127 |
424. | 29feb2016   .85280374 |
425. | 01mar2016   .94675926 |
     |-----------------------|
426. | 02mar2016    .9020979 |
427. | 03mar2016   .90823529 |
428. | 04mar2016   .83764706 |
429. | 05mar2016   .35343035 |
430. | 06mar2016   .35378323 |
     |-----------------------|
431. | 07mar2016   .84615385 |
432. | 08mar2016   .91727494 |
433. | 09mar2016   .91062802 |
434. | 10mar2016   .92628993 |
435. | 11mar2016   .81145585 |
     |-----------------------|
436. | 12mar2016   .40966387 |
437. | 13mar2016   .21149897 |
438. | 14mar2016   .85574572 |
439. | 15mar2016   .93203883 |
440. | 16mar2016   .89130435 |
     |-----------------------|
441. | 17mar2016   .91729323 |
442. | 18mar2016   .80882353 |
443. | 19mar2016   .33679834 |
444. | 20mar2016   .21030928 |
445. | 21mar2016   .80890052 |
     |-----------------------|
446. | 22mar2016   .92838875 |
447. | 23mar2016   .90339426 |
448. | 24mar2016   .92612137 |
449. | 25mar2016   .84455959 |
450. | 26mar2016   .35368421 |
     |-----------------------|
451. | 27mar2016      .24375 |
452. | 28mar2016           1 |
453. | 29mar2016   .88295165 |
454. | 30mar2016   .85384615 |
455. | 31mar2016    .9015544 |
     |-----------------------|
456. | 01apr2016   .79319372 |
457. | 02apr2016   .37787056 |
458. | 03apr2016   .20816327 |
459. | 04apr2016   .85060241 |
460. | 05apr2016   .92289157 |
     |-----------------------|
461. | 06apr2016   .90821256 |
462. | 07apr2016         .93 |
463. | 08apr2016   .80604534 |
464. | 09apr2016   .41561181 |
465. | 10apr2016       .2625 |
     |-----------------------|
466. | 11apr2016    .8190709 |
467. | 12apr2016   .92718447 |
468. | 13apr2016   .92362768 |
469. | 14apr2016   .94902913 |
470. | 15apr2016   .83610451 |
     |-----------------------|
471. | 16apr2016   .39957717 |
472. | 17apr2016   .29399586 |
473. | 18apr2016   .81884058 |
474. | 19apr2016   .94390244 |
475. | 20apr2016   .92142857 |
     |-----------------------|
476. | 21apr2016   .90120482 |
477. | 22apr2016   .83293556 |
478. | 23apr2016   .34171908 |
479. | 24apr2016   .28131417 |
480. | 25apr2016   .83653846 |
     |-----------------------|
481. | 26apr2016   .93333333 |
482. | 27apr2016   .91219512 |
483. | 28apr2016   .90640394 |
484. | 29apr2016   .82733813 |
485. | 30apr2016   .42468619 |
     |-----------------------|
486. | 01may2016   .34086242 |
487. | 02may2016   .83252427 |
488. | 03may2016   .93028846 |
489. | 04may2016   .90818859 |
490. | 05may2016   .92156863 |
     |-----------------------|
491. | 06may2016   .81862745 |
492. | 07may2016   .36247335 |
493. | 08may2016   .18219462 |
494. | 09may2016   .85336538 |
495. | 10may2016    .9270073 |
     |-----------------------|
496. | 11may2016   .91489362 |
497. | 12may2016   .91891892 |
498. | 13may2016   .85995086 |
499. | 14may2016   .37341772 |
500. | 15may2016   .29227557 |
     |-----------------------|
501. | 16may2016   .87438424 |
502. | 17may2016   .92118227 |
503. | 18may2016   .93137255 |
504. | 19may2016   .90074442 |
505. | 20may2016   .83414634 |
     |-----------------------|
506. | 21may2016   .46218487 |
507. | 22may2016   .25258799 |
508. | 23may2016   .87591241 |
509. | 24may2016   .91542289 |
510. | 25may2016   .90220049 |
     |-----------------------|
511. | 26may2016   .92676768 |
512. | 27may2016   .80661578 |
513. | 28may2016   .35774059 |
514. | 29may2016   .19877049 |
515. | 30may2016   .99780702 |
     |-----------------------|
516. | 31may2016   .85432099 |
517. | 01jun2016   .86923077 |
518. | 02jun2016   .87886598 |
519. | 03jun2016   .78461538 |
520. | 04jun2016   .41473684 |
     |-----------------------|
521. | 05jun2016   .26446281 |
522. | 06jun2016         .84 |
523. | 07jun2016   .91968912 |
524. | 08jun2016   .90488432 |
525. | 09jun2016   .92650919 |
     |-----------------------|
526. | 10jun2016   .83507853 |
527. | 11jun2016   .39957717 |
528. | 12jun2016   .24793388 |
529. | 13jun2016   .83068783 |
530. | 14jun2016   .92408377 |
     |-----------------------|
531. | 15jun2016   .88948787 |
532. | 16jun2016   .89100817 |
533. | 17jun2016   .83554377 |
534. | 18jun2016   .38297872 |
535. | 19jun2016   .24329897 |
     |-----------------------|
536. | 20jun2016   .84155844 |
537. | 21jun2016   .95039164 |
538. | 22jun2016   .88802083 |
539. | 23jun2016   .88918206 |
540. | 24jun2016   .82085561 |
     |-----------------------|
541. | 25jun2016   .44776119 |
542. | 26jun2016   .31589958 |
543. | 27jun2016   .82428941 |
544. | 28jun2016   .94195251 |
545. | 29jun2016         .92 |
     |-----------------------|
546. | 30jun2016    .9204244 |
547. | 01jul2016   .78740157 |
548. | 02jul2016   .34439834 |
549. | 03jul2016    .2345679 |
550. | 04jul2016           1 |
     |-----------------------|
551. | 05jul2016   .84182306 |
552. | 06jul2016   .86772487 |
553. | 07jul2016    .8746594 |
554. | 08jul2016   .81693989 |
555. | 09jul2016   .38428875 |
     |-----------------------|
556. | 10jul2016    .3100616 |
557. | 11jul2016   .85051546 |
558. | 12jul2016   .92821782 |
559. | 13jul2016   .89698492 |
560. | 14jul2016   .91939547 |
     |-----------------------|
561. | 15jul2016   .82598039 |
562. | 16jul2016   .37426901 |
563. | 17jul2016   .23473282 |
564. | 18jul2016   .83870968 |
565. | 19jul2016   .91457286 |
     |-----------------------|
566. | 20jul2016   .88807786 |
567. | 21jul2016    .9009901 |
568. | 22jul2016   .83084577 |
569. | 23jul2016   .35672515 |
570. | 24jul2016   .28927203 |
     |-----------------------|
571. | 25jul2016   .83091787 |
572. | 26jul2016    .9352518 |
573. | 27jul2016   .90048544 |
574. | 28jul2016   .90220049 |
575. | 29jul2016   .82494005 |
     |-----------------------|
576. | 30jul2016   .37621832 |
577. | 31jul2016   .27884615 |
578. | 01aug2016   .82524272 |
579. | 02aug2016   .91981132 |
580. | 03aug2016    .9028436 |
     |-----------------------|
581. | 04aug2016   .90952381 |
582. | 05aug2016   .83254717 |
583. | 06aug2016   .44335938 |
584. | 07aug2016   .32046332 |
585. | 08aug2016    .8441247 |
     |-----------------------|
586. | 09aug2016   .91469194 |
587. | 10aug2016   .89613527 |
588. | 11aug2016   .90464548 |
589. | 12aug2016   .80731707 |
590. | 13aug2016   .43280632 |
     |-----------------------|
591. | 14aug2016   .35589942 |
592. | 15aug2016   .81598063 |
593. | 16aug2016   .91727494 |
594. | 17aug2016   .89047619 |
595. | 18aug2016   .92909535 |
     |-----------------------|
596. | 19aug2016   .82151589 |
597. | 20aug2016   .42156863 |
598. | 21aug2016   .28378378 |
599. | 22aug2016         .84 |
600. | 23aug2016   .92289157 |
     |-----------------------|
601. | 24aug2016   .86428571 |
602. | 25aug2016   .91198044 |
603. | 26aug2016   .80188679 |
604. | 27aug2016   .41050584 |
605. | 28aug2016   .29479769 |
     |-----------------------|
606. | 29aug2016   .81534772 |
607. | 30aug2016   .92548077 |
608. | 31aug2016   .90047393 |
     +-----------------------+

. gen dayofweek = dow(analysis_workdate )

. list if dayofweek==1

     +----------------------------------+
     | analysi~e        work   dayofw~k |
     |----------------------------------|
  4. | 05jan2015    .8516624          1 |
 11. | 12jan2015   .82816229          1 |
 18. | 19jan2015   .99337748          1 |
 25. | 26jan2015      .84375          1 |
 32. | 02feb2015   .82151589          1 |
     |----------------------------------|
 39. | 09feb2015   .83418367          1 |
 46. | 16feb2015   .99113082          1 |
 53. | 23feb2015   .86111111          1 |
 60. | 02mar2015   .83894231          1 |
 67. | 09mar2015   .82063882          1 |
     |----------------------------------|
 74. | 16mar2015   .86069652          1 |
 81. | 23mar2015   .83289817          1 |
 88. | 30mar2015   .99559471          1 |
 95. | 06apr2015   .83989501          1 |
102. | 13apr2015   .83990148          1 |
     |----------------------------------|
109. | 20apr2015   .82469136          1 |
116. | 27apr2015   .84691358          1 |
123. | 04may2015   .83046683          1 |
130. | 11may2015   .80693069          1 |
137. | 18may2015   .87128713          1 |
     |----------------------------------|
144. | 25may2015   .99563319          1 |
151. | 01jun2015   .82673267          1 |
158. | 08jun2015   .84578313          1 |
165. | 15jun2015   .81933842          1 |
172. | 22jun2015   .81612091          1 |
     |----------------------------------|
179. | 29jun2015   .86075949          1 |
186. | 06jul2015        .825          1 |
193. | 13jul2015   .84405941          1 |
200. | 20jul2015   .81653747          1 |
207. | 27jul2015   .81933842          1 |
     |----------------------------------|
214. | 03aug2015   .82908163          1 |
221. | 10aug2015       .8425          1 |
228. | 17aug2015       .8025          1 |
235. | 24aug2015    .8504902          1 |
242. | 31aug2015   .84855769          1 |
     |----------------------------------|
249. | 07sep2015   .99353448          1 |
256. | 14sep2015   .82808717          1 |
263. | 21sep2015   .81265823          1 |
270. | 28sep2015   .83129584          1 |
277. | 05oct2015   .84029484          1 |
     |----------------------------------|
284. | 12oct2015   .99559471          1 |
291. | 19oct2015   .83698297          1 |
298. | 26oct2015   .80382775          1 |
305. | 02nov2015   .83054893          1 |
312. | 09nov2015   .82033097          1 |
     |----------------------------------|
319. | 16nov2015   .82587065          1 |
326. | 23nov2015   .75429975          1 |
333. | 30nov2015   .80306905          1 |
340. | 07dec2015   .79695431          1 |
347. | 14dec2015   .81662592          1 |
     |----------------------------------|
354. | 21dec2015   .83458647          1 |
361. | 28dec2015   .84097035          1 |
368. | 04jan2016   .81958763          1 |
375. | 11jan2016   .82324455          1 |
382. | 18jan2016    .9957265          1 |
     |----------------------------------|
389. | 25jan2016   .85348837          1 |
396. | 01feb2016   .83253589          1 |
403. | 08feb2016   .82338308          1 |
410. | 15feb2016   .99785408          1 |
417. | 22feb2016   .82891566          1 |
     |----------------------------------|
424. | 29feb2016   .85280374          1 |
431. | 07mar2016   .84615385          1 |
438. | 14mar2016   .85574572          1 |
445. | 21mar2016   .80890052          1 |
452. | 28mar2016           1          1 |
     |----------------------------------|
459. | 04apr2016   .85060241          1 |
466. | 11apr2016    .8190709          1 |
473. | 18apr2016   .81884058          1 |
480. | 25apr2016   .83653846          1 |
487. | 02may2016   .83252427          1 |
     |----------------------------------|
494. | 09may2016   .85336538          1 |
501. | 16may2016   .87438424          1 |
508. | 23may2016   .87591241          1 |
515. | 30may2016   .99780702          1 |
522. | 06jun2016         .84          1 |
     |----------------------------------|
529. | 13jun2016   .83068783          1 |
536. | 20jun2016   .84155844          1 |
543. | 27jun2016   .82428941          1 |
550. | 04jul2016           1          1 |
557. | 11jul2016   .85051546          1 |
     |----------------------------------|
564. | 18jul2016   .83870968          1 |
571. | 25jul2016   .83091787          1 |
578. | 01aug2016   .82524272          1 |
585. | 08aug2016    .8441247          1 |
592. | 15aug2016   .81598063          1 |
     |----------------------------------|
599. | 22aug2016         .84          1 |
606. | 29aug2016   .81534772          1 |
     +----------------------------------+

. summary work if dayofweek==2
command summary is unrecognized
r(199);

. summwork if dayofweek==2
command summwork is unrecognized
r(199);

. summ work if dayofweek==2

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        work |         87    .9143892    .0233982   .8207071   .9503916

. summ work if dayofweek==1

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        work |         87    .8532928    .0574634   .7542998          1

. summ work if dayofweek==3

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        work |         87    .8922101    .0326764      .7425   .9978448

