-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /proj/kohlhepplab/projects/selection_injury/analysis_instrument/log/01_07_heckprob.log
  log type:  text
 opened on:  14 Jan 2025, 16:32:24

. set more off

. set scheme cleanplots

. 
. 
. use data/01_01_estimation_sample, clear

. keep if has_datevar==1
(178,857 observations deleted)

. cap eststo clear

. estimates use out/01_02_heckprob_results.ster

. estimates esample: if sample_marked

. 
. estimates store est1

. 
. *** save table of estimates

. estadd scalar atanrho = [/athrho]

added scalar:
            e(atanrho) =  -.82328783

. estadd scalar atanrho_se = _se[/athrho]

added scalar:
         e(atanrho_se) =  .3144599

. estadd scalar disprho = tanh([/athrho])

added scalar:
            e(disprho) =  -.67685541

. unique employee_name
Number of unique values of employee_name is  550
Number of records is  80223

. local emp = r(unique)

. estadd local ci_rho = "("+strofreal(tanh([/athrho]+_se[/athrho]*invttail(`emp', 0.025)), "%11.2f")+ ", " + 
> strofreal(tanh([/athrho]-_se[/athrho]*invttail(`emp', 0.025)), "%11.3f") +")"

added macro:
             e(ci_rho) : "(-0.20, -0.894)"

. esttab est1  using out/1_07_heckprob.tex, unstack star(* 0.10 ** 0.05 *** 0.01) se replace nomtitle keep(ba
> r_* adj_div_8_leave_count seniority_rank max_rate) scalar("disprho Rho" "ci_rho Rho 95\% CI") label eqlabel
> s("Injury" "Work")  nonumbers
(file out/1_07_heckprob.tex not found)
(output written to out/1_07_heckprob.tex)

. 
. *** graph of propensities.

. estimates restore est1
(results est1 are active now)

. predict psel, psel

. twoway (histogram psel  if work==0,lcolor(gs12) fcolor(gs12) bin(30) frequency ) (histogram psel  if work==
> 1,fcolor(none) lcolor(red) bin(30) frequency)   ,xtitle("Propensity Score")  legend(order(1 "Not Work" 2 "W
> ork" ))

. graph export out/01_07_propscore_hist.pdf,replace
file out/01_07_propscore_hist.pdf saved as PDF format

. 
. twoway  (histogram psel  if dayofweek==6 | dayofweek==0 & work==0,lcolor(gs12) fcolor(gs12) bin(30) frequen
> cy ) (histogram psel  if dayofweek==6 | dayofweek==0 & work==1,fcolor(none) lcolor(red) bin(30) frequency) 
>  ,xtitle("Propensity Score")  legend(order(1 "Not Work" 2 "Work" ))

. graph export out/01_07_weekend_propscore_hist.pdf,replace
file out/01_07_weekend_propscore_hist.pdf saved as PDF format

. 
. twoway  (histogram psel  if dayofweek<5 & dayofweek>0 & work==0,lcolor(gs12) fcolor(gs12) bin(15) frequency
>  ) (histogram psel  if dayofweek<5 & dayofweek>0 & work==1,fcolor(none) lcolor(red) bin(30) frequency) ,xti
> tle("Propensity Score")  legend(order(1 "Not Work" 2 "Work" ))

. graph export out/01_07_mon_thurs_propscore_hist.pdf,replace
file out/01_07_mon_thurs_propscore_hist.pdf saved as PDF format

. 
. 
. reg adj_div_8_leave_count i.analysis_workdate i.grouped_div  an_age max_rate i.empid
note: 726.empid omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =    80,223
-------------+----------------------------------   F(762, 79460)   =    557.84
       Model |  4824412.79       762  6331.25038   Prob > F        =    0.0000
    Residual |  901831.974    79,460  11.3495089   R-squared       =    0.8425
-------------+----------------------------------   Adj R-squared   =    0.8410
       Total |  5726244.76    80,222  71.3799801   Root MSE        =    3.3689

-----------------------------------------------------------------------------------
adj_div_8_leave~t | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
analysis_workdate |
           20094  |  -2.210178    .242748    -9.10   0.000    -2.685963   -1.734393
           20095  |  -.5384989   .2449018    -2.20   0.028    -1.018505   -.0584928
           20097  |  -.8865345   .2436832    -3.64   0.000    -1.364152   -.4089169
           20098  |   -14.9201   .2320828   -64.29   0.000    -15.37499   -14.46522
           20100  |  -4.505498   .2396684   -18.80   0.000    -4.975247   -4.035749
           20102  |   -3.95583   .2404952   -16.45   0.000    -4.427199   -3.484461
           20104  |  -2.811346   .2416406   -11.63   0.000     -3.28496   -2.337732
           20105  |  -15.02839   .2324361   -64.66   0.000    -15.48396   -14.57281
           20110  |  -2.734085   .2413773   -11.33   0.000    -3.207183   -2.260987
           20114  |  -3.354003   .2401595   -13.97   0.000    -3.824714   -2.883292
           20117  |  -2.995704   .2421455   -12.37   0.000    -3.470308     -2.5211
           20124  |   -2.67461   .2420692   -11.05   0.000    -3.149064   -2.200156
           20125  |  -3.224601   .2412467   -13.37   0.000    -3.697443   -2.751759
           20127  |  -15.41024   .2323292   -66.33   0.000     -15.8656   -14.95487
           20131  |  -.5153462   .2443122    -2.11   0.035    -.9941965   -.0364958
           20136  |  -2.135396   .2432821    -8.78   0.000    -2.612227   -1.658564
           20137  |  -1.998576   .2432975    -8.21   0.000    -2.475437   -1.521714
           20138  |  -2.233036    .243775    -9.16   0.000    -2.710833   -1.755238
           20139  |  -1.656332   .2439554    -6.79   0.000    -2.134483   -1.178181
           20141  |  -15.54575   .2323871   -66.90   0.000    -16.00122   -15.09027
           20145  |  -1.986099   .2433955    -8.16   0.000    -2.463152   -1.509045
           20151  |  -4.693486   .2409237   -19.48   0.000    -5.165695   -4.221277
           20152  |  -3.040969    .242354   -12.55   0.000    -3.515981   -2.565957
           20163  |  -2.531227   .2430594   -10.41   0.000    -3.007622   -2.054832
           20164  |  -2.776147   .2424992   -11.45   0.000    -3.251444    -2.30085
           20166  |  -2.222978   .2446111    -9.09   0.000    -2.702414   -1.743542
           20167  |  -1.804194   .2441854    -7.39   0.000    -2.282796   -1.325592
           20170  |  -.1492733   .2460783    -0.61   0.544    -.6315852    .3330387
           20172  |  -1.217275   .2456747    -4.95   0.000    -1.698796   -.7357542
           20173  |  -1.116329   .2453808    -4.55   0.000    -1.597274   -.6353841
           20180  |   .2850381   .2489862     1.14   0.252    -.2029733    .7730496
           20184  |   .0767843   .2467628     0.31   0.756    -.4068693    .5604379
           20185  |  -.2641184   .2471365    -1.07   0.285    -.7485044    .2202677
           20186  |   -1.29269   .2463693    -5.25   0.000    -1.775572   -.8098075
           20191  |  -3.128156   .2432498   -12.86   0.000    -3.604924   -2.651387
           20192  |  -3.036647   .2430467   -12.49   0.000    -3.513017   -2.560277
           20194  |  -3.446624    .244538   -14.09   0.000    -3.925917   -2.967331
           20200  |  -3.641894   .2437482   -14.94   0.000    -4.119639    -3.16415
           20203  |  -14.22847   .2355121   -60.42   0.000    -14.69007   -13.76687
           20207  |  -4.307752   .2433876   -17.70   0.000     -4.78479   -3.830714
           20209  |  -3.961234   .2435983   -16.26   0.000    -4.438685   -3.483782
           20215  |  -3.874533   .2448572   -15.82   0.000    -4.354452   -3.394614
           20222  |  -4.418818   .2449715   -18.04   0.000    -4.898961   -3.938676
           20223  |  -2.816709   .2464964   -11.43   0.000    -3.299841   -2.333578
           20234  |  -5.217721   .2456932   -21.24   0.000    -5.699278   -4.736164
           20235  |  -4.376113   .2472075   -17.70   0.000    -4.860639   -3.891588
           20236  |  -3.548679   .2478839   -14.32   0.000     -4.03453   -3.062828
           20240  |  -4.890872   .2455685   -19.92   0.000    -5.372185   -4.409559
           20242  |  -3.737415   .2473919   -15.11   0.000    -4.222302   -3.252529
           20247  |  -5.923242   .2442758   -24.25   0.000    -6.402021   -5.444463
           20248  |  -5.092994   .2456449   -20.73   0.000    -5.574456   -4.611531
           20254  |  -2.816539   .2479122   -11.36   0.000    -3.302446   -2.330633
           20255  |  -2.303261   .2479602    -9.29   0.000    -2.789261   -1.817261
           20257  |  -3.675771   .2468747   -14.89   0.000    -4.159643   -3.191898
           20258  |  -3.458465    .247398   -13.98   0.000    -3.943364   -2.973567
           20262  |  -2.705286   .2487293   -10.88   0.000    -3.192794   -2.217778
           20263  |  -3.528547    .248894   -14.18   0.000    -4.016378   -3.040716
           20268  |   -3.58168   .2483029   -14.42   0.000    -4.068352   -3.095007
           20269  |  -3.454857   .2470403   -13.98   0.000    -3.939055    -2.97066
           20275  |  -2.624599   .2478955   -10.59   0.000    -3.110472   -2.138725
           20276  |  -2.960862   .2482838   -11.93   0.000    -3.447497   -2.474228
           20277  |  -2.976196     .24802   -12.00   0.000    -3.462314   -2.490078
           20278  |  -3.228667   .2479067   -13.02   0.000    -3.714563   -2.742772
           20283  |  -3.448707   .2481175   -13.90   0.000    -3.935016   -2.962398
           20285  |  -3.166276   .2496781   -12.68   0.000    -3.655643   -2.676908
           20286  |  -2.348713   .2501804    -9.39   0.000    -2.839065   -1.858361
           20288  |  -15.95612   .2386304   -66.87   0.000    -16.42384   -15.48841
           20289  |  -2.235543   .2507293    -8.92   0.000    -2.726971   -1.744115
           20290  |  -2.228989   .2500046    -8.92   0.000    -2.718996   -1.738981
           20291  |  -2.966524   .2496292   -11.88   0.000    -3.455796   -2.477253
           20292  |  -2.343664   .2513395    -9.32   0.000    -2.836288   -1.851041
           20293  |  -1.766357   .2517617    -7.02   0.000    -2.259808   -1.272905
           20296  |  -2.410887   .2502558    -9.63   0.000    -2.901386   -1.920387
           20297  |  -2.605022   .2500386   -10.42   0.000    -3.095096   -2.114948
           20298  |  -2.003885   .2509901    -7.98   0.000    -2.495824   -1.511946
           20304  |  -2.230248    .251786    -8.86   0.000    -2.723747   -1.736749
           20312  |   -3.76899    .249529   -15.10   0.000    -4.258066   -3.279915
           20317  |  -2.200647   .2505948    -8.78   0.000    -2.691811   -1.709482
           20322  |  -14.36945   .2417502   -59.44   0.000    -14.84328   -13.89562
           20326  |  -3.891309   .2504089   -15.54   0.000    -4.382109   -3.400509
           20332  |  -3.653938   .2511254   -14.55   0.000    -4.146142   -3.161733
           20333  |  -3.346793   .2511868   -13.32   0.000    -3.839117   -2.854468
           20339  |  -4.756679   .2519168   -18.88   0.000    -5.250434   -4.262924
           20341  |  -4.252699   .2517688   -16.89   0.000    -4.746164   -3.759234
           20345  |  -5.695634   .2508903   -22.70   0.000    -6.187377    -5.20389
           20352  |  -3.683301   .2539296   -14.51   0.000    -4.181001     -3.1856
           20353  |   -4.31668   .2534582   -17.03   0.000    -4.813457   -3.819904
           20355  |  -3.764331   .2540205   -14.82   0.000    -4.262209   -3.266452
           20358  |  -16.11774   .2440744   -66.04   0.000    -16.59612   -15.63935
           20359  |  -6.280684   .2525574   -24.87   0.000    -6.775695   -5.785673
           20367  |  -6.759275     .25307   -26.71   0.000    -7.255291    -6.26326
           20368  |  -6.349026   .2538193   -25.01   0.000     -6.84651   -5.851542
           20371  |  -14.99127    .246009   -60.94   0.000    -15.47344   -14.50909
           20377  |  -5.955261   .2537703   -23.47   0.000    -6.452649   -5.457872
           20381  |  -5.897558   .2540391   -23.22   0.000    -6.395473   -5.399643
           20382  |  -5.421504   .2549364   -21.27   0.000    -5.921178    -4.92183
           20383  |  -5.322583   .2555795   -20.83   0.000    -5.823517   -4.821649
           20384  |  -5.013503   .2541646   -19.73   0.000    -5.511664   -4.515342
           20388  |  -6.648049   .2547684   -26.09   0.000    -7.147393   -6.148704
           20390  |  -5.930441   .2560117   -23.16   0.000    -6.432222    -5.42866
           20391  |  -7.081755   .2537335   -27.91   0.000    -7.579071   -6.584439
           20394  |   -7.94453   .2541774   -31.26   0.000    -8.442716   -7.446344
           20398  |  -8.455489   .2521041   -33.54   0.000    -8.949611   -7.961366
           20406  |  -14.13407   .2484964   -56.88   0.000    -14.62112   -13.64702
           20409  |   -3.66975   .2582521   -14.21   0.000    -4.175922   -3.163577
           20412  |  -3.125889   .2581342   -12.11   0.000     -3.63183   -2.619947
           20415  |  -4.622079   .2575396   -17.95   0.000    -5.126855   -4.117303
           20417  |  -4.715509   .2586954   -18.23   0.000    -5.222551   -4.208468
           20418  |  -12.79173    .251018   -50.96   0.000    -13.28372   -12.29973
           20421  |  -15.84483   .2497911   -63.43   0.000    -16.33442   -15.35524
           20424  |  -3.075629   .2618287   -11.75   0.000    -3.588811   -2.562446
           20426  |  -3.897297   .2602228   -14.98   0.000    -4.407332   -3.387262
           20431  |  -4.807976   .2612119   -18.41   0.000    -5.319949   -4.296002
           20436  |  -5.680916   .2594911   -21.89   0.000    -6.189517   -5.172315
           20437  |  -1.920479   .2627419    -7.31   0.000    -2.435452   -1.405506
           20438  |  -5.126677      .2609   -19.65   0.000     -5.63804   -4.615315
           20439  |  -3.542411   .2625239   -13.49   0.000    -4.056956   -3.027866
           20445  |  -2.553402   .2644196    -9.66   0.000    -3.071663   -2.035141
           20448  |  -14.67632   .2528835   -58.04   0.000    -15.17197   -14.18067
           20451  |   -.934048   .2668464    -3.50   0.000    -1.457065   -.4110307
           20457  |  -2.094812   .2643907    -7.92   0.000    -2.613016   -1.576608
           20459  |     .04249   .2673138     0.16   0.874    -.4814435    .5664234
           20460  |  -2.686892   .2647492   -10.15   0.000    -3.205799   -2.167985
           20461  |  -2.187294   .2652675    -8.25   0.000    -2.707217   -1.667371
           20462  |  -14.17465   .2549966   -55.59   0.000    -14.67444   -13.67486
           20465  |  -5.240559   .2620425   -20.00   0.000    -5.754161   -4.726958
           20466  |  -6.083951   .2615215   -23.26   0.000    -6.596531    -5.57137
           20471  |  -12.28656   .2564246   -47.91   0.000    -12.78915   -11.78397
           20475  |  -5.513007   .2624468   -21.01   0.000    -6.027401   -4.998613
           20479  |    -8.0408   .2610541   -30.80   0.000    -8.552464   -7.529136
           20482  |  -6.066456   .2629607   -23.07   0.000    -6.581857   -5.551054
           20489  |  -5.718067   .2643923   -21.63   0.000    -6.236274   -5.199859
           20493  |  -4.177648   .2667562   -15.66   0.000    -4.700489   -3.654808
           20494  |  -4.379631    .265983   -16.47   0.000    -4.900956   -3.858306
           20496  |  -5.709099   .2655338   -21.50   0.000    -6.229543   -5.188654
           20500  |  -3.996034   .2687503   -14.87   0.000    -4.522783   -3.469285
           20516  |  -6.642111   .2664885   -24.92   0.000    -7.164426   -6.119795
           20521  |  -5.615494   .2692204   -20.86   0.000    -6.143165   -5.087824
           20525  |  -14.55734   .2623036   -55.50   0.000    -15.07145   -14.04323
           20528  |  -5.960477   .2697469   -22.10   0.000    -6.489179   -5.431775
           20535  |  -2.729639   .2733202    -9.99   0.000    -3.265345   -2.193933
           20536  |  -2.706212    .274694    -9.85   0.000    -3.244611   -2.167814
           20542  |  -2.637603   .2741776    -9.62   0.000    -3.174989   -2.100216
           20544  |  -1.921001   .2752889    -6.98   0.000    -2.460565   -1.381436
           20550  |  -6.706335   .2724858   -24.61   0.000    -7.240405   -6.172264
           20559  |  -6.678589   .2727899   -24.48   0.000    -7.213255   -6.143922
           20560  |  -13.97733   .2672552   -52.30   0.000    -14.50115   -13.45351
           20562  |  -6.318677   .2739893   -23.06   0.000    -6.855694    -5.78166
           20565  |  -6.862661   .2742783   -25.02   0.000    -7.400244   -6.325077
           20568  |  -15.32761   .2670927   -57.39   0.000    -15.85111   -14.80411
           20570  |  -7.272897   .2745147   -26.49   0.000    -7.810944    -6.73485
           20577  |  -6.814846   .2756393   -24.72   0.000    -7.355097   -6.274595
           20578  |  -5.348932   .2773927   -19.28   0.000     -5.89262   -4.805244
           20579  |  -5.668765   .2768803   -20.47   0.000    -6.211448   -5.126081
           20582  |  -15.19867   .2693485   -56.43   0.000    -15.72659   -14.67074
           20584  |  -6.541084   .2772833   -23.59   0.000    -7.084557    -5.99761
           20585  |  -7.374394   .2759424   -26.72   0.000    -7.915239   -6.833548
           20586  |  -5.842665    .277974   -21.02   0.000    -6.387492   -5.297837
           20592  |  -6.149712   .2788948   -22.05   0.000    -6.696344    -5.60308
           20595  |  -13.83284   .2718743   -50.88   0.000    -14.36571   -13.29997
           20604  |  -11.09938   .2752265   -40.33   0.000    -11.63882   -10.55993
           20605  |  -4.798791   .2809643   -17.08   0.000    -5.349479   -4.248102
           20607  |  -3.086144   .2834762   -10.89   0.000    -3.641755   -2.530532
           20608  |  -3.158289   .2833751   -11.15   0.000    -3.713703   -2.602876
           20613  |  -3.202682   .2841861   -11.27   0.000    -3.759685   -2.645679
           20614  |   -2.55323   .2854258    -8.95   0.000    -3.112662   -1.993797
           20618  |  -1.407838   .2864306    -4.92   0.000    -1.969241    -.846436
           20619  |  -1.336386   .2857696    -4.68   0.000    -1.896492   -.7762789
           20621  |  -.5471077   .2882191    -1.90   0.058    -1.112015       .0178
           20622  |  -1.502048   .2868712    -5.24   0.000    -2.064314   -.9397823
           20623  |  -14.03362   .2765005   -50.75   0.000    -14.57556   -13.49168
           20628  |    -1.6291   .2877304    -5.66   0.000     -2.19305   -1.065151
           20629  |  -.8862804   .2885982    -3.07   0.002    -1.451931   -.3206297
           20632  |  -2.914859   .2871928   -10.15   0.000    -3.477755   -2.351963
           20639  |  -9.865832   .2812925   -35.07   0.000    -10.41716     -9.3145
           20643  |  -.0990662   .2917842    -0.34   0.734    -.6709615    .4728291
           20647  |  -.3388477   .2875816    -1.18   0.239    -.9025059    .2248105
           20648  |   .5667392   .2885445     1.96   0.050     .0011938    1.132285
           20653  |  -.7301646   .2888795    -2.53   0.011    -1.296367   -.1639626
           20656  |  -1.175367    .289098    -4.07   0.000    -1.741997   -.6087362
           20657  |  -.8097186   .2895291    -2.80   0.005    -1.377194   -.2422433
           20661  |  -2.575506   .2881148    -8.94   0.000     -3.14021   -2.010803
           20664  |  -1.817398   .2887223    -6.29   0.000    -2.383292   -1.251504
           20667  |  -1.834991   .2900444    -6.33   0.000    -2.403476   -1.266506
           20668  |  -3.613398   .2884905   -12.53   0.000    -4.178838   -3.047958
           20670  |  -2.424052    .289341    -8.38   0.000    -2.991158   -1.856945
           20671  |  -3.192574   .2888438   -11.05   0.000    -3.758706   -2.626442
           20675  |  -3.091116   .2894771   -10.68   0.000    -3.658489   -2.523742
           20677  |   -1.37764   .2912704    -4.73   0.000    -1.948528   -.8067519
           20678  |  -1.862194   .2912693    -6.39   0.000     -2.43308   -1.291308
           20684  |  -2.096568   .2926062    -7.17   0.000    -2.670074   -1.523062
           20690  |  -3.057104   .2919637   -10.47   0.000    -3.629351   -2.484857
           20692  |  -3.677717   .2915627   -12.61   0.000    -4.249178   -3.106256
           20695  |  -2.564641   .2930407    -8.75   0.000    -3.138999   -1.990283
           20697  |   -3.86114   .2926435   -13.19   0.000    -4.434719    -3.28756
                  |
      grouped_div |
             803  |   -.585915   .3625473    -1.62   0.106    -1.296506    .1246755
             804  |   .1064673   .3714349     0.29   0.774    -.6215429    .8344774
             805  |  -.5723422   .4320877    -1.32   0.185    -1.419231     .274547
             806  |   2.022239   .3303341     6.12   0.000     1.374786    2.669691
             807  |  -.1533251   .3434824    -0.45   0.655    -.8265485    .5198982
             808  |  -3.137963   .6258719    -5.01   0.000    -4.364668   -1.911258
             809  |    1.04564     .29317     3.57   0.000     .4710284    1.620251
             810  |   .2872513   .3677168     0.78   0.435    -.4334714    1.007974
             811  |   2.887998   .3526618     8.19   0.000     2.196783    3.579214
             812  |   10.40451   .3221729    32.29   0.000     9.773053    11.03597
             814  |   17.14759   .2939372    58.34   0.000     16.57147     17.7237
             816  |   9.738542   .3487716    27.92   0.000     9.054952    10.42213
             818  |   3.820828   .2985422    12.80   0.000     3.235687    4.405969
             819  |   16.91198   .3281987    51.53   0.000     16.26872    17.55525
             824  |  -.3842287   .3648901    -1.05   0.292    -1.099411    .3309536
             828  |   .9029178   .4305317     2.10   0.036     .0590783    1.746757
             999  |   .4671754   .4044747     1.16   0.248    -.3255924    1.259943
                  |
           an_age |   .0922787   .1006407     0.92   0.359    -.1049765    .2895338
         max_rate |   .1385649   .0292903     4.73   0.000     .0811561    .1959736
                  |
            empid |
     EMPLOYEE 10  |  -1.191544   1.288249    -0.92   0.355    -3.716505    1.333416
    EMPLOYEE 100  |   .8168248   .9542557     0.86   0.392     -1.05351     2.68716
    EMPLOYEE 101  |    .122241   .5439527     0.22   0.822    -.9439031    1.188385
    EMPLOYEE 102  |   .4847233   1.254791     0.39   0.699    -1.974659    2.944105
    EMPLOYEE 103  |  -.0162141   .4478796    -0.04   0.971    -.8940553    .8616271
    EMPLOYEE 104  |   .7212672   .8053532     0.90   0.370    -.8572201    2.299754
    EMPLOYEE 105  |   1.063557   .9685409     1.10   0.272    -.8347776    2.961891
    EMPLOYEE 106  |    .344347   .9792417     0.35   0.725    -1.574961    2.263655
    EMPLOYEE 107  |  -.6870294   .7029379    -0.98   0.328    -2.064783    .6907245
    EMPLOYEE 108  |   -.316137   .7758611    -0.41   0.684     -1.83682    1.204546
     EMPLOYEE 11  |  -.3820563    .706455    -0.54   0.589    -1.766704    1.002591
    EMPLOYEE 110  |  -.6015006    .926545    -0.65   0.516    -2.417523    1.214522
    EMPLOYEE 111  |  -.2322363   .8370026    -0.28   0.781    -1.872756    1.408284
    EMPLOYEE 112  |   .0672333   .3690843     0.18   0.855    -.6561697    .7906363
    EMPLOYEE 114  |   .3536996    .844606     0.42   0.675    -1.301723    2.009122
    EMPLOYEE 116  |   .2632209   .4313408     0.61   0.542    -.5822044    1.108646
    EMPLOYEE 117  |   1.074436    1.20179     0.89   0.371    -1.281064    3.429937
    EMPLOYEE 118  |   .1375624   .5490973     0.25   0.802     -.938665     1.21379
    EMPLOYEE 119  |  -.1611775   .4411517    -0.37   0.715    -1.025832    .7034771
     EMPLOYEE 12  |  -1.073486   1.100051    -0.98   0.329    -3.229579    1.082607
    EMPLOYEE 120  |   .4753798    1.02528     0.46   0.643    -1.534164    2.484923
    EMPLOYEE 121  |  -.2227958   .6110703    -0.36   0.715     -1.42049    .9748983
    EMPLOYEE 122  |    .578472   1.013206     0.57   0.568    -1.407406     2.56435
    EMPLOYEE 123  |   .2318231   .5411745     0.43   0.668    -.8288757    1.292522
    EMPLOYEE 124  |   .2525063   .7584976     0.33   0.739    -1.234144    1.739157
    EMPLOYEE 125  |   -.319669   .5414443    -0.59   0.555    -1.380896    .7415585
    EMPLOYEE 126  |   .6317108    .635432     0.99   0.320    -.6137321    1.877154
    EMPLOYEE 127  |  -.9456614   .8839284    -1.07   0.285    -2.678156    .7868329
    EMPLOYEE 128  |  -.5446234   .5934365    -0.92   0.359    -1.707755    .6185084
    EMPLOYEE 129  |   1.199164   1.298912     0.92   0.356    -1.346695    3.745023
     EMPLOYEE 13  |   .5885787   .4575935     1.29   0.198    -.3083018    1.485459
    EMPLOYEE 130  |   1.590552   1.573762     1.01   0.312    -1.494012    4.675116
    EMPLOYEE 131  |   1.387701   1.912856     0.73   0.468    -2.361486    5.136887
    EMPLOYEE 132  |   .4390899   .5706261     0.77   0.442    -.6793338    1.557514
    EMPLOYEE 133  |  -.9919596   1.021507    -0.97   0.332    -2.994107    1.010188
    EMPLOYEE 134  |   .7690966   .9291458     0.83   0.408    -1.052023    2.590217
    EMPLOYEE 136  |   .4222467   .7508734     0.56   0.574     -1.04946    1.893954
    EMPLOYEE 137  |  -.1243799   .4579919    -0.27   0.786    -1.022041    .7732814
    EMPLOYEE 138  |   1.687744     1.2584     1.34   0.180    -.7787121    4.154199
    EMPLOYEE 139  |  -.3785493   .5608458    -0.67   0.500    -1.477804    .7207051
     EMPLOYEE 14  |  -.6441281   .4209986    -1.53   0.126    -1.469283    .1810266
    EMPLOYEE 140  |    -.36398   .4170919    -0.87   0.383    -1.181478    .4535177
    EMPLOYEE 141  |  -.0514741   .3781082    -0.14   0.892    -.7925639    .6896157
    EMPLOYEE 142  |  -.6793297   .4480059    -1.52   0.129    -1.557418    .1987592
    EMPLOYEE 143  |   .9285601    .628842     1.48   0.140    -.3039664    2.161087
    EMPLOYEE 144  |   2.139151   .5797821     3.69   0.000     1.002782    3.275521
    EMPLOYEE 145  |   1.238974   .7177799     1.73   0.084    -.1678697    2.645819
    EMPLOYEE 146  |    .995849   1.148813     0.87   0.386    -1.255817    3.247515
    EMPLOYEE 148  |   .9231924   1.457194     0.63   0.526    -1.932898    3.779283
    EMPLOYEE 149  |  -.4997035   .6281312    -0.80   0.426    -1.730837    .7314297
     EMPLOYEE 15  |   .2123791   .3995593     0.53   0.595    -.5707545    .9955128
    EMPLOYEE 150  |    .741849   .9910983     0.75   0.454    -1.200698    2.684396
    EMPLOYEE 154  |    .358595   .6235224     0.58   0.565    -.8635052    1.580695
    EMPLOYEE 155  |   .6588285    .638263     1.03   0.302    -.5921631     1.90982
    EMPLOYEE 156  |   .8002985   1.101837     0.73   0.468    -1.359296    2.959893
    EMPLOYEE 157  |   2.040621   1.315416     1.55   0.121    -.5375869    4.618829
    EMPLOYEE 158  |  -.0891946    .347503    -0.26   0.797    -.7702984    .5919092
     EMPLOYEE 16  |   .2710247   .3976956     0.68   0.496    -.5084563    1.050506
    EMPLOYEE 160  |  -.1999447   .3808445    -0.53   0.600    -.9463977    .5465083
    EMPLOYEE 161  |   1.078715   1.420356     0.76   0.448    -1.705173    3.862603
    EMPLOYEE 162  |    .664559   .8427962     0.79   0.430    -.9873163    2.316434
    EMPLOYEE 163  |  -.4009752   .4230753    -0.95   0.343      -1.2302    .4282497
    EMPLOYEE 164  |  -.2496394   .4592437    -0.54   0.587    -1.149754    .6504755
    EMPLOYEE 165  |   .4277999   1.104716     0.39   0.699    -1.737436    2.593036
    EMPLOYEE 167  |  -2.137032   .4894888    -4.37   0.000    -3.096427   -1.177637
    EMPLOYEE 168  |  -.4556027   .4188614    -1.09   0.277    -1.276568     .365363
    EMPLOYEE 169  |   -.834052   .5295011    -1.58   0.115    -1.871871    .2037669
    EMPLOYEE 170  |   1.319243   1.817261     0.73   0.468    -2.242577    4.881064
    EMPLOYEE 171  |   1.613909   1.368145     1.18   0.238    -1.067647    4.295466
    EMPLOYEE 172  |   .0587301   .4703994     0.12   0.901    -.8632498      .98071
    EMPLOYEE 174  |  -.1216191   .3346512    -0.36   0.716    -.7775334    .5342952
    EMPLOYEE 176  |   -.975404   .7892051    -1.24   0.216    -2.522241    .5714332
    EMPLOYEE 177  |   .5345575    1.28792     0.42   0.678    -1.989758    3.058873
    EMPLOYEE 178  |   1.499678   1.573655     0.95   0.341    -1.584676    4.584032
    EMPLOYEE 179  |  -.6333661    .465366    -1.36   0.174    -1.545481    .2787485
    EMPLOYEE 180  |   1.401558    1.05003     1.33   0.182    -.6564956    3.459611
    EMPLOYEE 181  |   .3514515   .5407842     0.65   0.516    -.7084822    1.411385
    EMPLOYEE 182  |  -3.255371   .8903233    -3.66   0.000    -5.000399   -1.510343
    EMPLOYEE 183  |  -1.989775   .5441485    -3.66   0.000    -3.056303   -.9232472
    EMPLOYEE 184  |   .2613287   .5033723     0.52   0.604    -.7252779    1.247935
    EMPLOYEE 185  |   .0701582   .5141878     0.14   0.891    -.9376467    1.077963
    EMPLOYEE 186  |   1.588793   1.766975     0.90   0.369    -1.874467    5.052052
    EMPLOYEE 187  |   .5846796   .6041754     0.97   0.333    -.5995004     1.76886
    EMPLOYEE 188  |  -.9596991   1.154217    -0.83   0.406    -3.221958     1.30256
    EMPLOYEE 189  |  -.7736262   .6765235    -1.14   0.253    -2.099608    .5523557
     EMPLOYEE 19  |   1.464643   .7006665     2.09   0.037     .0913407    2.837945
    EMPLOYEE 190  |   1.270637     .63675     2.00   0.046     .0226106    2.518663
    EMPLOYEE 191  |    1.28597   1.617295     0.80   0.427    -1.883918    4.455858
    EMPLOYEE 192  |     1.5384   1.193855     1.29   0.198    -.8015499    3.878349
    EMPLOYEE 193  |  -2.140287   .9284967    -2.31   0.021    -3.960135   -.3204394
    EMPLOYEE 194  |  -1.928528   .5367137    -3.59   0.000    -2.980484   -.8765728
    EMPLOYEE 195  |   -.040437   .4434984    -0.09   0.927    -.9096912    .8288172
    EMPLOYEE 197  |  -.2497493   .4884342    -0.51   0.609    -1.207077    .7075786
    EMPLOYEE 198  |   1.239726   .5055174     2.45   0.014     .2489148    2.230537
    EMPLOYEE 199  |    .254729   .5378505     0.47   0.636    -.7994546    1.308913
      EMPLOYEE 2  |  -.5968855   .5156311    -1.16   0.247    -1.607519    .4137483
     EMPLOYEE 20  |  -1.689592    1.01039    -1.67   0.094     -3.66995    .2907659
    EMPLOYEE 200  |   1.566038   .6764696     2.32   0.021     .2401612    2.891914
    EMPLOYEE 202  |  -1.095665   .7618341    -1.44   0.150    -2.588855    .3975255
    EMPLOYEE 203  |   .6052729    .486287     1.24   0.213    -.3478466    1.558392
    EMPLOYEE 204  |  -.0477054   .3455214    -0.14   0.890    -.7249252    .6295144
    EMPLOYEE 205  |    2.02731   1.074291     1.89   0.059    -.0782949    4.132914
    EMPLOYEE 206  |   1.148989   1.440204     0.80   0.425    -1.673802    3.971779
    EMPLOYEE 207  |  -.3170814   .5250893    -0.60   0.546    -1.346253    .7120904
    EMPLOYEE 208  |   .5215023   .4938412     1.06   0.291    -.4464233    1.489428
    EMPLOYEE 209  |  -.4269199    .556315    -0.77   0.443    -1.517294    .6634542
     EMPLOYEE 21  |  -1.349675   .8438411    -1.60   0.110    -3.003599    .3042481
    EMPLOYEE 210  |   .5749883   1.126666     0.51   0.610     -1.63327    2.783246
    EMPLOYEE 212  |  -.5488997   .6974183    -0.79   0.431    -1.915835    .8180358
    EMPLOYEE 213  |   1.451278   1.716858     0.85   0.398    -1.913753    4.816308
    EMPLOYEE 214  |  -.0162044    .987652    -0.02   0.987    -1.951996    1.919588
    EMPLOYEE 215  |   -.041167   .6792823    -0.06   0.952    -1.372556    1.290222
    EMPLOYEE 216  |  -.3523123   .5373748    -0.66   0.512    -1.405564    .7009389
    EMPLOYEE 217  |  -3.377406   .6960593    -4.85   0.000    -4.741678   -2.013135
    EMPLOYEE 218  |   .1823473   .6840532     0.27   0.790    -1.158393    1.523087
     EMPLOYEE 22  |  -1.759684   .5294026    -3.32   0.001     -2.79731   -.7220587
    EMPLOYEE 220  |   1.034639   1.538353     0.67   0.501    -1.980523    4.049801
    EMPLOYEE 223  |   .1701096   .8325096     0.20   0.838    -1.461604    1.801823
    EMPLOYEE 224  |  -.4456578   .5107746    -0.87   0.383    -1.446773    .5554573
    EMPLOYEE 225  |  -.4177004   .5212421    -0.80   0.423    -1.439332    .6039309
    EMPLOYEE 226  |   .2858216   .5600597     0.51   0.610     -.811892    1.383535
    EMPLOYEE 227  |   .1465996   .5129362     0.29   0.775    -.8587523    1.151951
    EMPLOYEE 228  |   1.147238   1.334654     0.86   0.390    -1.468677    3.763152
     EMPLOYEE 23  |  -.7864854   .6704849    -1.17   0.241    -2.100632    .5276609
    EMPLOYEE 230  |   .0371368   .4718142     0.08   0.937    -.8876161    .9618897
    EMPLOYEE 231  |  -1.107965    .944316    -1.17   0.241    -2.958819    .7428886
    EMPLOYEE 232  |    .918733   .9899225     0.93   0.353    -1.021509    2.858975
    EMPLOYEE 233  |   1.395072   1.773367     0.79   0.431    -2.080717    4.870861
    EMPLOYEE 235  |    .178467   .6920491     0.26   0.796    -1.177945    1.534879
    EMPLOYEE 237  |   2.524091   .6427252     3.93   0.000     1.264354    3.783829
    EMPLOYEE 238  |   1.222492   .8926188     1.37   0.171    -.5270357    2.972019
    EMPLOYEE 239  |  -.5165584   .6373929    -0.81   0.418    -1.765845    .7327277
     EMPLOYEE 24  |  -.5767369   .5573746    -1.03   0.301    -1.669188    .5157139
    EMPLOYEE 240  |  -.7210924   .7407004    -0.97   0.330    -2.172861    .7306759
    EMPLOYEE 241  |    .680933    1.13167     0.60   0.547    -1.537134       2.899
    EMPLOYEE 242  |  -.2633627   .4313648    -0.61   0.542    -1.108835    .5821096
    EMPLOYEE 243  |   .3249165   .4285124     0.76   0.448    -.5149651    1.164798
    EMPLOYEE 244  |  -1.212148   1.166635    -1.04   0.299    -3.498746    1.074449
    EMPLOYEE 245  |   .1143453   .6087302     0.19   0.851    -1.078762    1.307453
    EMPLOYEE 246  |  -1.403483   .9557525    -1.47   0.142    -3.276752    .4697858
    EMPLOYEE 247  |  -.2828142   .4404398    -0.64   0.521    -1.146074    .5804451
    EMPLOYEE 248  |   .5861873   .4954572     1.18   0.237    -.3849059     1.55728
    EMPLOYEE 249  |  -.5990181   .5878881    -1.02   0.308    -1.751275    .5532389
    EMPLOYEE 250  |  -.4234438   .5001429    -0.85   0.397    -1.403721    .5568333
    EMPLOYEE 251  |  -2.506207   .5493718    -4.56   0.000    -3.582972   -1.429442
    EMPLOYEE 252  |   .9692979   1.400234     0.69   0.489    -1.775151    3.713747
    EMPLOYEE 253  |   -.757274    .914437    -0.83   0.408    -2.549565    1.035017
    EMPLOYEE 254  |   1.500033   1.703804     0.88   0.379    -1.839412    4.839478
    EMPLOYEE 255  |   .9279819   1.307413     0.71   0.478    -1.634539    3.490503
    EMPLOYEE 256  |   .0222996   .5167535     0.04   0.966    -.9905342    1.035133
    EMPLOYEE 257  |    1.21933   1.512626     0.81   0.420    -1.745407    4.184068
    EMPLOYEE 258  |   .8082275   1.422547     0.57   0.570    -1.979955     3.59641
    EMPLOYEE 259  |    1.00062   1.197938     0.84   0.404    -1.347331    3.348571
     EMPLOYEE 26  |  -.6471121   1.244146    -0.52   0.603    -3.085631    1.791407
    EMPLOYEE 260  |   .9210518   1.362206     0.68   0.499    -1.748863    3.590966
    EMPLOYEE 261  |  -.6620953   .7223269    -0.92   0.359    -2.077851    .7536609
    EMPLOYEE 262  |  -.7733235   .6959024    -1.11   0.266    -2.137288    .5906409
    EMPLOYEE 263  |   1.176551   1.413603     0.83   0.405    -1.594103    3.947204
    EMPLOYEE 264  |     .54176   .8079887     0.67   0.503    -1.041893    2.125413
    EMPLOYEE 265  |   1.353783   1.688706     0.80   0.423     -1.95607    4.663637
    EMPLOYEE 266  |   .4792419   1.446149     0.33   0.740    -2.355201    3.313685
    EMPLOYEE 267  |   .8702286    1.61625     0.54   0.590    -2.297612    4.038069
    EMPLOYEE 269  |   .3734126   .7685031     0.49   0.627    -1.132849    1.879674
     EMPLOYEE 27  |  -1.075037   1.052395    -1.02   0.307    -3.137724    .9876508
    EMPLOYEE 271  |   .3748122   1.107353     0.34   0.735    -1.795594    2.545218
    EMPLOYEE 272  |   1.121119   .9913418     1.13   0.258    -.8219046    3.064143
    EMPLOYEE 273  |   .3107989   .6656421     0.47   0.641    -.9938556    1.615453
    EMPLOYEE 274  |   1.377965   1.709139     0.81   0.420    -1.971936    4.727867
    EMPLOYEE 276  |   .6461437   .7253267     0.89   0.373    -.7754922     2.06778
    EMPLOYEE 277  |   .9089638   1.043906     0.87   0.384    -1.137085    2.955012
    EMPLOYEE 278  |   .2833415    .445436     0.64   0.525    -.5897102    1.156393
    EMPLOYEE 279  |   2.192115   1.908445     1.15   0.251    -1.548424    5.932655
     EMPLOYEE 28  |   -.036501   .4479541    -0.08   0.935    -.9144883    .8414862
    EMPLOYEE 280  |   .7402932   .4421954     1.67   0.094     -.126407    1.606993
    EMPLOYEE 281  |   .6767427   1.341279     0.50   0.614    -1.952156    3.305642
    EMPLOYEE 282  |  -.6790181   .5019206    -1.35   0.176    -1.662779    .3047432
    EMPLOYEE 283  |   .9801196   1.363649     0.72   0.472    -1.692625    3.652864
    EMPLOYEE 284  |  -.7959763   .6542941    -1.22   0.224    -2.078389    .4864361
    EMPLOYEE 285  |   .8813794   1.592827     0.55   0.580    -2.240552    4.003311
    EMPLOYEE 286  |   1.066978   1.247524     0.86   0.392    -1.378161    3.512118
    EMPLOYEE 287  |    2.14083   1.387713     1.54   0.123    -.5790787    4.860739
    EMPLOYEE 288  |   .6042074   1.292646     0.47   0.640    -1.929372    3.137786
    EMPLOYEE 289  |   .2215558   1.452829     0.15   0.879    -2.625981    3.069092
    EMPLOYEE 290  |   .5460233   1.204826     0.45   0.650    -1.815429    2.907475
    EMPLOYEE 291  |   1.525428   1.566344     0.97   0.330    -1.544596    4.595453
    EMPLOYEE 292  |   .3841401    1.50315     0.26   0.798    -2.562024    3.330305
    EMPLOYEE 293  |   1.638042   1.664017     0.98   0.325    -1.623421    4.899505
    EMPLOYEE 294  |   1.188898   1.304828     0.91   0.362    -1.368557    3.746353
    EMPLOYEE 296  |   1.041418   1.112476     0.94   0.349    -1.139029    3.221865
    EMPLOYEE 297  |  -1.019541   1.019468    -1.00   0.317    -3.017692    .9786106
    EMPLOYEE 298  |   -.201976   .4273227    -0.47   0.636    -1.039526    .6355738
      EMPLOYEE 3  |  -.4190044   .6231109    -0.67   0.501    -1.640298     .802289
     EMPLOYEE 30  |   8.125606   1.802234     4.51   0.000     4.593238    11.65797
    EMPLOYEE 300  |   1.438754   1.601105     0.90   0.369    -1.699401    4.576909
    EMPLOYEE 301  |  -.7482534    1.41099    -0.53   0.596    -3.513785    2.017279
    EMPLOYEE 302  |   1.154677   1.408974     0.82   0.412    -1.606903    3.916257
    EMPLOYEE 303  |   1.817589   1.927948     0.94   0.346    -1.961178    5.596356
    EMPLOYEE 304  |   .9062701   .9735948     0.93   0.352     -1.00197     2.81451
    EMPLOYEE 305  |   1.193893   1.340636     0.89   0.373    -1.433746    3.821532
    EMPLOYEE 306  |   1.266184   1.670218     0.76   0.448    -2.007434    4.539802
    EMPLOYEE 307  |   1.819125   2.121235     0.86   0.391    -2.338482    5.976732
    EMPLOYEE 308  |   .6907931   .5414146     1.28   0.202    -.3703762    1.751962
    EMPLOYEE 309  |  -2.512194   1.180581    -2.13   0.033    -4.826125   -.1982622
     EMPLOYEE 31  |  -.6793152   .5257952    -1.29   0.196    -1.709871    .3512402
    EMPLOYEE 310  |   -.260026   .5684765    -0.46   0.647    -1.374236    .8541843
    EMPLOYEE 311  |   1.107332   1.089281     1.02   0.309    -1.027653    3.242317
    EMPLOYEE 312  |   .7492122   1.096839     0.68   0.495    -1.400586    2.899011
    EMPLOYEE 313  |  -.2541751   .6342858    -0.40   0.689    -1.497371    .9890211
    EMPLOYEE 314  |   1.243737   1.522397     0.82   0.414    -1.740151    4.227626
    EMPLOYEE 315  |   1.025416   1.084604     0.95   0.344    -1.100402    3.151234
    EMPLOYEE 316  |   1.819856   2.141413     0.85   0.395    -2.377301    6.017013
    EMPLOYEE 317  |   -1.41078   .8163832    -1.73   0.084    -3.010886    .1893259
    EMPLOYEE 318  |  -9.55e-06   .4429386    -0.00   1.000    -.8681665    .8681474
    EMPLOYEE 319  |   1.689288   1.857165     0.91   0.363    -1.950743    5.329319
    EMPLOYEE 320  |   1.424338   1.029906     1.38   0.167    -.5942722    3.442948
    EMPLOYEE 321  |   1.185072    1.65843     0.71   0.475     -2.06544    4.435584
    EMPLOYEE 322  |   -.412553   .5881934    -0.70   0.483    -1.565408    .7403024
    EMPLOYEE 323  |   .5960513   1.213252     0.49   0.623    -1.781915    2.974018
    EMPLOYEE 324  |  -.4329289   .6880532    -0.63   0.529    -1.781509    .9156511
    EMPLOYEE 325  |   1.000466   1.212668     0.83   0.409    -1.376355    3.377287
    EMPLOYEE 326  |  -1.059469   .6640075    -1.60   0.111    -2.360919    .2419819
    EMPLOYEE 327  |   .6801974   .5479097     1.24   0.214    -.3937023    1.754097
    EMPLOYEE 328  |   .3377401   .9037382     0.37   0.709    -1.433581    2.109061
    EMPLOYEE 329  |  -1.179572   .7689623    -1.53   0.125    -2.686733    .3275893
     EMPLOYEE 33  |   .2642597   .5526752     0.48   0.633    -.8189802      1.3475
    EMPLOYEE 330  |  -5.531866   1.198577    -4.62   0.000    -7.881069   -3.182663
    EMPLOYEE 331  |   .2283097   1.097256     0.21   0.835    -1.922305    2.378924
    EMPLOYEE 332  |  -.2334035   .4232098    -0.55   0.581    -1.062892    .5960851
    EMPLOYEE 333  |   .7498746   .9070659     0.83   0.408    -1.027969    2.527718
    EMPLOYEE 334  |   1.240139    1.95573     0.63   0.526    -2.593079    5.073358
    EMPLOYEE 336  |   .4839507   .4326688     1.12   0.263    -.3640775    1.331979
    EMPLOYEE 338  |   1.027365   1.470783     0.70   0.485    -1.855362    3.910091
    EMPLOYEE 339  |   .6509706   1.414091     0.46   0.645     -2.12064    3.422581
     EMPLOYEE 34  |   .3322737   .6162457     0.54   0.590     -.875564    1.540111
    EMPLOYEE 340  |   1.549066   1.805931     0.86   0.391    -1.990548    5.088681
    EMPLOYEE 341  |   .8610677   .9435607     0.91   0.361    -.9883054    2.710441
    EMPLOYEE 342  |  -.2100897   .4022412    -0.52   0.601    -.9984801    .5783006
    EMPLOYEE 343  |   1.260473   1.519958     0.83   0.407    -1.718635    4.239582
    EMPLOYEE 344  |   1.663707   1.721782     0.97   0.334    -1.710974    5.038388
    EMPLOYEE 345  |  -.1098592    .620541    -0.18   0.859    -1.326116    1.106397
    EMPLOYEE 346  |   .5547175   .8010789     0.69   0.489    -1.015392    2.124827
    EMPLOYEE 347  |   .2270397   .7051479     0.32   0.747    -1.155046    1.609125
    EMPLOYEE 348  |   .8185061   1.544999     0.53   0.596    -2.209682    3.846695
    EMPLOYEE 349  |   1.264452   1.462875     0.86   0.387    -1.602774    4.131678
     EMPLOYEE 35  |  -.9124454   1.038372    -0.88   0.380    -2.947648    1.122757
    EMPLOYEE 350  |   .3005119   .5242311     0.57   0.566    -.7269779    1.328002
    EMPLOYEE 351  |   5.689647   2.439092     2.33   0.020     .9090412    10.47025
    EMPLOYEE 352  |   1.494986    1.41053     1.06   0.289    -1.269644    4.259616
    EMPLOYEE 353  |   .7110487   1.436026     0.50   0.620    -2.103553    3.525651
    EMPLOYEE 354  |   1.512059    1.65629     0.91   0.361    -1.734259    4.758378
    EMPLOYEE 355  |   .5230322   .6733869     0.78   0.437     -.796802    1.842866
    EMPLOYEE 356  |   .2168043   .3841997     0.56   0.573    -.5362249    .9698334
    EMPLOYEE 357  |   1.307149   1.846558     0.71   0.479    -2.312093    4.926391
    EMPLOYEE 358  |   .9465785   1.010066     0.94   0.349    -1.033145    2.926302
    EMPLOYEE 359  |   .8411198   .9186813     0.92   0.360      -.95949    2.641729
     EMPLOYEE 36  |  -.6095486   .4529954    -1.35   0.178    -1.497417    .2783195
    EMPLOYEE 361  |   1.433566   2.205774     0.65   0.516    -2.889737     5.75687
    EMPLOYEE 362  |   1.391134   1.122655     1.24   0.215    -.8092622     3.59153
    EMPLOYEE 363  |   1.484687    2.15964     0.69   0.492    -2.748194    5.717569
    EMPLOYEE 364  |   .7954576   1.449589     0.55   0.583    -2.045728    3.636643
    EMPLOYEE 365  |   .3896419   .9911825     0.39   0.694     -1.55307    2.332354
    EMPLOYEE 366  |   .2473627   .3733357     0.66   0.508     -.484373    .9790985
    EMPLOYEE 367  |   .8061442   .7057638     1.14   0.253    -.5771485    2.189437
    EMPLOYEE 368  |   -1.39831   1.183954    -1.18   0.238    -3.718852    .9222318
    EMPLOYEE 369  |   .3692185   .3745608     0.99   0.324    -.3649184    1.103355
     EMPLOYEE 37  |  -.2542447   .5559591    -0.46   0.647    -1.343921    .8354318
    EMPLOYEE 370  |   .6626579   1.045114     0.63   0.526    -1.385759    2.711075
    EMPLOYEE 371  |    1.87211   1.783483     1.05   0.294    -1.623504    5.367725
    EMPLOYEE 372  |   .6558553   .4845172     1.35   0.176    -.2937955    1.605506
    EMPLOYEE 373  |   .8907687   1.375517     0.65   0.517    -1.805237    3.586774
    EMPLOYEE 374  |   1.401092   1.438223     0.97   0.330    -1.417817    4.220001
    EMPLOYEE 375  |   1.387661   1.587108     0.87   0.382    -1.723061    4.498384
    EMPLOYEE 376  |   1.846352   .9933706     1.86   0.063    -.1006482    3.793352
    EMPLOYEE 377  |     1.0402   1.835813     0.57   0.571    -2.557983    4.638383
    EMPLOYEE 378  |  -.7212788   .6181151    -1.17   0.243     -1.93278    .4902229
    EMPLOYEE 379  |   .7829647   1.211701     0.65   0.518    -1.591962    3.157892
     EMPLOYEE 38  |   1.299032   1.149079     1.13   0.258    -.9531561    3.551221
    EMPLOYEE 380  |   .3708924   .5180406     0.72   0.474     -.644464    1.386249
    EMPLOYEE 381  |   1.733092   1.134691     1.53   0.127    -.4908954     3.95708
    EMPLOYEE 382  |  -.7634085   .5205125    -1.47   0.142     -1.78361    .2567928
    EMPLOYEE 383  |  -.4487306   .7082078    -0.63   0.526    -1.836814    .9393523
    EMPLOYEE 384  |   -.978911   .4187996    -2.34   0.019    -1.799756   -.1580665
    EMPLOYEE 385  |   1.214073   1.484526     0.82   0.413    -1.695589    4.123735
    EMPLOYEE 386  |   2.072632   2.384208     0.87   0.385    -2.600401    6.745666
    EMPLOYEE 387  |   1.408972    1.63445     0.86   0.389     -1.79454    4.612484
    EMPLOYEE 388  |   1.008534   1.635296     0.62   0.537    -2.196636    4.213703
    EMPLOYEE 389  |   1.736796   1.750811     0.99   0.321    -1.694783    5.168375
    EMPLOYEE 391  |   1.148609   1.325953     0.87   0.386    -1.450252    3.747469
    EMPLOYEE 392  |   .3291332   .7248343     0.45   0.650    -1.091538    1.749804
    EMPLOYEE 393  |   1.156416   1.426236     0.81   0.417    -1.638998     3.95183
    EMPLOYEE 394  |   -.035377   .4544818    -0.08   0.938    -.9261585    .8554044
    EMPLOYEE 395  |    .048178   .3485563     0.14   0.890    -.6349902    .7313462
    EMPLOYEE 396  |   .7592092   1.162854     0.65   0.514    -1.519977    3.038395
    EMPLOYEE 397  |    1.16913   1.353577     0.86   0.388    -1.483872    3.822132
    EMPLOYEE 398  |  -.4237684   1.617174    -0.26   0.793     -3.59342    2.745884
    EMPLOYEE 399  |   1.175204   1.392674     0.84   0.399    -1.554429    3.904838
      EMPLOYEE 4  |   .2768161   .6874833     0.40   0.687    -1.070647    1.624279
     EMPLOYEE 40  |   .2831793    .580785     0.49   0.626    -.8551558    1.421514
    EMPLOYEE 400  |   .9425888   1.580001     0.60   0.551    -2.154204    4.039381
    EMPLOYEE 401  |  -.5850485   .3542482    -1.65   0.099    -1.279373    .1092758
    EMPLOYEE 402  |    1.32538    2.02986     0.65   0.514    -2.653132    5.303892
    EMPLOYEE 403  |   .9298706   1.452707     0.64   0.522    -1.917427    3.777168
    EMPLOYEE 404  |   .2279669   .9148297     0.25   0.803    -1.565094    2.021028
    EMPLOYEE 405  |   1.853847   2.006996     0.92   0.356    -2.079853    5.787548
    EMPLOYEE 406  |   4.991114   2.360639     2.11   0.034     .3642761    9.617952
    EMPLOYEE 408  |   .2581254   .7507408     0.34   0.731    -1.213322    1.729573
    EMPLOYEE 409  |   1.280415   1.213167     1.06   0.291    -1.097384    3.658215
     EMPLOYEE 41  |  -.9206579   1.187408    -0.78   0.438     -3.24797    1.406654
    EMPLOYEE 410  |   .8871652   1.066243     0.83   0.405    -1.202665    2.976996
    EMPLOYEE 413  |  -.2287135   .9276021    -0.25   0.805    -2.046808    1.589381
    EMPLOYEE 415  |  -.6413479   1.057804    -0.61   0.544    -2.714637    1.431941
    EMPLOYEE 418  |   .7892328   .9644758     0.82   0.413    -1.101134    2.679599
    EMPLOYEE 419  |   1.538232   1.881385     0.82   0.414    -2.149271    5.225734
     EMPLOYEE 42  |  -.0719138   .6654263    -0.11   0.914    -1.376145    1.232318
    EMPLOYEE 420  |   1.217081    1.99394     0.61   0.542    -2.691029    5.125191
    EMPLOYEE 421  |   1.622161   2.351429     0.69   0.490    -2.986625    6.230948
    EMPLOYEE 422  |   .6863485   1.402283     0.49   0.625    -2.062118    3.434815
    EMPLOYEE 423  |   1.320154   1.452972     0.91   0.364    -1.527663     4.16797
    EMPLOYEE 424  |   1.685605   1.797765     0.94   0.348    -1.838003    5.209213
    EMPLOYEE 425  |  -1.032693   .8965622    -1.15   0.249    -2.789949    .7245639
    EMPLOYEE 426  |   .0629136   .3436838     0.18   0.855    -.6107045    .7365318
    EMPLOYEE 427  |   .7874613   1.198074     0.66   0.511    -1.560756    3.135678
    EMPLOYEE 428  |   1.602823   1.858745     0.86   0.389    -2.040306    5.245951
    EMPLOYEE 429  |   .9567239   1.232622     0.78   0.438    -1.459208    3.372656
     EMPLOYEE 43  |   .0444646   .3364499     0.13   0.895    -.6149751    .7039043
    EMPLOYEE 430  |   .1644846    1.29157     0.13   0.899    -2.366984    2.695953
    EMPLOYEE 431  |   .8604771   1.150501     0.75   0.455    -1.394498    3.115452
    EMPLOYEE 432  |   1.692962   1.907449     0.89   0.375    -2.045626    5.431549
    EMPLOYEE 433  |   1.117393   1.001422     1.12   0.265    -.8453883    3.080174
    EMPLOYEE 434  |   1.185299   1.527263     0.78   0.438    -1.808127    4.178726
    EMPLOYEE 435  |  -.2018384   .3443324    -0.59   0.558    -.8767277     .473051
    EMPLOYEE 437  |   -1.00164   .4341047    -2.31   0.021    -1.852483   -.1507978
    EMPLOYEE 438  |  -.5983101   .4384957    -1.36   0.172    -1.457759    .2611388
    EMPLOYEE 439  |   1.837503   1.982655     0.93   0.354    -2.048489    5.723494
     EMPLOYEE 44  |  -.1651088   .3606945    -0.46   0.647    -.8720678    .5418502
    EMPLOYEE 440  |   .6864798   .5441706     1.26   0.207    -.3800913    1.753051
    EMPLOYEE 441  |    1.61484   1.692145     0.95   0.340    -1.701753    4.931433
    EMPLOYEE 442  |   1.531906   1.743455     0.88   0.380    -1.885255    4.949066
    EMPLOYEE 443  |   .9366063   .7875125     1.19   0.234    -.6069133    2.480126
    EMPLOYEE 444  |   2.532373   2.174199     1.16   0.244    -1.729044     6.79379
    EMPLOYEE 445  |   1.871967   1.848992     1.01   0.311    -1.752045     5.49598
    EMPLOYEE 446  |   1.267661   1.261732     1.00   0.315    -1.205326    3.740647
    EMPLOYEE 448  |   1.545999   1.990932     0.78   0.437    -2.356216    5.448213
    EMPLOYEE 450  |   1.110291   1.169023     0.95   0.342    -1.180986    3.401569
    EMPLOYEE 451  |   1.690519   1.953499     0.87   0.387    -2.138327    5.519366
    EMPLOYEE 452  |   1.471413   1.890042     0.78   0.436    -2.233058    5.175883
    EMPLOYEE 453  |    2.45562   2.292916     1.07   0.284    -2.038481    6.949721
    EMPLOYEE 454  |   .2987301   1.018474     0.29   0.769    -1.697473    2.294933
    EMPLOYEE 455  |   1.898569   1.835261     1.03   0.301    -1.698532    5.495669
    EMPLOYEE 456  |   .4014889   .7091784     0.57   0.571    -.9884963    1.791474
    EMPLOYEE 457  |   .5925225   .6655283     0.89   0.373    -.7119089    1.896954
    EMPLOYEE 458  |   2.337191   2.551394     0.92   0.360    -2.663525    7.337908
    EMPLOYEE 459  |   2.715028   1.995601     1.36   0.174    -1.196337    6.626393
     EMPLOYEE 46  |   1.212741    1.14611     1.06   0.290    -1.033627    3.459109
    EMPLOYEE 460  |   .3092915   1.314621     0.24   0.814    -2.267359    2.885942
    EMPLOYEE 461  |   .3979809   1.212724     0.33   0.743     -1.97895    2.774912
    EMPLOYEE 462  |   1.183226    1.37105     0.86   0.388    -1.504023    3.870474
    EMPLOYEE 463  |   .3018079    .843448     0.36   0.720    -1.351345    1.954961
    EMPLOYEE 464  |    2.29001   2.606277     0.88   0.380    -2.818278    7.398298
    EMPLOYEE 465  |   1.131783    1.22671     0.92   0.356    -1.272562    3.536128
    EMPLOYEE 467  |   1.216173   1.789694     0.68   0.497    -2.291615    4.723962
    EMPLOYEE 468  |   2.808999   1.484897     1.89   0.059    -.1013899    5.719388
    EMPLOYEE 469  |   1.509884   2.020344     0.75   0.455    -2.449978    5.469747
     EMPLOYEE 47  |  -.1929218   .4500064    -0.43   0.668    -1.074932    .6890879
    EMPLOYEE 470  |   .5233593   .7063324     0.74   0.459    -.8610478    1.907766
    EMPLOYEE 471  |   1.104539    1.32143     0.84   0.403    -1.485456    3.694534
    EMPLOYEE 472  |   1.802485     1.6721     1.08   0.281    -1.474819     5.07979
    EMPLOYEE 474  |   1.622928   1.934732     0.84   0.402    -2.169135    5.414991
    EMPLOYEE 475  |   2.383608   2.651971     0.90   0.369    -2.814238    7.581455
    EMPLOYEE 476  |    2.30356   2.287378     1.01   0.314    -2.179687    6.786806
    EMPLOYEE 477  |   1.293975   1.111501     1.16   0.244     -.884561    3.472511
    EMPLOYEE 478  |   1.878974   1.977388     0.95   0.342    -1.996694    5.754642
    EMPLOYEE 479  |   .3287958   .4185893     0.79   0.432    -.4916367    1.149228
     EMPLOYEE 48  |   .0699576   .4719668     0.15   0.882    -.8550944    .9950096
    EMPLOYEE 480  |   1.848055   2.054107     0.90   0.368    -2.177982    5.874092
    EMPLOYEE 481  |    1.05013   2.097684     0.50   0.617    -3.061317    5.161577
    EMPLOYEE 482  |   1.859431   2.114631     0.88   0.379    -2.285232    6.004094
    EMPLOYEE 483  |   1.216992   1.904524     0.64   0.523    -2.515863    4.949848
    EMPLOYEE 484  |    1.83506   1.461694     1.26   0.209    -1.029851    4.699971
    EMPLOYEE 485  |  -.4060484   .4959201    -0.82   0.413    -1.378049    .5659519
    EMPLOYEE 486  |   2.109062   2.090126     1.01   0.313    -1.987572    6.205696
    EMPLOYEE 487  |   1.469697   2.139542     0.69   0.492    -2.723793    5.663187
    EMPLOYEE 488  |   .6713803    2.14345     0.31   0.754    -3.529768    4.872529
    EMPLOYEE 489  |   .4628849   1.192322     0.39   0.698    -1.874058    2.799828
     EMPLOYEE 49  |    .223802   .6871178     0.33   0.745    -1.122945    1.570549
    EMPLOYEE 490  |   .9986548    1.85983     0.54   0.591      -2.6466    4.643909
    EMPLOYEE 491  |   1.870355   2.007309     0.93   0.351    -2.063958    5.804668
    EMPLOYEE 492  |   .4603663   .8529199     0.54   0.589    -1.211351    2.132084
    EMPLOYEE 493  |  -.0684528   .6910776    -0.10   0.921    -1.422961    1.286055
    EMPLOYEE 494  |   1.752915   1.971952     0.89   0.374    -2.112099    5.617929
    EMPLOYEE 495  |   1.433853   1.585271     0.90   0.366    -1.673269    4.540974
    EMPLOYEE 496  |   1.560018   1.976295     0.79   0.430    -2.313509    5.433545
    EMPLOYEE 498  |   1.740583   2.066572     0.84   0.400    -2.309885    5.791051
    EMPLOYEE 499  |   2.099768    2.20142     0.95   0.340       -2.215    6.414537
      EMPLOYEE 5  |  -.6571226   .5098406    -1.29   0.197    -1.656407    .3421619
    EMPLOYEE 500  |   .4448142   .4426854     1.00   0.315    -.4228466    1.312475
    EMPLOYEE 501  |   2.598415    2.05486     1.26   0.206    -1.429097    6.625928
    EMPLOYEE 502  |  -.5974409   .7305479    -0.82   0.413     -2.02931    .8344286
    EMPLOYEE 503  |  -.4627915   2.148975    -0.22   0.829    -4.674769    3.749186
    EMPLOYEE 504  |   1.824559   1.768939     1.03   0.302    -1.642551     5.29167
    EMPLOYEE 505  |   1.590035   1.533804     1.04   0.300     -1.41621    4.596281
    EMPLOYEE 506  |   1.622919   2.128663     0.76   0.446    -2.549247    5.795086
    EMPLOYEE 507  |   -.378377   .6903395    -0.55   0.584    -1.731438    .9746843
    EMPLOYEE 508  |   1.703854   1.916139     0.89   0.374    -2.051767    5.459476
    EMPLOYEE 509  |   .4447569   .6151524     0.72   0.470     -.760938    1.650452
     EMPLOYEE 51  |  -.4949973   .6002196    -0.82   0.410    -1.671424    .6814293
    EMPLOYEE 510  |   1.763681   1.999714     0.88   0.378    -2.155747    5.683109
    EMPLOYEE 511  |   .5208935   .3574721     1.46   0.145    -.1797497    1.221537
    EMPLOYEE 512  |   1.464399    1.47103     1.00   0.319    -1.418811     4.34761
    EMPLOYEE 513  |   2.246323   2.157828     1.04   0.298    -1.983008    6.475653
    EMPLOYEE 514  |   1.509965   1.618716     0.93   0.351     -1.66271    4.682639
    EMPLOYEE 515  |   1.121531    1.48743     0.75   0.451    -1.793822    4.036885
    EMPLOYEE 516  |   1.063503   1.355639     0.78   0.433    -1.593542    3.720548
    EMPLOYEE 517  |   2.171433   2.198522     0.99   0.323    -2.137657    6.480522
    EMPLOYEE 518  |   1.363256   1.654836     0.82   0.410    -1.880212    4.606725
    EMPLOYEE 519  |   1.326756   1.265621     1.05   0.295    -1.153854    3.807367
    EMPLOYEE 520  |   1.153028   1.578867     0.73   0.465    -1.941541    4.247597
    EMPLOYEE 521  |   1.548381   2.357074     0.66   0.511    -3.071469    6.168231
    EMPLOYEE 522  |   .6423119   .5719271     1.12   0.261    -.4786616    1.763285
    EMPLOYEE 525  |   .2428905    .672276     0.36   0.718    -1.074766    1.560547
    EMPLOYEE 526  |   6.253122   3.019333     2.07   0.038     .3352479      12.171
    EMPLOYEE 528  |   1.510971   .7956012     1.90   0.058    -.0484025    3.070344
    EMPLOYEE 529  |   .5342803   .4481506     1.19   0.233    -.3440921    1.412653
    EMPLOYEE 530  |   .9121199   .4612588     1.98   0.048     .0080555    1.816184
    EMPLOYEE 532  |   2.095065   1.473517     1.42   0.155    -.7930187     4.98315
    EMPLOYEE 533  |    2.45774   2.323235     1.06   0.290    -2.095787    7.011267
    EMPLOYEE 534  |     2.0852    2.66553     0.78   0.434    -3.139222    7.309622
    EMPLOYEE 535  |   3.122561   2.773317     1.13   0.260    -2.313123    8.558245
    EMPLOYEE 536  |   2.890187   2.547781     1.13   0.257    -2.103449    7.883823
    EMPLOYEE 537  |   1.556344   .6538086     2.38   0.017     .2748828    2.837804
    EMPLOYEE 538  |   2.553736   2.487263     1.03   0.305    -2.321284    7.428757
    EMPLOYEE 539  |   1.230227   1.372108     0.90   0.370    -1.459095     3.91955
     EMPLOYEE 54  |   -1.08449   .5104753    -2.12   0.034    -2.085018   -.0839612
    EMPLOYEE 540  |   .6037752   .6862267     0.88   0.379    -.7412249    1.948775
    EMPLOYEE 541  |   1.502582   .9686606     1.55   0.121    -.3959863    3.401151
    EMPLOYEE 543  |   1.882832   1.347549     1.40   0.162    -.7583559    4.524019
    EMPLOYEE 544  |   3.177321   2.530037     1.26   0.209    -1.781537    8.136178
    EMPLOYEE 547  |   1.148968   .5360652     2.14   0.032     .0982839    2.199653
     EMPLOYEE 55  |  -.2649871   .4842021    -0.55   0.584     -1.21402    .6840461
    EMPLOYEE 550  |   3.020513   2.710329     1.11   0.265    -2.291715     8.33274
    EMPLOYEE 551  |   3.945994    3.05098     1.29   0.196    -2.033908    9.925896
    EMPLOYEE 552  |   2.906368   2.695847     1.08   0.281    -2.377476    8.190213
    EMPLOYEE 553  |   1.800325    1.38278     1.30   0.193    -.9099141    4.510565
    EMPLOYEE 554  |   2.077594   2.006847     1.04   0.301    -1.855815    6.011002
    EMPLOYEE 555  |   2.254658   2.137101     1.06   0.291    -1.934046    6.443362
    EMPLOYEE 557  |   2.313762    1.89246     1.22   0.221    -1.395448    6.022972
    EMPLOYEE 559  |   .0990145   1.249334     0.08   0.937    -2.349673    2.547702
     EMPLOYEE 56  |   .4226392    .966195     0.44   0.662    -1.471097    2.316375
    EMPLOYEE 562  |    .767199   1.559409     0.49   0.623    -2.289234    3.823632
    EMPLOYEE 563  |  -.2578034   1.660737    -0.16   0.877    -3.512837    2.997231
    EMPLOYEE 565  |   3.284032   2.737132     1.20   0.230    -2.080731    8.648795
    EMPLOYEE 566  |   3.628985   2.522174     1.44   0.150    -1.314461    8.572432
    EMPLOYEE 567  |   2.421985   2.099712     1.15   0.249    -1.693438    6.537408
    EMPLOYEE 570  |   2.512711   2.398292     1.05   0.295    -2.187926    7.213349
    EMPLOYEE 571  |   1.172591   1.137741     1.03   0.303    -1.057375    3.402557
    EMPLOYEE 572  |   3.352299   2.639112     1.27   0.204    -1.820343    8.524942
    EMPLOYEE 574  |   2.368911   1.557255     1.52   0.128     -.683299    5.421121
    EMPLOYEE 575  |   2.229995   1.017982     2.19   0.028     .2347572    4.225233
    EMPLOYEE 576  |   2.340275   1.435744     1.63   0.103    -.4737753    5.154325
    EMPLOYEE 577  |   2.914712   2.457477     1.19   0.236    -1.901927    7.731351
    EMPLOYEE 578  |   3.465925   2.488547     1.39   0.164    -1.411612    8.343461
    EMPLOYEE 579  |   3.812549   2.832611     1.35   0.178    -1.739351    9.364449
     EMPLOYEE 58  |   .7052883   .9273356     0.76   0.447    -1.112284     2.52286
    EMPLOYEE 581  |   2.605671    2.67534     0.97   0.330    -2.637979    7.849322
    EMPLOYEE 585  |   2.490842   1.796114     1.39   0.166    -1.029531    6.011215
    EMPLOYEE 586  |   5.482845   2.869151     1.91   0.056    -.1406737    11.10636
    EMPLOYEE 587  |   5.646915   2.944096     1.92   0.055    -.1234954    11.41733
    EMPLOYEE 588  |  -2.243314   1.064879    -2.11   0.035    -4.330469   -.1561578
    EMPLOYEE 589  |   1.665313   1.176441     1.42   0.157     -.640505    3.971131
     EMPLOYEE 59  |   .1049753   .5536735     0.19   0.850    -.9802214    1.190172
    EMPLOYEE 590  |   1.295957   .5188592     2.50   0.013     .2789966    2.312918
    EMPLOYEE 592  |   2.456007   1.890425     1.30   0.194    -1.249214    6.161228
    EMPLOYEE 596  |   2.524801   2.201209     1.15   0.251    -1.789556    6.839157
     EMPLOYEE 60  |   .1486804   .4107825     0.36   0.717    -.6564508    .9538117
    EMPLOYEE 601  |   .5228062   .6535852     0.80   0.424    -.7582167    1.803829
    EMPLOYEE 602  |   3.597304   2.590577     1.39   0.165     -1.48021    8.674818
    EMPLOYEE 605  |   6.169811   2.916389     2.12   0.034     .4537063    11.88592
    EMPLOYEE 607  |    .255234   .5310121     0.48   0.631    -.7855464    1.296014
     EMPLOYEE 61  |  -1.545887   .4843503    -3.19   0.001     -2.49521   -.5965633
    EMPLOYEE 613  |  -.3428789   2.825787    -0.12   0.903    -5.881403    5.195646
    EMPLOYEE 615  |   6.022157   2.651949     2.27   0.023     .8243541    11.21996
    EMPLOYEE 616  |   3.458979   2.537516     1.36   0.173    -1.514536    8.432494
    EMPLOYEE 628  |   2.953488   2.191332     1.35   0.178    -1.341509    7.248485
    EMPLOYEE 629  |   2.637105   1.598544     1.65   0.099    -.4960319    5.770241
     EMPLOYEE 63  |   .1965313   .4427816     0.44   0.657    -.6713179     1.06438
    EMPLOYEE 632  |   4.828385    2.58388     1.87   0.062     -.236004    9.892774
    EMPLOYEE 633  |   4.621281   3.072508     1.50   0.133    -1.400816    10.64338
     EMPLOYEE 64  |   .2922144   .3528163     0.83   0.408    -.3993033    .9837322
    EMPLOYEE 641  |   3.160946   1.183363     2.67   0.008     .8415629     5.48033
    EMPLOYEE 646  |   3.485611   3.132324     1.11   0.266    -2.653725    9.624948
    EMPLOYEE 647  |   3.638773   2.922968     1.24   0.213    -2.090226    9.367771
     EMPLOYEE 65  |  -.1631554   .3954409    -0.41   0.680    -.9382171    .6119063
    EMPLOYEE 650  |   3.233556   2.443674     1.32   0.186     -1.55603    8.023143
    EMPLOYEE 655  |   3.157683   3.145513     1.00   0.315    -3.007502    9.322869
    EMPLOYEE 656  |   3.104351   2.330277     1.33   0.183    -1.462978    7.671681
    EMPLOYEE 658  |   6.212475   2.980218     2.08   0.037      .371267    12.05368
     EMPLOYEE 66  |   1.006631    1.50482     0.67   0.504    -1.942807     3.95607
    EMPLOYEE 662  |  -2.014007   1.226713    -1.64   0.101    -4.418357    .3903425
    EMPLOYEE 664  |   2.034444   1.866165     1.09   0.276    -1.623227    5.692116
    EMPLOYEE 665  |     1.6463    1.54479     1.07   0.287    -1.381479    4.674078
    EMPLOYEE 666  |   -.527942   2.634449    -0.20   0.841    -5.691446    4.635562
    EMPLOYEE 667  |  -.3627311   2.663353    -0.14   0.892    -5.582886    4.857424
    EMPLOYEE 668  |   1.352707    1.52421     0.89   0.375    -1.634736     4.34015
    EMPLOYEE 675  |    .619806   1.425689     0.43   0.664    -2.174535    3.414147
    EMPLOYEE 678  |  -.0718323   2.743789    -0.03   0.979    -5.449641    5.305977
    EMPLOYEE 679  |   3.476078   2.524121     1.38   0.168    -1.471182    8.423339
     EMPLOYEE 68  |   .5979274   1.071925     0.56   0.577    -1.503038    2.698893
    EMPLOYEE 683  |   .7826209   1.573693     0.50   0.619    -2.301807    3.867049
    EMPLOYEE 684  |  -2.368332   1.069518    -2.21   0.027    -4.464581    -.272082
    EMPLOYEE 687  |  -.2851686   2.843949    -0.10   0.920    -5.859292    5.288955
    EMPLOYEE 688  |    2.25377   3.057262     0.74   0.461    -3.738445    8.245985
     EMPLOYEE 69  |   1.076303   1.207319     0.89   0.373    -1.290036    3.442641
    EMPLOYEE 690  |   4.891842   2.649421     1.85   0.065    -.3010067    10.08469
    EMPLOYEE 691  |   3.156188   1.416062     2.23   0.026     .3807153    5.931662
      EMPLOYEE 7  |   .1121263   .9243689     0.12   0.903    -1.699631    1.923884
     EMPLOYEE 70  |  -1.863291   1.344735    -1.39   0.166    -4.498964    .7723814
     EMPLOYEE 71  |   .5379938   .9118765     0.59   0.555    -1.249279    2.325266
    EMPLOYEE 714  |   4.029535    2.50762     1.61   0.108    -.8853845    8.944454
    EMPLOYEE 716  |   1.744786   2.519091     0.69   0.489    -3.192617    6.682188
    EMPLOYEE 717  |   3.381499   2.804936     1.21   0.228    -2.116159    8.879157
     EMPLOYEE 72  |   .1486427   .6412471     0.23   0.817    -1.108198    1.405483
    EMPLOYEE 722  |   3.021043   1.539098     1.96   0.050     .0044198    6.037665
    EMPLOYEE 725  |   3.249275   2.671043     1.22   0.224    -1.985952    8.484502
    EMPLOYEE 726  |   3.546567   3.128204     1.13   0.257    -2.584694    9.677828
    EMPLOYEE 729  |   3.796626   3.231079     1.18   0.240    -2.536268    10.12952
     EMPLOYEE 73  |   .5547224   .8694219     0.64   0.523    -1.149339    2.258784
    EMPLOYEE 733  |   2.655215   2.762283     0.96   0.336    -2.758843    8.069273
    EMPLOYEE 735  |   2.023897   2.805254     0.72   0.471    -3.474384    7.522178
     EMPLOYEE 76  |   .3549433   .6823012     0.52   0.603    -.9823629    1.692249
     EMPLOYEE 79  |  -.3874147   .5087535    -0.76   0.446    -1.384568     .609739
      EMPLOYEE 8  |   -.383441    .438449    -0.87   0.382    -1.242798    .4759163
     EMPLOYEE 80  |   -.322547   .3607933    -0.89   0.371      -1.0297    .3846057
     EMPLOYEE 81  |  -.1796549   .8467254    -0.21   0.832    -1.839231    1.479922
     EMPLOYEE 83  |  -.1867324   .4955804    -0.38   0.706    -1.158067    .7846021
     EMPLOYEE 84  |  -.2945767   1.325122    -0.22   0.824    -2.891807    2.302654
     EMPLOYEE 85  |   .4600815   .9581153     0.48   0.631    -1.417819    2.337982
     EMPLOYEE 87  |  -.3737769   .4332438    -0.86   0.388    -1.222932    .4753783
     EMPLOYEE 88  |   .2927604   .5134156     0.57   0.569    -.7135311    1.299052
     EMPLOYEE 89  |  -.1841699   .4804129    -0.38   0.701    -1.125776    .7574364
      EMPLOYEE 9  |   .0364967   .4918965     0.07   0.941    -.9276174    1.000611
     EMPLOYEE 90  |  -.9009766   .7955581    -1.13   0.257    -2.460266    .6583125
     EMPLOYEE 91  |    .414655   1.281626     0.32   0.746    -2.097323    2.926633
     EMPLOYEE 92  |   1.146892   1.349864     0.85   0.396    -1.498834    3.792617
     EMPLOYEE 93  |  -.1937393   1.004285    -0.19   0.847    -2.162132    1.774654
     EMPLOYEE 94  |   1.216624   1.217612     1.00   0.318    -1.169888    3.603136
     EMPLOYEE 95  |  -.3300988   .8190197    -0.40   0.687    -1.935372    1.275175
     EMPLOYEE 96  |  -.6414246   .6854411    -0.94   0.349    -1.984885    .7020357
     EMPLOYEE 97  |   .2163061   .4226444     0.51   0.609    -.6120743    1.044686
     EMPLOYEE 99  |          0  (omitted)
                  |
            _cons |  -2.771382   5.561541    -0.50   0.618    -13.67197    8.129204
-----------------------------------------------------------------------------------

. predict res_leave, resid

. reg work i.analysis_workdate i.grouped_div  an_age max_rate i.empid
note: 726.empid omitted because of collinearity.

      Source |       SS           df       MS      Number of obs   =    80,223
-------------+----------------------------------   F(762, 79460)   =     33.09
       Model |  2864.28436       762  3.75890335   Prob > F        =    0.0000
    Residual |  9026.38528    79,460  .113596593   R-squared       =    0.2409
-------------+----------------------------------   Adj R-squared   =    0.2336
       Total |  11890.6696    80,222  .148222054   Root MSE        =    .33704

-----------------------------------------------------------------------------------
             work | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
------------------+----------------------------------------------------------------
analysis_workdate |
           20094  |   .0871868   .0242857     3.59   0.000     .0395871    .1347865
           20095  |   .0811891   .0245011     3.31   0.001     .0331671    .1292112
           20097  |   .0041019   .0243792     0.17   0.866    -.0436812     .051885
           20098  |   -.461774   .0232187   -19.89   0.000    -.5072824   -.4162656
           20100  |  -.0009426   .0239776    -0.04   0.969    -.0479385    .0460532
           20102  |   .0655102   .0240603     2.72   0.006     .0183523    .1126682
           20104  |   .0008712   .0241749     0.04   0.971    -.0465114    .0482537
           20105  |  -.4826264    .023254   -20.75   0.000    -.5282041   -.4370487
           20110  |   .0301972   .0241485     1.25   0.211    -.0171338    .0775281
           20114  |    .012667   .0240267     0.53   0.598    -.0344252    .0597591
           20117  |   .0697913   .0242254     2.88   0.004     .0223097    .1172729
           20124  |   .0846697   .0242177     3.50   0.000     .0372031    .1321363
           20125  |  -.0303409   .0241355    -1.26   0.209    -.0776462    .0169645
           20127  |  -.4950626   .0232433   -21.30   0.000    -.5406193   -.4495059
           20131  |     .05388   .0244421     2.20   0.027     .0059736    .1017864
           20136  |   .0489327   .0243391     2.01   0.044     .0012282    .0966372
           20137  |   .0254319   .0243406     1.04   0.296    -.0222756    .0731393
           20138  |    .053937   .0243884     2.21   0.027     .0061358    .1017381
           20139  |   .0134792   .0244064     0.55   0.581    -.0343573    .0613157
           20141  |  -.5132783   .0232491   -22.08   0.000    -.5588464   -.4677103
           20145  |   .0634824   .0243504     2.61   0.009     .0157557    .1112091
           20151  |   .0757085   .0241031     3.14   0.002     .0284664    .1229505
           20152  |   .0724072   .0242462     2.99   0.003     .0248848    .1199297
           20163  |   .0301045   .0243168     1.24   0.216    -.0175563    .0777653
           20164  |   .0990344   .0242608     4.08   0.000     .0514835    .1465854
           20166  |   .0543395    .024472     2.22   0.026     .0063745    .1023046
           20167  |   .0097794   .0244295     0.40   0.689    -.0381022    .0576609
           20170  |   .0017967   .0246188     0.07   0.942     -.046456    .0500495
           20172  |   .0908436   .0245785     3.70   0.000       .04267    .1390173
           20173  |   .0750889    .024549     3.06   0.002      .026973    .1232049
           20180  |   .0040615   .0249098     0.16   0.870    -.0447614    .0528845
           20184  |   .0081948   .0246873     0.33   0.740    -.0401922    .0565818
           20185  |   .0483049   .0247247     1.95   0.051    -.0001553    .0967652
           20186  |   .0571919   .0246479     2.32   0.020     .0088821    .1055017
           20191  |   .0057293   .0243359     0.24   0.814    -.0419689    .0534274
           20192  |   .1072675   .0243155     4.41   0.000     .0596092    .1549258
           20194  |   .0713608   .0244647     2.92   0.004     .0234101    .1193116
           20200  |    .068032   .0243857     2.79   0.005     .0202362    .1158279
           20203  |  -.3977466   .0235617   -16.88   0.000    -.4439275   -.3515658
           20207  |   .0593713   .0243496     2.44   0.015     .0116461    .1070964
           20209  |   .0258448   .0243707     1.06   0.289    -.0219216    .0736113
           20215  |   .0528168   .0244967     2.16   0.031     .0048035    .1008301
           20222  |   .0589591   .0245081     2.41   0.016     .0109234    .1069948
           20223  |   .0316014   .0246607     1.28   0.200    -.0167333    .0799362
           20234  |   .0438392   .0245803     1.78   0.075     -.004338    .0920165
           20235  |  -.0027017   .0247318    -0.11   0.913    -.0511759    .0457725
           20236  |   .0029162   .0247995     0.12   0.906    -.0456906     .051523
           20240  |  -.0068237   .0245678    -0.28   0.781    -.0549765    .0413291
           20242  |   .0335695   .0247502     1.36   0.175    -.0149408    .0820798
           20247  |   .0130106   .0244385     0.53   0.594    -.0348887    .0609099
           20248  |   .0906201   .0245755     3.69   0.000     .0424523    .1387878
           20254  |    -.01155   .0248023    -0.47   0.641    -.0601624    .0370623
           20255  |   .0852001   .0248071     3.43   0.001     .0365784    .1338219
           20257  |   .0605279   .0246985     2.45   0.014      .012119    .1089368
           20258  |  -.0012132   .0247509    -0.05   0.961    -.0497248    .0472983
           20262  |   .0672886   .0248841     2.70   0.007      .018516    .1160612
           20263  |   .0546105   .0249005     2.19   0.028     .0058056    .1034154
           20268  |    .029072   .0248414     1.17   0.242     -.019617     .077761
           20269  |   .0849401   .0247151     3.44   0.001     .0364987    .1333815
           20275  |  -.0077265   .0248006    -0.31   0.755    -.0563356    .0408826
           20276  |   .0969685   .0248395     3.90   0.000     .0482833    .1456538
           20277  |   .0489198   .0248131     1.97   0.049     .0002863    .0975533
           20278  |   .0900242   .0248018     3.63   0.000     .0414129    .1386355
           20283  |   .0808808   .0248228     3.26   0.001     .0322282    .1295334
           20285  |   .0752885    .024979     3.01   0.003     .0263299    .1242471
           20286  |  -.0135791   .0250292    -0.54   0.587    -.0626363     .035478
           20288  |  -.6351628   .0238737   -26.61   0.000    -.6819551   -.5883705
           20289  |  -.0136576   .0250841    -0.54   0.586    -.0628224    .0355071
           20290  |   .0819131   .0250116     3.28   0.001     .0328905    .1309358
           20291  |   .0594196   .0249741     2.38   0.017     .0104706    .1083687
           20292  |   .0831201   .0251452     3.31   0.001     .0338357    .1324045
           20293  |   .0060434   .0251874     0.24   0.810    -.0433238    .0554106
           20296  |  -.0136516   .0250368    -0.55   0.586    -.0627235    .0354203
           20297  |   .0761466    .025015     3.04   0.002     .0271173    .1251759
           20298  |   .0575548   .0251102     2.29   0.022     .0083389    .1067707
           20304  |   .1027402   .0251899     4.08   0.000     .0533682    .1521122
           20312  |   .0482429   .0249641     1.93   0.053    -.0006865    .0971723
           20317  |  -.0287895   .0250707    -1.15   0.251    -.0779278    .0203489
           20322  |  -.4304986   .0241858   -17.80   0.000    -.4779027   -.3830945
           20326  |   .0861868   .0250521     3.44   0.001     .0370849    .1352888
           20332  |    .083007   .0251238     3.30   0.001     .0337646    .1322494
           20333  |   .0760944   .0251299     3.03   0.002     .0268399    .1253488
           20339  |   .0619567   .0252029     2.46   0.014     .0125591    .1113544
           20341  |   .0481559   .0251881     1.91   0.056    -.0012127    .0975245
           20345  |  -.0011112   .0251003    -0.04   0.965    -.0503075    .0480851
           20352  |  -.0197515   .0254043    -0.78   0.437    -.0695437    .0300408
           20353  |   .0902994   .0253571     3.56   0.000     .0405996    .1399993
           20355  |   .0639165   .0254134     2.52   0.012     .0141064    .1137266
           20358  |  -.5561351   .0244183   -22.78   0.000    -.6039949   -.5082753
           20359  |  -.0013481    .025267    -0.05   0.957    -.0508713    .0481751
           20367  |   .1084818   .0253183     4.28   0.000      .058858    .1581055
           20368  |    .098399   .0253933     3.88   0.000     .0486284    .1481697
           20371  |  -.4028867   .0246119   -16.37   0.000    -.4511258   -.3546475
           20377  |  -.0272378   .0253884    -1.07   0.283    -.0769988    .0225233
           20381  |   .1061456   .0254153     4.18   0.000     .0563318    .1559594
           20382  |   .0723479    .025505     2.84   0.005     .0223582    .1223376
           20383  |   .0786387   .0255694     3.08   0.002     .0285229    .1287545
           20384  |    .005188   .0254278     0.20   0.838    -.0446503    .0550264
           20388  |   .0965541   .0254882     3.79   0.000     .0465973    .1465109
           20390  |   .0931498   .0256126     3.64   0.000     .0429492    .1433503
           20391  |  -.0198201   .0253847    -0.78   0.435    -.0695739    .0299338
           20394  |  -.0036786   .0254291    -0.14   0.885    -.0535195    .0461623
           20398  |   .0031219   .0252217     0.12   0.901    -.0463124    .0525562
           20406  |  -.3686442   .0248608   -14.83   0.000    -.4173711   -.3199173
           20409  |   .0723905   .0258368     2.80   0.005     .0217506    .1230303
           20412  |  -.0136175    .025825    -0.53   0.598    -.0642343    .0369992
           20415  |  -.0768623   .0257655    -2.98   0.003    -.1273625   -.0263621
           20417  |  -.0921735   .0258811    -3.56   0.000    -.1429003   -.0414467
           20418  |   .1680308    .025113     6.69   0.000     .1188094    .2172522
           20421  |   -.455384   .0249903   -18.22   0.000    -.5043648   -.4064032
           20424  |   .0266303   .0261946     1.02   0.309    -.0247109    .0779715
           20426  |  -.0577498   .0260339    -2.22   0.027    -.1087761   -.0067234
           20431  |   .0346773   .0261329     1.33   0.185    -.0165429    .0858976
           20436  |  -.0164155   .0259607    -0.63   0.527    -.0672984    .0344673
           20437  |     .06549   .0262859     2.49   0.013     .0139697    .1170102
           20438  |    .046928   .0261017     1.80   0.072    -.0042311    .0980871
           20439  |   .0538194   .0262641     2.05   0.040     .0023419    .1052969
           20445  |   .0476908   .0264538     1.80   0.071    -.0041584      .09954
           20448  |  -.4709205   .0252997   -18.61   0.000    -.5205077   -.4213334
           20451  |   .0548406   .0266966     2.05   0.040     .0025154    .1071657
           20457  |  -.0128874   .0264509    -0.49   0.626     -.064731    .0389562
           20459  |   .0503102   .0267433     1.88   0.060    -.0021066     .102727
           20460  |   .0737941   .0264868     2.79   0.005     .0218803     .125708
           20461  |   .0147165   .0265386     0.55   0.579     -.037299     .066732
           20462  |  -.4390443   .0255111   -17.21   0.000    -.4890458   -.3890428
           20465  |   .1099034    .026216     4.19   0.000     .0585203    .1612866
           20466  |   .0788507   .0261638     3.01   0.003     .0275697    .1301316
           20471  |   .1686518   .0256539     6.57   0.000     .1183703    .2189334
           20475  |  -.0345189   .0262564    -1.31   0.189    -.0859813    .0169435
           20479  |   .0909683   .0261171     3.48   0.000      .039779    .1421576
           20482  |  -.0160653   .0263078    -0.61   0.541    -.0676285    .0354979
           20489  |  -.0236293   .0264511    -0.89   0.372    -.0754732    .0282146
           20493  |   .1009144   .0266875     3.78   0.000      .048607    .1532218
           20494  |   .0718662   .0266102     2.70   0.007     .0197104     .124022
           20496  |  -.0048275   .0265653    -0.18   0.856    -.0568952    .0472402
           20500  |   .0585259    .026887     2.18   0.030     .0058275    .1112244
           20516  |   .0761362   .0266608     2.86   0.004     .0238813    .1283912
           20521  |   .0849725   .0269341     3.15   0.002     .0321818    .1377631
           20525  |  -.4110741   .0262421   -15.66   0.000    -.4625084   -.3596398
           20528  |   .0988535   .0269867     3.66   0.000     .0459597    .1517474
           20535  |   .0951268   .0273442     3.48   0.001     .0415322    .1487213
           20536  |   .0693854   .0274817     2.52   0.012     .0155215    .1232493
           20542  |   .0525577     .02743     1.92   0.055    -.0012049    .1063204
           20544  |   .0700422   .0275412     2.54   0.011     .0160616    .1240228
           20550  |   .0758215   .0272608     2.78   0.005     .0223906    .1292524
           20559  |   .0053733   .0272912     0.20   0.844    -.0481173    .0588638
           20560  |  -.4228274   .0267375   -15.81   0.000    -.4752326   -.3704221
           20562  |  -.0109906   .0274112    -0.40   0.688    -.0647164    .0427351
           20565  |   .0675741   .0274401     2.46   0.014     .0137917    .1213565
           20568  |  -.5400102   .0267212   -20.21   0.000    -.5923836   -.4876368
           20570  |   .1009092   .0274637     3.67   0.000     .0470804    .1547379
           20577  |   .0958184   .0275762     3.47   0.001     .0417691    .1498677
           20578  |   .0737217   .0277517     2.66   0.008     .0193286    .1281148
           20579  |   .0885696   .0277004     3.20   0.001      .034277    .1428623
           20582  |  -.6380319   .0269469   -23.68   0.000    -.6908476   -.5852162
           20584  |    .094577   .0277407     3.41   0.001     .0402053    .1489486
           20585  |   .0844701   .0276066     3.06   0.002     .0303614    .1385789
           20586  |   .0875318   .0278098     3.15   0.002     .0330247    .1420389
           20592  |   .1008366   .0279019     3.61   0.000     .0461489    .1555242
           20595  |  -.3570115   .0271996   -13.13   0.000    -.4103225   -.3037005
           20604  |   .1679801    .027535     6.10   0.000     .1140117    .2219484
           20605  |    .022187    .028109     0.79   0.430    -.0329064    .0772805
           20607  |     .04383   .0283603     1.55   0.122     -.011756     .099416
           20608  |  -.0496048   .0283502    -1.75   0.080     -.105171    .0059614
           20613  |    .072053   .0284313     2.53   0.011     .0163278    .1277782
           20614  |    .092765   .0285553     3.25   0.001     .0367967    .1487332
           20618  |  -.0006876   .0286559    -0.02   0.981    -.0568529    .0554778
           20619  |   .0920124   .0285897     3.22   0.001     .0359767    .1480481
           20621  |   .0580955   .0288348     2.01   0.044     .0015794    .1146115
           20622  |   .0008223   .0286999     0.03   0.977    -.0554294     .057074
           20623  |  -.4373902   .0276624   -15.81   0.000    -.4916084   -.3831721
           20628  |   .0561894   .0287859     1.95   0.051    -.0002308    .1126096
           20629  |   -.012203   .0288727    -0.42   0.673    -.0687934    .0443873
           20632  |  -.0112585   .0287321    -0.39   0.695    -.0675732    .0450563
           20639  |   .1675846   .0281418     5.95   0.000     .1124268    .2227424
           20643  |  -.0165167   .0291915    -0.57   0.572    -.0737318    .0406984
           20647  |   .0983146    .028771     3.42   0.001     .0419236    .1547056
           20648  |   .0680428   .0288673     2.36   0.018     .0114629    .1246226
           20653  |   .0087595   .0289009     0.30   0.762     -.047886     .065405
           20656  |   .0704839   .0289227     2.44   0.015     .0137955    .1271722
           20657  |   .0023948   .0289659     0.08   0.934    -.0543781    .0591677
           20661  |   .1036778   .0288244     3.60   0.000     .0471822    .1601734
           20664  |  -.0051352   .0288851    -0.18   0.859    -.0617499    .0514795
           20667  |  -.0065301   .0290174    -0.23   0.822     -.063404    .0503438
           20668  |   .0897215   .0288619     3.11   0.002     .0331523    .1462907
           20670  |   .0787021    .028947     2.72   0.007      .021966    .1354381
           20671  |   .0038078   .0288973     0.13   0.895    -.0528307    .0604463
           20675  |   .0923563   .0289606     3.19   0.001     .0355936     .149119
           20677  |   .0839202   .0291401     2.88   0.004     .0268058    .1410345
           20678  |  -.0123116     .02914    -0.42   0.673    -.0694257    .0448026
           20684  |   .1073415   .0292737     3.67   0.000     .0499652    .1647178
           20690  |   .0413721   .0292094     1.42   0.157    -.0158782    .0986224
           20692  |  -.0219855   .0291693    -0.75   0.451    -.0791572    .0351862
           20695  |  -.0077686   .0293172    -0.26   0.791    -.0652301    .0496929
           20697  |    .078259   .0292774     2.67   0.008     .0208754    .1356426
                  |
      grouped_div |
             803  |  -.0185403   .0362709    -0.51   0.609    -.0896311    .0525505
             804  |   .0040652   .0371601     0.11   0.913    -.0687683    .0768988
             805  |  -.0045311   .0432281    -0.10   0.917    -.0892579    .0801957
             806  |  -.0133185   .0330482    -0.40   0.687    -.0780927    .0514557
             807  |  -.0555791   .0343636    -1.62   0.106    -.1229315    .0117733
             808  |   .3853332   .0626152     6.15   0.000     .2626079    .5080586
             809  |  -.0304011   .0293301    -1.04   0.300    -.0878879    .0270857
             810  |  -.0392291   .0367881    -1.07   0.286    -.1113336    .0328754
             811  |  -.1505147    .035282    -4.27   0.000    -.2196671   -.0813623
             812  |   .0460909   .0322317     1.43   0.153     -.017083    .1092648
             814  |   .0427006   .0294069     1.45   0.146    -.0149367    .1003379
             816  |   .0643217   .0348928     1.84   0.065    -.0040678    .1327113
             818  |   .0441356   .0298676     1.48   0.139    -.0144046    .1026759
             819  |   .0681689   .0328345     2.08   0.038     .0038134    .1325244
             824  |   .0401088   .0365053     1.10   0.272    -.0314414     .111659
             828  |   .0737058   .0430724     1.71   0.087    -.0107159    .1581274
             999  |  -.0822991   .0404655    -2.03   0.042    -.1616114   -.0029869
                  |
           an_age |  -.0092943   .0100686    -0.92   0.356    -.0290287      .01044
         max_rate |   .0375548   .0029303    12.82   0.000     .0318114    .0432983
                  |
            empid |
     EMPLOYEE 10  |   .1088489   .1288825     0.84   0.398      -.14376    .3614579
    EMPLOYEE 100  |  -.0784073   .0954682    -0.82   0.411    -.2655244    .1087099
    EMPLOYEE 101  |    .004345   .0544196     0.08   0.936    -.1023171     .111007
    EMPLOYEE 102  |  -.0971373   .1255352    -0.77   0.439    -.3431854    .1489109
    EMPLOYEE 103  |  -.0028515    .044808    -0.06   0.949    -.0906748    .0849719
    EMPLOYEE 104  |  -.0270986   .0805713    -0.34   0.737    -.1850179    .1308207
    EMPLOYEE 105  |   -.021234   .0968974    -0.22   0.827    -.2111523    .1686843
    EMPLOYEE 106  |  -.0937127   .0979679    -0.96   0.339    -.2857293    .0983038
    EMPLOYEE 107  |   .0164697   .0703252     0.23   0.815    -.1213673    .1543067
    EMPLOYEE 108  |  -.1177137   .0776208    -1.52   0.129    -.2698499    .0344226
     EMPLOYEE 11  |     .07155   .0706771     1.01   0.311    -.0669766    .2100767
    EMPLOYEE 110  |   .0426368   .0926959     0.46   0.646    -.1390466    .2243203
    EMPLOYEE 111  |   .0441053   .0837377     0.53   0.598      -.12002    .2082306
    EMPLOYEE 112  |   .0687294   .0369249     1.86   0.063    -.0036432    .1411021
    EMPLOYEE 114  |  -.0447561   .0844984    -0.53   0.596    -.2103723    .1208602
    EMPLOYEE 116  |   .0212585   .0431534     0.49   0.622    -.0633219    .1058388
    EMPLOYEE 117  |  -.0117963   .1202327    -0.10   0.922    -.2474517     .223859
    EMPLOYEE 118  |  -.0276084   .0549343    -0.50   0.615    -.1352792    .0800625
    EMPLOYEE 119  |   .0328223   .0441349     0.74   0.457    -.0536818    .1193265
     EMPLOYEE 12  |   .0706376   .1100543     0.64   0.521    -.1450681    .2863433
    EMPLOYEE 120  |  -.1276535   .1025739    -1.24   0.213    -.3286977    .0733907
    EMPLOYEE 121  |   .1346954   .0611344     2.20   0.028     .0148724    .2545184
    EMPLOYEE 122  |  -.0619369   .1013659    -0.61   0.541    -.2606135    .1367397
    EMPLOYEE 123  |   .0788097   .0541416     1.46   0.146    -.0273076     .184927
    EMPLOYEE 124  |   .0058025   .0758837     0.08   0.939     -.142929     .154534
    EMPLOYEE 125  |  -.0139315   .0541686    -0.26   0.797    -.1201017    .0922387
    EMPLOYEE 126  |   -.000369   .0635716    -0.01   0.995     -.124969     .124231
    EMPLOYEE 127  |   .1127842   .0884324     1.28   0.202    -.0605426    .2861111
    EMPLOYEE 128  |   .0358887   .0593702     0.60   0.546    -.0804765    .1522539
    EMPLOYEE 129  |  -.0582339   .1299492    -0.45   0.654    -.3129336    .1964658
     EMPLOYEE 13  |  -.0106307   .0457798    -0.23   0.816    -.1003588    .0790975
    EMPLOYEE 130  |  -.1140881   .1574466    -0.72   0.469    -.4226824    .1945062
    EMPLOYEE 131  |  -.1205987   .1913712    -0.63   0.529     -.495685    .2544876
    EMPLOYEE 132  |   .0338885   .0570881     0.59   0.553    -.0780039    .1457809
    EMPLOYEE 133  |   .1085626   .1021964     1.06   0.288    -.0917416    .3088668
    EMPLOYEE 134  |  -.1012191   .0929561    -1.09   0.276    -.2834126    .0809743
    EMPLOYEE 136  |  -.0992257   .0751209    -1.32   0.187    -.2464622    .0480108
    EMPLOYEE 137  |   .0190649   .0458197     0.42   0.677    -.0707413    .1088712
    EMPLOYEE 138  |  -.0157343   .1258962    -0.12   0.901    -.2624902    .2310215
    EMPLOYEE 139  |   .0475959   .0561097     0.85   0.396    -.0623787    .1575705
     EMPLOYEE 14  |  -.0110833   .0421187    -0.26   0.792    -.0936357    .0714691
    EMPLOYEE 140  |  -.0386667   .0417278    -0.93   0.354     -.120453    .0431196
    EMPLOYEE 141  |     .04091   .0378277     1.08   0.279    -.0332321    .1150521
    EMPLOYEE 142  |   .0604374   .0448206     1.35   0.178    -.0274107    .1482856
    EMPLOYEE 143  |   .0653812   .0629123     1.04   0.299    -.0579265     .188689
    EMPLOYEE 144  |  -.0472931   .0580041    -0.82   0.415    -.1609808    .0663947
    EMPLOYEE 145  |    .134542   .0718101     1.87   0.061    -.0062053    .2752893
    EMPLOYEE 146  |  -.0627624   .1149326    -0.55   0.585    -.2880297    .1625048
    EMPLOYEE 148  |  -.0490604   .1457845    -0.34   0.736    -.3347971    .2366764
    EMPLOYEE 149  |  -.0440617   .0628412    -0.70   0.483    -.1672301    .0791066
     EMPLOYEE 15  |   .0337342   .0399738     0.84   0.399    -.0446142    .1120826
    EMPLOYEE 150  |  -.1857155   .0991541    -1.87   0.061     -.380057     .008626
    EMPLOYEE 154  |  -.1368441   .0623801    -2.19   0.028    -.2591088   -.0145795
    EMPLOYEE 155  |    .002368   .0638548     0.04   0.970    -.1227871    .1275231
    EMPLOYEE 156  |  -.0765616    .110233    -0.69   0.487    -.2926175    .1394944
    EMPLOYEE 157  |  -.1371569   .1316004    -1.04   0.297     -.395093    .1207791
    EMPLOYEE 158  |  -.0097801   .0347658    -0.28   0.778    -.0779209    .0583608
     EMPLOYEE 16  |    .014418   .0397873     0.36   0.717     -.063565    .0924009
    EMPLOYEE 160  |   .0147005   .0381015     0.39   0.700    -.0599782    .0893791
    EMPLOYEE 161  |  -.1664981   .1420991    -1.17   0.241    -.4450114    .1120152
    EMPLOYEE 162  |  -.0356138   .0843173    -0.42   0.673    -.2008752    .1296476
    EMPLOYEE 163  |  -.0409757   .0423264    -0.97   0.333    -.1239353    .0419838
    EMPLOYEE 164  |   .0710115   .0459449     1.55   0.122    -.0190403    .1610632
    EMPLOYEE 165  |  -.0947199    .110521    -0.86   0.391    -.3113403    .1219004
    EMPLOYEE 167  |  -.0687716   .0489708    -1.40   0.160     -.164754    .0272108
    EMPLOYEE 168  |  -.0201555   .0419049    -0.48   0.631    -.1022888    .0619778
    EMPLOYEE 169  |  -.0449781   .0529738    -0.85   0.396    -.1488064    .0588502
    EMPLOYEE 170  |  -.1479491   .1818073    -0.81   0.416    -.5042903    .2083922
    EMPLOYEE 171  |   -.095553   .1368757    -0.70   0.485    -.3638285    .1727226
    EMPLOYEE 172  |   .0001089    .047061     0.00   0.998    -.0921303    .0923481
    EMPLOYEE 174  |  -.0194896   .0334801    -0.58   0.560    -.0851103    .0461312
    EMPLOYEE 176  |   .0288933   .0789558     0.37   0.714    -.1258596    .1836462
    EMPLOYEE 177  |  -.1369874   .1288496    -1.06   0.288    -.3895318     .115557
    EMPLOYEE 178  |  -.0943166   .1574358    -0.60   0.549    -.4028899    .2142567
    EMPLOYEE 179  |   .0185116   .0465574     0.40   0.691    -.0727407    .1097638
    EMPLOYEE 180  |  -.0670205     .10505    -0.64   0.523    -.2729179    .1388768
    EMPLOYEE 181  |   .1452603   .0541026     2.68   0.007     .0392195     .251301
    EMPLOYEE 182  |   .1161742   .0890721     1.30   0.192    -.0584067     .290755
    EMPLOYEE 183  |   .0212291   .0544392     0.39   0.697    -.0854714    .1279295
    EMPLOYEE 184  |  -.0331543   .0503597    -0.66   0.510    -.1318591    .0655504
    EMPLOYEE 185  |   .0460394   .0514418     0.89   0.371    -.0547862    .1468649
    EMPLOYEE 186  |  -.1153421   .1767765    -0.65   0.514    -.4618229    .2311387
    EMPLOYEE 187  |  -.0106122   .0604445    -0.18   0.861    -.1290831    .1078588
    EMPLOYEE 188  |   .0839696   .1154733     0.73   0.467    -.1423575    .3102966
    EMPLOYEE 189  |   .0554915   .0676826     0.82   0.412     -.077166     .188149
     EMPLOYEE 19  |  -.0661521    .070098    -0.94   0.345    -.2035437    .0712395
    EMPLOYEE 190  |  -.0389367   .0637035    -0.61   0.541    -.1637951    .0859217
    EMPLOYEE 191  |   -.073979   .1618018    -0.46   0.648    -.3911095    .2431516
    EMPLOYEE 192  |  -.0669144   .1194389    -0.56   0.575    -.3010139    .1671852
    EMPLOYEE 193  |  -.0733661   .0928912    -0.79   0.430    -.2554323       .1087
    EMPLOYEE 194  |   .1867512   .0536954     3.48   0.001     .0815086    .2919938
    EMPLOYEE 195  |  -.0585355   .0443697    -1.32   0.187    -.1454998    .0284288
    EMPLOYEE 197  |  -.0293121   .0488653    -0.60   0.549    -.1250877    .0664635
    EMPLOYEE 198  |  -.1664428   .0505743    -3.29   0.001    -.2655682   -.0673174
    EMPLOYEE 199  |   .0427705   .0538091     0.79   0.427     -.062695     .148236
      EMPLOYEE 2  |   .0807431   .0515862     1.57   0.118    -.0203654    .1818517
     EMPLOYEE 20  |   .1114266   .1010842     1.10   0.270    -.0866978    .3095509
    EMPLOYEE 200  |   .3410982   .0676772     5.04   0.000     .2084513    .4737451
    EMPLOYEE 202  |   .0386248   .0762175     0.51   0.612    -.1107609    .1880106
    EMPLOYEE 203  |  -.0092344   .0486504    -0.19   0.849     -.104589    .0861201
    EMPLOYEE 204  |   -.020008   .0345676    -0.58   0.563    -.0877602    .0477443
    EMPLOYEE 205  |   .2273553   .1074772     2.12   0.034     .0167007    .4380099
    EMPLOYEE 206  |   -.101073   .1440848    -0.70   0.483    -.3834783    .1813323
    EMPLOYEE 207  |   .1259894   .0525324     2.40   0.016     .0230262    .2289526
    EMPLOYEE 208  |   .0415374   .0494062     0.84   0.400    -.0552984    .1383733
    EMPLOYEE 209  |  -.0818074   .0556564    -1.47   0.142    -.1908935    .0272788
     EMPLOYEE 21  |  -.3535954   .0844218    -4.19   0.000    -.5190616   -.1881291
    EMPLOYEE 210  |  -.1096589   .1127169    -0.97   0.331    -.3305834    .1112656
    EMPLOYEE 212  |   .0999782    .069773     1.43   0.152    -.0367765    .2367328
    EMPLOYEE 213  |  -.1889568   .1717625    -1.10   0.271    -.5256103    .1476967
    EMPLOYEE 214  |  -.1146832   .0988094    -1.16   0.246    -.3083489    .0789825
    EMPLOYEE 215  |   .0018097   .0679586     0.03   0.979    -.1313887    .1350081
    EMPLOYEE 216  |   .1195258   .0537615     2.22   0.026     .0141536     .224898
    EMPLOYEE 217  |  -.1767799    .069637    -2.54   0.011     -.313268   -.0402917
    EMPLOYEE 218  |   .0172042   .0684359     0.25   0.802    -.1169298    .1513381
     EMPLOYEE 22  |  -.0596422   .0529639    -1.13   0.260    -.1634512    .0441667
    EMPLOYEE 220  |  -.1143546   .1539041    -0.74   0.457    -.4160056    .1872963
    EMPLOYEE 223  |  -.0170804   .0832882    -0.21   0.838    -.1803247    .1461639
    EMPLOYEE 224  |  -.1152786   .0511003    -2.26   0.024    -.2154349   -.0151224
    EMPLOYEE 225  |  -.0375299   .0521475    -0.72   0.472    -.1397387    .0646789
    EMPLOYEE 226  |   .0024127    .056031     0.04   0.966    -.1074078    .1122331
    EMPLOYEE 227  |  -.0344315   .0513166    -0.67   0.502    -.1350116    .0661487
    EMPLOYEE 228  |  -.0579199   .1335251    -0.43   0.664    -.3196283    .2037885
     EMPLOYEE 23  |   .1099686   .0670785     1.64   0.101    -.0215048     .241442
    EMPLOYEE 230  |  -.0069692   .0472025    -0.15   0.883    -.0994859    .0855474
    EMPLOYEE 231  |   .0591584   .0944738     0.63   0.531    -.1260098    .2443265
    EMPLOYEE 232  |  -.0989456   .0990365    -1.00   0.318    -.2930565    .0951654
    EMPLOYEE 233  |   -.150438    .177416    -0.85   0.396    -.4981723    .1972963
    EMPLOYEE 235  |  -.0500592   .0692358    -0.72   0.470     -.185761    .0856427
    EMPLOYEE 237  |  -.0534244   .0643013    -0.83   0.406    -.1794545    .0726056
    EMPLOYEE 238  |    .021131   .0893018     0.24   0.813       -.1539    .1961619
    EMPLOYEE 239  |   .0753742   .0637678     1.18   0.237    -.0496102    .2003587
     EMPLOYEE 24  |  -.0189493   .0557624    -0.34   0.734    -.1282432    .0903446
    EMPLOYEE 240  |   .1650352   .0741032     2.23   0.026     .0197935    .3102769
    EMPLOYEE 241  |  -.1908476   .1132176    -1.69   0.092    -.4127534    .0310583
    EMPLOYEE 242  |   .0229323   .0431558     0.53   0.595    -.0616527    .1075173
    EMPLOYEE 243  |   .1132121   .0428704     2.64   0.008     .0291864    .1972379
    EMPLOYEE 244  |  -.1938733   .1167157    -1.66   0.097    -.4226353    .0348888
    EMPLOYEE 245  |   .0003057   .0609002     0.01   0.996    -.1190584    .1196698
    EMPLOYEE 246  |   .0459831    .095618     0.48   0.631    -.1414276    .2333938
    EMPLOYEE 247  |   .0603907   .0440637     1.37   0.171    -.0259738    .1467552
    EMPLOYEE 248  |   .0296016   .0495679     0.60   0.550    -.0675512    .1267543
    EMPLOYEE 249  |   .0550907   .0588151     0.94   0.349    -.0601865    .1703679
    EMPLOYEE 250  |   .0558102   .0500367     1.12   0.265    -.0422614    .1538817
    EMPLOYEE 251  |   .0356926   .0549617     0.65   0.516    -.0720321    .1434173
    EMPLOYEE 252  |  -.1832518    .140086    -1.31   0.191    -.4578194    .0913158
    EMPLOYEE 253  |   .0786298   .0914846     0.86   0.390    -.1006794     .257939
    EMPLOYEE 254  |   -.155847   .1704565    -0.91   0.361    -.4899407    .1782468
    EMPLOYEE 255  |  -.1297382   .1307997    -0.99   0.321    -.3861049    .1266285
    EMPLOYEE 256  |  -.0230812   .0516985    -0.45   0.655    -.1244099    .0782474
    EMPLOYEE 257  |  -.1428838   .1513302    -0.94   0.345    -.4394901    .1537225
    EMPLOYEE 258  |  -.1309507   .1423183    -0.92   0.358    -.4098936    .1479922
    EMPLOYEE 259  |  -.0550887   .1198474    -0.46   0.646    -.2899888    .1798113
     EMPLOYEE 26  |   .0376161   .1244702     0.30   0.762    -.2063448     .281577
    EMPLOYEE 260  |  -.1653002   .1362815    -1.21   0.225     -.432411    .1018107
    EMPLOYEE 261  |   .0708842    .072265     0.98   0.327    -.0707547    .2125231
    EMPLOYEE 262  |   .1072849   .0696214     1.54   0.123    -.0291725    .2437423
    EMPLOYEE 263  |   -.138565   .1414235    -0.98   0.327    -.4157543    .1386242
    EMPLOYEE 264  |   .0370043    .080835     0.46   0.647    -.1214318    .1954404
    EMPLOYEE 265  |  -.1873556   .1689461    -1.11   0.267    -.5184889    .1437777
    EMPLOYEE 266  |  -.1471971   .1446795    -1.02   0.309    -.4307681    .1363739
    EMPLOYEE 267  |  -.1403126   .1616973    -0.87   0.386    -.4572383    .1766131
    EMPLOYEE 269  |   .0318368   .0768847     0.41   0.679    -.1188567    .1825303
     EMPLOYEE 27  |   .1162534   .1052865     1.10   0.270    -.0901075    .3226144
    EMPLOYEE 271  |  -.0434585   .1107848    -0.39   0.695    -.2605962    .1736791
    EMPLOYEE 272  |  -.0123674   .0991785    -0.12   0.901    -.2067566    .1820219
    EMPLOYEE 273  |  -.1518431    .066594    -2.28   0.023    -.2823669   -.0213194
    EMPLOYEE 274  |  -.1402794   .1709903    -0.82   0.412    -.4754193    .1948605
    EMPLOYEE 276  |   .0277229   .0725651     0.38   0.702    -.1145042    .1699501
    EMPLOYEE 277  |  -.0121794   .1044372    -0.12   0.907    -.2168757    .1925169
    EMPLOYEE 278  |   .0286226   .0445635     0.64   0.521    -.0587216    .1159668
    EMPLOYEE 279  |  -.2218801   .1909298    -1.16   0.245    -.5961013    .1523411
     EMPLOYEE 28  |  -.0136796   .0448154    -0.31   0.760    -.1015175    .0741584
    EMPLOYEE 280  |   .1181059   .0442393     2.67   0.008     .0313971    .2048146
    EMPLOYEE 281  |  -.1075534   .1341879    -0.80   0.423    -.3705608     .155454
    EMPLOYEE 282  |   .0374035   .0502145     0.74   0.456    -.0610166    .1358237
    EMPLOYEE 283  |    -.12835   .1364259    -0.94   0.347    -.3957439    .1390439
    EMPLOYEE 284  |  -.0007815   .0654587    -0.01   0.990      -.12908    .1275171
    EMPLOYEE 285  |  -.0440055   .1593539    -0.28   0.782    -.3563382    .2683272
    EMPLOYEE 286  |  -.0983711   .1248082    -0.79   0.431    -.3429943    .1462522
    EMPLOYEE 287  |  -.1376055   .1388333    -0.99   0.322     -.409718     .134507
    EMPLOYEE 288  |  -.1695596   .1293224    -1.31   0.190    -.4230307    .0839116
    EMPLOYEE 289  |  -.0941342   .1453479    -0.65   0.517    -.3790151    .1907468
    EMPLOYEE 290  |   -.120705   .1205365    -1.00   0.317    -.3569558    .1155458
    EMPLOYEE 291  |  -.1082938   .1567044    -0.69   0.490    -.4154335    .1988459
    EMPLOYEE 292  |  -.1188451   .1503822    -0.79   0.429    -.4135933    .1759031
    EMPLOYEE 293  |  -.1364787   .1664761    -0.82   0.412    -.4627708    .1898134
    EMPLOYEE 294  |  -.1025694   .1305412    -0.79   0.432    -.3584293    .1532904
    EMPLOYEE 296  |   .0188512   .1112974     0.17   0.866     -.199291    .2369934
    EMPLOYEE 297  |   .0982901   .1019924     0.96   0.335    -.1016144    .2981945
    EMPLOYEE 298  |   .0678555   .0427514     1.59   0.112    -.0159369    .1516479
      EMPLOYEE 3  |   .1216378   .0623389     1.95   0.051    -.0005461    .2438218
     EMPLOYEE 30  |  -.2993161    .180304    -1.66   0.097    -.6527108    .0540786
    EMPLOYEE 300  |   -.086054    .160182    -0.54   0.591    -.4000098    .2279018
    EMPLOYEE 301  |  -.1103942   .1411621    -0.78   0.434    -.3870711    .1662826
    EMPLOYEE 302  |  -.0849303   .1409604    -0.60   0.547    -.3612118    .1913512
    EMPLOYEE 303  |  -.1378683    .192881    -0.71   0.475    -.5159139    .2401773
    EMPLOYEE 304  |  -.0491962    .097403    -0.51   0.614    -.2401055    .1417131
    EMPLOYEE 305  |  -.3351001   .1341236    -2.50   0.012    -.5979814   -.0722187
    EMPLOYEE 306  |  -.1352259   .1670965    -0.81   0.418    -.4627341    .1922822
    EMPLOYEE 307  |  -.1643566   .2122183    -0.77   0.439    -.5803032    .2515899
    EMPLOYEE 308  |    .109513   .0541657     2.02   0.043     .0033487    .2156774
    EMPLOYEE 309  |  -.2084612   .1181109    -1.76   0.078    -.4399578    .0230354
     EMPLOYEE 31  |  -.0207085    .052603    -0.39   0.694    -.1238101    .0823931
    EMPLOYEE 310  |   .0135856   .0568731     0.24   0.811    -.0978852    .1250565
    EMPLOYEE 311  |  -.0701485   .1089768    -0.64   0.520    -.2837424    .1434455
    EMPLOYEE 312  |  -.0868269    .109733    -0.79   0.429    -.3019029    .1282491
    EMPLOYEE 313  |   .0916075   .0634569     1.44   0.149    -.0327677    .2159827
    EMPLOYEE 314  |  -.1523293   .1523077    -1.00   0.317    -.4508515     .146193
    EMPLOYEE 315  |  -.0395089   .1085089    -0.36   0.716    -.2521858    .1731679
    EMPLOYEE 316  |  -.2107835   .2142371    -0.98   0.325    -.6306869    .2091198
    EMPLOYEE 317  |   .0469301   .0816748     0.57   0.566    -.1131521    .2070122
    EMPLOYEE 318  |  -.0846246   .0443137    -1.91   0.056    -.1714791      .00223
    EMPLOYEE 319  |  -.2173148   .1857995    -1.17   0.242    -.5814807     .146851
    EMPLOYEE 320  |  -.0510168   .1030367    -0.50   0.621     -.252968    .1509345
    EMPLOYEE 321  |  -.1037154   .1659171    -0.63   0.532    -.4289119    .2214812
    EMPLOYEE 322  |   .0615238   .0588456     1.05   0.296    -.0538133    .1768609
    EMPLOYEE 323  |  -.1097369   .1213794    -0.90   0.366    -.3476398    .1281661
    EMPLOYEE 324  |   .0663336   .0688361     0.96   0.335    -.0685847    .2012519
    EMPLOYEE 325  |  -.0467092    .121321    -0.39   0.700    -.2844976    .1910791
    EMPLOYEE 326  |    .040094   .0664304     0.60   0.546    -.0901092    .1702973
    EMPLOYEE 327  |  -.0038917   .0548155    -0.07   0.943    -.1113296    .1035463
    EMPLOYEE 328  |  -.0205269   .0904142    -0.23   0.820    -.1977382    .1566844
    EMPLOYEE 329  |  -.0299342   .0769306    -0.39   0.697    -.1807177    .1208494
     EMPLOYEE 33  |   .0831476   .0552922     1.50   0.133    -.0252249      .19152
    EMPLOYEE 330  |  -.4515332   .1199112    -3.77   0.000    -.6865585   -.2165079
    EMPLOYEE 331  |  -.1062157   .1097746    -0.97   0.333    -.3213733    .1089419
    EMPLOYEE 332  |  -.0301718   .0423399    -0.71   0.476    -.1131577    .0528142
    EMPLOYEE 333  |   -.057672   .0907471    -0.64   0.525    -.2355358    .1201919
    EMPLOYEE 334  |   -.183155   .1956604    -0.94   0.349    -.5666482    .2003383
    EMPLOYEE 336  |   .1391541   .0432862     3.21   0.001     .0543133    .2239948
    EMPLOYEE 338  |  -.1722665   .1471441    -1.17   0.242    -.4606681     .116135
    EMPLOYEE 339  |  -.1520315   .1414724    -1.07   0.283    -.4293164    .1252535
     EMPLOYEE 34  |   .0164639   .0616521     0.27   0.789    -.1043739    .1373017
    EMPLOYEE 340  |  -.1012817   .1806739    -0.56   0.575    -.4554014    .2528379
    EMPLOYEE 341  |   -.008778   .0943983    -0.09   0.926     -.193798     .176242
    EMPLOYEE 342  |   .0123834   .0402421     0.31   0.758    -.0664909    .0912577
    EMPLOYEE 343  |  -.1077566   .1520638    -0.71   0.479    -.4058007    .1902874
    EMPLOYEE 344  |  -.1086368   .1722551    -0.63   0.528    -.4462558    .2289822
    EMPLOYEE 345  |    -.03376   .0620818    -0.54   0.587      -.15544      .08792
    EMPLOYEE 346  |  -.0240634   .0801437    -0.30   0.764    -.1811446    .1330177
    EMPLOYEE 347  |  -.0537122   .0705463    -0.76   0.446    -.1919826    .0845581
    EMPLOYEE 348  |   -.141896    .154569    -0.92   0.359    -.4448502    .1610583
    EMPLOYEE 349  |   .0011625   .1463529     0.01   0.994    -.2856883    .2880133
     EMPLOYEE 35  |    .217687   .1038836     2.10   0.036     .0140758    .4212983
    EMPLOYEE 350  |   .0291854   .0524465     0.56   0.578    -.0736095    .1319804
    EMPLOYEE 351  |   .1315063   .2440183     0.54   0.590     -.346768    .6097807
    EMPLOYEE 352  |  -.0882501    .141116    -0.63   0.532    -.3648367    .1883364
    EMPLOYEE 353  |  -.1087392   .1436668    -0.76   0.449    -.3903252    .1728469
    EMPLOYEE 354  |  -.1969444   .1657031    -1.19   0.235    -.5217213    .1278326
    EMPLOYEE 355  |  -.1573913   .0673688    -2.34   0.019    -.2894337   -.0253489
    EMPLOYEE 356  |    .120943   .0384372     3.15   0.002     .0456064    .1962796
    EMPLOYEE 357  |  -.0937621   .1847383    -0.51   0.612    -.4558481     .268324
    EMPLOYEE 358  |  -.0406029   .1010518    -0.40   0.688    -.2386638     .157458
    EMPLOYEE 359  |  -.0528938   .0919092    -0.58   0.565    -.2330353    .1272477
     EMPLOYEE 36  |   .0174981   .0453198     0.39   0.699    -.0713284    .1063247
    EMPLOYEE 361  |  -.1056923    .220676    -0.48   0.632    -.5382159    .3268313
    EMPLOYEE 362  |  -.0861349   .1123157    -0.77   0.443    -.3062729    .1340031
    EMPLOYEE 363  |  -.1570816   .2160606    -0.73   0.467     -.580559    .2663958
    EMPLOYEE 364  |  -.0667529   .1450237    -0.46   0.645    -.3509985    .2174926
    EMPLOYEE 365  |  -.0531443   .0991626    -0.54   0.592    -.2475024    .1412137
    EMPLOYEE 366  |   .0199934   .0373503     0.54   0.592    -.0532129    .0931997
    EMPLOYEE 367  |   .0095419   .0706079     0.14   0.893    -.1288492     .147933
    EMPLOYEE 368  |   .0405576   .1184483     0.34   0.732    -.1916003    .2727156
    EMPLOYEE 369  |  -.0407232   .0374728    -1.09   0.277    -.1141697    .0327233
     EMPLOYEE 37  |   -.088723   .0556208    -1.60   0.111    -.1977394    .0202933
    EMPLOYEE 370  |  -.1186798   .1045581    -1.14   0.256    -.3236131    .0862535
    EMPLOYEE 371  |   -.127441    .178428    -0.71   0.475    -.4771588    .2222767
    EMPLOYEE 372  |   .0255834   .0484734     0.53   0.598    -.0694241     .120591
    EMPLOYEE 373  |     .09281   .1376132     0.67   0.500    -.1769111    .3625311
    EMPLOYEE 374  |  -.0807896   .1438866    -0.56   0.574    -.3628065    .2012273
    EMPLOYEE 375  |  -.1831317   .1587818    -1.15   0.249     -.494343    .1280797
    EMPLOYEE 376  |  -.0393352   .0993815    -0.40   0.692    -.2341223    .1554518
    EMPLOYEE 377  |  -.1152835   .1836634    -0.63   0.530    -.4752626    .2446957
    EMPLOYEE 378  |   .0757112   .0618391     1.22   0.221    -.0454931    .1969155
    EMPLOYEE 379  |  -.2034717   .1212243    -1.68   0.093    -.4410706    .0341271
     EMPLOYEE 38  |  -.0594389   .1149593    -0.52   0.605    -.2847584    .1658807
    EMPLOYEE 380  |    .006169   .0518272     0.12   0.905     -.095412      .10775
    EMPLOYEE 381  |  -.2722636   .1135198    -2.40   0.016    -.4947618   -.0497654
    EMPLOYEE 382  |   .0641966   .0520745     1.23   0.218    -.0378692    .1662623
    EMPLOYEE 383  |    -.14103   .0708524    -1.99   0.047    -.2799003   -.0021596
    EMPLOYEE 384  |   .0063596   .0418987     0.15   0.879    -.0757616    .0884807
    EMPLOYEE 385  |  -.0859485    .148519    -0.58   0.563    -.3770448    .2051478
    EMPLOYEE 386  |  -.2537285   .2385274    -1.06   0.287    -.7212407    .2137838
    EMPLOYEE 387  |  -.1182506   .1635181    -0.72   0.470     -.438745    .2022438
    EMPLOYEE 388  |  -.1002873   .1636027    -0.61   0.540    -.4209475    .2203729
    EMPLOYEE 389  |  -.1571893   .1751594    -0.90   0.370    -.5005006     .186122
    EMPLOYEE 391  |  -.1739552   .1326546    -1.31   0.190    -.4339574    .0860471
    EMPLOYEE 392  |  -.0526895   .0725158    -0.73   0.467    -.1948201    .0894411
    EMPLOYEE 393  |   .0017123   .1426874     0.01   0.990     -.277954    .2813787
    EMPLOYEE 394  |   .0224455   .0454685     0.49   0.622    -.0666725    .1115635
    EMPLOYEE 395  |   .0820654   .0348712     2.35   0.019      .013718    .1504127
    EMPLOYEE 396  |  -.1848132   .1163374    -1.59   0.112    -.4128337    .0432073
    EMPLOYEE 397  |  -.0620569   .1354182    -0.46   0.647    -.3274757    .2033619
    EMPLOYEE 398  |   -.247716   .1617897    -1.53   0.126    -.5648229    .0693909
    EMPLOYEE 399  |   -.039991   .1393297    -0.29   0.774    -.3130763    .2330944
      EMPLOYEE 4  |   .0041572   .0687791     0.06   0.952    -.1306494    .1389637
     EMPLOYEE 40  |   -.060955   .0581045    -1.05   0.294    -.1748394    .0529294
    EMPLOYEE 400  |   -.110062   .1580707    -0.70   0.486    -.4198797    .1997557
    EMPLOYEE 401  |  -.0329519   .0354407    -0.93   0.352    -.1024154    .0365115
    EMPLOYEE 402  |  -.1596877   .2030767    -0.79   0.432    -.5577168    .2383414
    EMPLOYEE 403  |  -.1670561   .1453357    -1.15   0.250    -.4519132    .1178009
    EMPLOYEE 404  |  -.0439842   .0915239    -0.48   0.631    -.2233704    .1354021
    EMPLOYEE 405  |  -.0742391   .2007894    -0.37   0.712     -.467785    .3193068
    EMPLOYEE 406  |   .0022045   .2361694     0.01   0.993    -.4606862    .4650951
    EMPLOYEE 408  |  -.0222655   .0751076    -0.30   0.767    -.1694761     .124945
    EMPLOYEE 409  |  -.0629921   .1213709    -0.52   0.604    -.3008783    .1748942
     EMPLOYEE 41  |   .1243467   .1187938     1.05   0.295    -.1084885    .3571819
    EMPLOYEE 410  |  -.0483998    .106672    -0.45   0.650    -.2574762    .1606767
    EMPLOYEE 413  |   .0617329   .0928017     0.67   0.506    -.1201578    .2436236
    EMPLOYEE 415  |   .1311795   .1058277     1.24   0.215    -.0762421    .3386012
    EMPLOYEE 418  |  -.1010004   .0964907    -1.05   0.295    -.2901215    .0881208
    EMPLOYEE 419  |  -.1072952   .1882226    -0.57   0.569    -.4762103    .2616199
     EMPLOYEE 42  |   -.035629   .0665724    -0.54   0.593    -.1661104    .0948525
    EMPLOYEE 420  |  -.1694345   .1994831    -0.85   0.396    -.5604202    .2215512
    EMPLOYEE 421  |  -.2334278    .235248    -0.99   0.321    -.6945126    .2276569
    EMPLOYEE 422  |  -.0977923    .140291    -0.70   0.486    -.3727619    .1771772
    EMPLOYEE 423  |  -.1706617   .1453622    -1.17   0.240    -.4555707    .1142473
    EMPLOYEE 424  |  -.0785668   .1798568    -0.44   0.662    -.4310852    .2739515
    EMPLOYEE 425  |  -.0537595   .0896963    -0.60   0.549    -.2295637    .1220447
    EMPLOYEE 426  |   .0691936   .0343837     2.01   0.044     .0018016    .1365855
    EMPLOYEE 427  |  -.1046009   .1198609    -0.87   0.383    -.3395276    .1303257
    EMPLOYEE 428  |  -.1348004   .1859576    -0.72   0.469    -.4992761    .2296754
    EMPLOYEE 429  |  -.0909697   .1233173    -0.74   0.461    -.3326709    .1507315
     EMPLOYEE 43  |   .1010492     .03366     3.00   0.003     .0350758    .1670227
    EMPLOYEE 430  |  -.1279643   .1292147    -0.99   0.322    -.3812243    .1252958
    EMPLOYEE 431  |  -.0982391   .1151016    -0.85   0.393    -.3238374    .1273593
    EMPLOYEE 432  |  -.0146657   .1908301    -0.08   0.939    -.3886916    .3593602
    EMPLOYEE 433  |  -.1671255    .100187    -1.67   0.095    -.3634914    .0292403
    EMPLOYEE 434  |  -.1000593   .1527946    -0.65   0.513    -.3995358    .1994172
    EMPLOYEE 435  |  -.0030857   .0344486    -0.09   0.929    -.0706048    .0644334
    EMPLOYEE 437  |  -.0554739   .0434299    -1.28   0.201    -.1405962    .0296484
    EMPLOYEE 438  |   .0036753   .0438692     0.08   0.933    -.0823081    .0896586
    EMPLOYEE 439  |  -.1640074   .1983541    -0.83   0.408    -.5527803    .2247654
     EMPLOYEE 44  |   .1172647   .0360856     3.25   0.001     .0465372    .1879922
    EMPLOYEE 440  |   .0190066   .0544414     0.35   0.727    -.0876981    .1257114
    EMPLOYEE 441  |  -.0818134   .1692901    -0.48   0.629     -.413621    .2499942
    EMPLOYEE 442  |  -.1627941   .1744234    -0.93   0.351     -.504663    .1790747
    EMPLOYEE 443  |  -.0391445   .0787865    -0.50   0.619    -.1935655    .1152765
    EMPLOYEE 444  |  -.1139138   .2175171    -0.52   0.600    -.5402461    .3124184
    EMPLOYEE 445  |  -.1742461   .1849819    -0.94   0.346    -.5368094    .1883172
    EMPLOYEE 446  |  -.1633368   .1262296    -1.29   0.196     -.410746    .0840724
    EMPLOYEE 448  |  -.2169649   .1991822    -1.09   0.276    -.6073608     .173431
    EMPLOYEE 450  |  -.0442478   .1169545    -0.38   0.705     -.273478    .1849824
    EMPLOYEE 451  |  -.1968705   .1954373    -1.01   0.314    -.5799263    .1861854
    EMPLOYEE 452  |  -.1617422   .1890887    -0.86   0.392    -.5323548    .2088705
    EMPLOYEE 453  |  -.1577124   .2293941    -0.69   0.492    -.6073234    .2918986
    EMPLOYEE 454  |  -.0444293   .1018929    -0.44   0.663    -.2441388    .1552802
    EMPLOYEE 455  |  -.1280574   .1836082    -0.70   0.486    -.4879283    .2318135
    EMPLOYEE 456  |  -.0022533   .0709495    -0.03   0.975     -.141314    .1368074
    EMPLOYEE 457  |   .0250493   .0665826     0.38   0.707    -.1054522    .1555508
    EMPLOYEE 458  |  -.1309603   .2552534    -0.51   0.608    -.6312555    .3693349
    EMPLOYEE 459  |  -.1819285   .1996493    -0.91   0.362    -.5732398    .2093828
     EMPLOYEE 46  |  -.1165563   .1146622    -1.02   0.309    -.3412936    .1081809
    EMPLOYEE 460  |  -.1848292   .1315209    -1.41   0.160    -.4426094     .072951
    EMPLOYEE 461  |  -.1264402   .1213266    -1.04   0.297    -.3642396    .1113592
    EMPLOYEE 462  |  -.0448161   .1371663    -0.33   0.744    -.3136611    .2240289
    EMPLOYEE 463  |   .0530429   .0843825     0.63   0.530    -.1123463    .2184321
    EMPLOYEE 464  |  -.1163268   .2607443    -0.45   0.656    -.6273839    .3947304
    EMPLOYEE 465  |  -.1193551   .1227259    -0.97   0.331    -.3598971    .1211869
    EMPLOYEE 467  |  -.1788582   .1790494    -1.00   0.318    -.5297939    .1720774
    EMPLOYEE 468  |  -.0523658   .1485561    -0.35   0.724    -.3435348    .2388032
    EMPLOYEE 469  |  -.1687317   .2021248    -0.83   0.404    -.5648949    .2274316
     EMPLOYEE 47  |   .0862018   .0450208     1.91   0.056    -.0020386    .1744422
    EMPLOYEE 470  |   -.028783   .0706648    -0.41   0.684    -.1672856    .1097196
    EMPLOYEE 471  |  -.0459783   .1322021    -0.35   0.728    -.3050936     .213137
    EMPLOYEE 472  |  -.1858376   .1672847    -1.11   0.267    -.5137146    .1420394
    EMPLOYEE 474  |  -.3093171   .1935597    -1.60   0.110     -.688693    .0700587
    EMPLOYEE 475  |  -.2628696   .2653156    -0.99   0.322    -.7828866    .2571474
    EMPLOYEE 476  |  -.1809692     .22884    -0.79   0.429    -.6294943    .2675558
    EMPLOYEE 477  |  -.0802708   .1111998    -0.72   0.470    -.2982218    .1376802
    EMPLOYEE 478  |  -.1607158   .1978272    -0.81   0.417    -.5484559    .2270243
    EMPLOYEE 479  |   .0647562   .0418776     1.55   0.122    -.0173238    .1468361
     EMPLOYEE 48  |  -.0675027   .0472178    -1.43   0.153    -.1600493    .0250439
    EMPLOYEE 480  |  -.1445487   .2055025    -0.70   0.482    -.5473323     .258235
    EMPLOYEE 481  |   -.266801   .2098621    -1.27   0.204    -.6781295    .1445275
    EMPLOYEE 482  |  -.2227102   .2115576    -1.05   0.292    -.6373618    .1919414
    EMPLOYEE 483  |  -.3631605   .1905376    -1.91   0.057    -.7366129     .010292
    EMPLOYEE 484  |   -.087039   .1462347    -0.60   0.552    -.3736582    .1995801
    EMPLOYEE 485  |   .0157007   .0496142     0.32   0.752    -.0815428    .1129442
    EMPLOYEE 486  |  -.1178262    .209106    -0.56   0.573    -.5276728    .2920204
    EMPLOYEE 487  |  -.1414941   .2140499    -0.66   0.509    -.5610306    .2780424
    EMPLOYEE 488  |  -.2439026   .2144408    -1.14   0.255    -.6642053    .1764001
    EMPLOYEE 489  |   -.093441   .1192855    -0.78   0.433    -.3272398    .1403577
     EMPLOYEE 49  |  -.0536116   .0687425    -0.78   0.435    -.1883465    .0811232
    EMPLOYEE 490  |  -.2530947   .1860661    -1.36   0.174    -.6177831    .1115938
    EMPLOYEE 491  |    -.17531   .2008206    -0.87   0.383    -.5689172    .2182972
    EMPLOYEE 492  |  -.0761149   .0853301    -0.89   0.372    -.2433614    .0911316
    EMPLOYEE 493  |  -.0383832   .0691387    -0.56   0.579    -.1738945    .0971282
    EMPLOYEE 494  |  -.1046294   .1972834    -0.53   0.596    -.4913036    .2820448
    EMPLOYEE 495  |  -.1079704    .158598    -0.68   0.496    -.4188215    .2028806
    EMPLOYEE 496  |  -.1989836   .1977179    -1.01   0.314    -.5865095    .1885422
    EMPLOYEE 498  |  -.0990755   .2067496    -0.48   0.632    -.5043034    .3061524
    EMPLOYEE 499  |  -.1051236   .2202404    -0.48   0.633    -.5367934    .3265462
      EMPLOYEE 5  |   .1646566   .0510069     3.23   0.001     .0646834    .2646297
    EMPLOYEE 500  |   .0909284   .0442883     2.05   0.040     .0041235    .1777332
    EMPLOYEE 501  |  -.1530594   .2055778    -0.74   0.457    -.5559906    .2498719
    EMPLOYEE 502  |   .1432381   .0730875     1.96   0.050    -.0000128    .2864891
    EMPLOYEE 503  |  -.4083228   .2149936    -1.90   0.058    -.8297089    .0130633
    EMPLOYEE 504  |  -.0604941    .176973    -0.34   0.732    -.4073601     .286372
    EMPLOYEE 505  |   .0003139   .1534489     0.00   0.998     -.300445    .3010729
    EMPLOYEE 506  |  -.1525287   .2129615    -0.72   0.474    -.5699319    .2648744
    EMPLOYEE 507  |   .0936613   .0690648     1.36   0.175    -.0417053    .2290279
    EMPLOYEE 508  |   -.129612   .1916996    -0.68   0.499    -.5053421     .246118
    EMPLOYEE 509  |   .0634197   .0615427     1.03   0.303    -.0572037    .1840431
     EMPLOYEE 51  |   .0882039   .0600488     1.47   0.142    -.0294914    .2058991
    EMPLOYEE 510  |  -.1616767   .2000608    -0.81   0.419    -.5537947    .2304414
    EMPLOYEE 511  |   .1318027   .0357632     3.69   0.000     .0617071    .2018984
    EMPLOYEE 512  |   .0148912   .1471688     0.10   0.919    -.2735587    .3033412
    EMPLOYEE 513  |   -.165567   .2158793    -0.77   0.443    -.5886891    .2575551
    EMPLOYEE 514  |   -.074673    .161944    -0.46   0.645    -.3920822    .2427363
    EMPLOYEE 515  |  -.0435326   .1488095    -0.29   0.770    -.3351983    .2481332
    EMPLOYEE 516  |  -.1440977   .1356246    -1.06   0.288     -.409921    .1217256
    EMPLOYEE 517  |  -.1143428   .2199505    -0.52   0.603    -.5454444    .3167588
    EMPLOYEE 518  |  -.2244022   .1655576    -1.36   0.175    -.5488941    .1000896
    EMPLOYEE 519  |  -.0766288   .1266187    -0.61   0.545    -.3248008    .1715431
    EMPLOYEE 520  |   -.053062   .1579573    -0.34   0.737    -.3626573    .2565332
    EMPLOYEE 521  |  -.2158203   .2358128    -0.92   0.360    -.6780119    .2463713
    EMPLOYEE 522  |   .0057209   .0572183     0.10   0.920    -.1064266    .1178684
    EMPLOYEE 525  |   .2391813   .0672577     3.56   0.000     .1073567    .3710059
    EMPLOYEE 526  |   .0696698   .3020683     0.23   0.818    -.5223822    .6617217
    EMPLOYEE 528  |   .1607109   .0795957     2.02   0.043     .0047038    .3167179
    EMPLOYEE 529  |   .2885504   .0448351     6.44   0.000     .2006739    .3764269
    EMPLOYEE 530  |   .1569482   .0461465     3.40   0.001     .0665014    .2473951
    EMPLOYEE 532  |   .0388135   .1474176     0.26   0.792     -.250124     .327751
    EMPLOYEE 533  |  -.0601476   .2324274    -0.26   0.796    -.5157039    .3954087
    EMPLOYEE 534  |  -.0307227   .2666722    -0.12   0.908    -.5533984    .4919531
    EMPLOYEE 535  |  -.0277279   .2774557    -0.10   0.920    -.5715393    .5160835
    EMPLOYEE 536  |   .0034705    .254892     0.01   0.989    -.4961164    .5030573
    EMPLOYEE 537  |   .3646479   .0654101     5.57   0.000     .2364446    .4928513
    EMPLOYEE 538  |  -.0504091   .2488375    -0.20   0.839    -.5381291    .4373109
    EMPLOYEE 539  |   .1308049   .1372721     0.95   0.341    -.1382476    .3998574
     EMPLOYEE 54  |  -.0199615   .0510703    -0.39   0.696    -.1200591    .0801361
    EMPLOYEE 540  |   .2818148   .0686533     4.10   0.000     .1472547    .4163749
    EMPLOYEE 541  |    .103854   .0969094     1.07   0.284    -.0860878    .2937957
    EMPLOYEE 543  |   .0578394   .1348151     0.43   0.668    -.2063975    .3220762
    EMPLOYEE 544  |   .0414825   .2531168     0.16   0.870     -.454625    .5375899
    EMPLOYEE 547  |   .2186834   .0536305     4.08   0.000      .113568    .3237988
     EMPLOYEE 55  |   .0122557   .0484419     0.25   0.800      -.08269    .1072015
    EMPLOYEE 550  |   .0743502    .271154     0.27   0.784      -.45711    .6058104
    EMPLOYEE 551  |  -.0809311   .3052344    -0.27   0.791    -.6791886    .5173265
    EMPLOYEE 552  |  -.0998823   .2697053    -0.37   0.711     -.628503    .4287383
    EMPLOYEE 553  |    .095089   .1383398     0.69   0.492    -.1760561    .3662342
    EMPLOYEE 554  |   .0929616   .2007745     0.46   0.643    -.3005551    .4864783
    EMPLOYEE 555  |   .0331482   .2138056     0.16   0.877    -.3859094    .4522059
    EMPLOYEE 557  |   .0391504   .1893306     0.21   0.836    -.3319364    .4102372
    EMPLOYEE 559  |   .1416191   .1249893     1.13   0.257    -.1033591    .3865974
     EMPLOYEE 56  |  -.0598895   .0966627    -0.62   0.536    -.2493478    .1295687
    EMPLOYEE 562  |   .0166515   .1560106     0.11   0.915    -.2891284    .3224314
    EMPLOYEE 563  |   .2039382   .1661479     1.23   0.220    -.1217107    .5295871
    EMPLOYEE 565  |   .0043414   .2738356     0.02   0.987    -.5323747    .5410575
    EMPLOYEE 566  |   .0610736   .2523302     0.24   0.809     -.433492    .5556393
    EMPLOYEE 567  |   .0813912   .2100651     0.39   0.698     -.330335    .4931175
    EMPLOYEE 570  |   .1477587   .2399364     0.62   0.538    -.3225152    .6180326
    EMPLOYEE 571  |   .2315714    .113825     2.03   0.042     .0084752    .4546677
    EMPLOYEE 572  |   .0123673   .2640291     0.05   0.963    -.5051282    .5298628
    EMPLOYEE 574  |   .1452119   .1557951     0.93   0.351    -.1601455    .4505693
    EMPLOYEE 575  |   .2512065   .1018437     2.47   0.014     .0515936    .4508195
    EMPLOYEE 576  |   .1710091   .1436386     1.19   0.234    -.1105218    .4525399
    EMPLOYEE 577  |   .0818219   .2458575     0.33   0.739    -.4000573    .5637012
    EMPLOYEE 578  |   .0651361    .248966     0.26   0.794    -.4228357    .5531078
    EMPLOYEE 579  |   .0483909   .2833877     0.17   0.864    -.5070473    .6038291
     EMPLOYEE 58  |  -.0261678    .092775    -0.28   0.778    -.2080062    .1556707
    EMPLOYEE 581  |   .0482257   .2676536     0.18   0.857    -.4763738    .5728252
    EMPLOYEE 585  |    .150483   .1796917     0.84   0.402    -.2017117    .5026776
    EMPLOYEE 586  |   .1105719   .2870434     0.39   0.700    -.4520314    .6731752
    EMPLOYEE 587  |  -.3389023   .2945413    -1.15   0.250    -.9162013    .2383968
    EMPLOYEE 588  |   .1340641   .1065355     1.26   0.208    -.0747448     .342873
    EMPLOYEE 589  |   .3131896   .1176967     2.66   0.008     .0825047    .5438745
     EMPLOYEE 59  |  -.0134358   .0553921    -0.24   0.808     -.122004    .0951324
    EMPLOYEE 590  |   .2034795   .0519091     3.92   0.000     .1017379     .305221
    EMPLOYEE 592  |   .0858861    .189127     0.45   0.650    -.2848016    .4565739
    EMPLOYEE 596  |   .0752494   .2202193     0.34   0.733    -.3563791    .5068779
     EMPLOYEE 60  |   .0472372   .0410966     1.15   0.250    -.0333119    .1277863
    EMPLOYEE 601  |   .2389541   .0653877     3.65   0.000     .1107945    .3671137
    EMPLOYEE 602  |   .1349098   .2591735     0.52   0.603    -.3730686    .6428883
    EMPLOYEE 605  |  -.0093554   .2917693    -0.03   0.974    -.5812214    .5625106
    EMPLOYEE 607  |   .2261135   .0531249     4.26   0.000     .1219889    .3302381
     EMPLOYEE 61  |  -.1070003   .0484567    -2.21   0.027    -.2019751   -.0120255
    EMPLOYEE 613  |  -.0047165    .282705    -0.02   0.987    -.5588166    .5493835
    EMPLOYEE 615  |   .0557251   .2653134     0.21   0.834    -.4642876    .5757378
    EMPLOYEE 616  |   .0824413    .253865     0.32   0.745    -.4151325    .5800152
    EMPLOYEE 628  |   .1591827   .2192312     0.73   0.468     -.270509    .5888744
    EMPLOYEE 629  |   .1836818   .1599259     1.15   0.251    -.1297719    .4971355
     EMPLOYEE 63  |  -.0218376    .044298    -0.49   0.622    -.1086613    .0649861
    EMPLOYEE 632  |   .0657616   .2585035     0.25   0.799    -.4409037    .5724269
    EMPLOYEE 633  |   .0361869   .3073882     0.12   0.906     -.566292    .6386659
     EMPLOYEE 64  |   .0131479   .0352974     0.37   0.710    -.0560348    .0823306
    EMPLOYEE 641  |   .2076922   .1183892     1.75   0.079    -.0243498    .4397343
    EMPLOYEE 646  |    .004731   .3133725     0.02   0.988    -.6094771    .6189391
    EMPLOYEE 647  |  -.1449481   .2924274    -0.50   0.620    -.7181041    .4282078
     EMPLOYEE 65  |    .065131   .0395618     1.65   0.100    -.0124098    .1426718
    EMPLOYEE 650  |   .0867348   .2444767     0.35   0.723    -.3924379    .5659076
    EMPLOYEE 655  |  -.1225269   .3146919    -0.39   0.697     -.739321    .4942673
    EMPLOYEE 656  |   .0918374   .2331319     0.39   0.694    -.3650997    .5487746
    EMPLOYEE 658  |   .1314786    .298155     0.44   0.659    -.4529034    .7158605
     EMPLOYEE 66  |  -.1588916   .1505493    -1.06   0.291    -.4539673    .1361841
    EMPLOYEE 662  |   .1635999   .1227261     1.33   0.183    -.0769426    .4041424
    EMPLOYEE 664  |   .2464023   .1866999     1.32   0.187    -.1195284    .6123329
    EMPLOYEE 665  |   .2052159   .1545481     1.33   0.184    -.0976973    .5081291
    EMPLOYEE 666  |   .0665546   .2635627     0.25   0.801    -.4500266    .5831359
    EMPLOYEE 667  |   .2251761   .2664543     0.85   0.398    -.2970728     .747425
    EMPLOYEE 668  |   .1399111   .1524892     0.92   0.359    -.1589668     .438789
    EMPLOYEE 675  |   .1893917   .1426326     1.33   0.184    -.0901673    .4689508
    EMPLOYEE 678  |  -.1889257   .2745015    -0.69   0.491    -.7269471    .3490956
    EMPLOYEE 679  |   .0544318   .2525249     0.22   0.829    -.4405154    .5493791
     EMPLOYEE 68  |  -.1089513   .1072404    -1.02   0.310    -.3191418    .1012392
    EMPLOYEE 683  |   .2782561   .1574396     1.77   0.077    -.0303246    .5868369
    EMPLOYEE 684  |    .234095   .1069997     2.19   0.029     .0243763    .4438137
    EMPLOYEE 687  |   .0932959   .2845221     0.33   0.743    -.4643656    .6509574
    EMPLOYEE 688  |  -.0278131   .3058629    -0.09   0.928    -.6273025    .5716763
     EMPLOYEE 69  |  -.1632867   .1207859    -1.35   0.176    -.4000263     .073453
    EMPLOYEE 690  |   .1646333   .2650606     0.62   0.535    -.3548837    .6841504
    EMPLOYEE 691  |   .2657633   .1416695     1.88   0.061    -.0119081    .5434347
      EMPLOYEE 7  |  -.0168872   .0924782    -0.18   0.855     -.198144    .1643695
     EMPLOYEE 70  |  -.1727186   .1345336    -1.28   0.199    -.4364037    .0909665
     EMPLOYEE 71  |   -.098481   .0912284    -1.08   0.280    -.2772881    .0803261
    EMPLOYEE 714  |  -.3138081   .2508741    -1.25   0.211    -.8055197    .1779036
    EMPLOYEE 716  |    -.18967   .2520217    -0.75   0.452    -.6836309     .304291
    EMPLOYEE 717  |  -.4647143    .280619    -1.66   0.098    -1.014726    .0852972
     EMPLOYEE 72  |  -.1348232   .0641534    -2.10   0.036    -.2605634   -.0090829
    EMPLOYEE 722  |  -.2122325   .1539786    -1.38   0.168    -.5140297    .0895646
    EMPLOYEE 725  |  -.6092915   .2672237    -2.28   0.023    -1.133048   -.0855347
    EMPLOYEE 726  |  -.4097661   .3129603    -1.31   0.190    -1.023166    .2036341
    EMPLOYEE 729  |  -.5591577   .3232523    -1.73   0.084     -1.19273    .0744149
     EMPLOYEE 73  |   .0181179   .0869811     0.21   0.835    -.1523644    .1886003
    EMPLOYEE 733  |  -.3465218   .2763518    -1.25   0.210    -.8881696    .1951261
    EMPLOYEE 735  |  -.5335716   .2806508    -1.90   0.057    -1.083646    .0165023
     EMPLOYEE 76  |  -.0586779   .0682606    -0.86   0.390    -.1924683    .0751125
     EMPLOYEE 79  |   .0752229   .0508981     1.48   0.139    -.0245371    .1749828
      EMPLOYEE 8  |   -.002868   .0438645    -0.07   0.948    -.0888421    .0831061
     EMPLOYEE 80  |   .0713969   .0360955     1.98   0.048       .00065    .1421438
     EMPLOYEE 81  |  -.0903794   .0847104    -1.07   0.286    -.2564113    .0756524
     EMPLOYEE 83  |   .0475438   .0495802     0.96   0.338    -.0496331    .1447206
     EMPLOYEE 84  |  -.1791775   .1325714    -1.35   0.177    -.4390167    .0806617
     EMPLOYEE 85  |  -.0965877   .0958544    -1.01   0.314    -.2844617    .0912862
     EMPLOYEE 87  |  -.0146916   .0433437    -0.34   0.735    -.0996451    .0702619
     EMPLOYEE 88  |   .0180059   .0513645     0.35   0.726    -.0826682      .11868
     EMPLOYEE 89  |   .1080324   .0480628     2.25   0.025     .0138296    .2022351
      EMPLOYEE 9  |   .0023613   .0492116     0.05   0.962    -.0940932    .0988158
     EMPLOYEE 90  |  -.0799968   .0795914    -1.01   0.315    -.2359954    .0760018
     EMPLOYEE 91  |  -.1404653   .1282199    -1.10   0.273    -.3917754    .1108449
     EMPLOYEE 92  |  -.0728458   .1350468    -0.54   0.590    -.3375366     .191845
     EMPLOYEE 93  |   .1564801   .1004734     1.56   0.119    -.0404473    .3534074
     EMPLOYEE 94  |  -.1016856   .1218157    -0.83   0.404    -.3404435    .1370724
     EMPLOYEE 95  |   .0477174   .0819386     0.58   0.560    -.1128817    .2083166
     EMPLOYEE 96  |   .0177398   .0685748     0.26   0.796    -.1166662    .1521459
     EMPLOYEE 97  |  -.0019481   .0422833    -0.05   0.963    -.0848232     .080927
     EMPLOYEE 99  |          0  (omitted)
                  |
            _cons |   .1352087   .5564027     0.24   0.808    -.9553372    1.225755
-----------------------------------------------------------------------------------

. predict workres, resid

. reg workres res_leave

      Source |       SS           df       MS      Number of obs   =    80,223
-------------+----------------------------------   F(1, 80221)     =    105.56
       Model |  11.8619667         1  11.8619667   Prob > F        =    0.0000
    Residual |  9014.52331    80,221  .112371116   R-squared       =    0.0013
-------------+----------------------------------   Adj R-squared   =    0.0013
       Total |  9026.38528    80,222   .11251758   Root MSE        =    .33522

------------------------------------------------------------------------------
     workres | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
   res_leave |   .0036267    .000353    10.27   0.000     .0029349    .0043186
       _cons |   8.81e-17   .0011835     0.00   1.000    -.0023197    .0023197
------------------------------------------------------------------------------

. predict residpsel
(option xb assumed; fitted values)

. qui summ work if dayofweek<5 & dayofweek>0

. replace residpsel = r(mean)+residpsel if dayofweek<5 & dayofweek>0
(58,254 real changes made)

. qui summ work if dayofweek==6 | dayofweek==0

. replace residpsel = r(mean)+residpsel if dayofweek==6 | dayofweek==0
(9,090 real changes made)

. twoway (histogram psel  if dayofweek<5 & dayofweek>0 & work==0,lcolor(gs12) fcolor(gs12) bin(15) frequency 
> ) (histogram residpsel  if dayofweek<5 & dayofweek>0 & work==1,fcolor(none) lcolor(red) bin(15) frequency) 
>   ,xtitle("Propensity Score")  legend(order(1 "Not Work" 2 "Work" ))

. graph export out/01_07_resid_propscore_hist_mon_thurs.pdf,replace
file out/01_07_resid_propscore_hist_mon_thurs.pdf saved as PDF format

. twoway  (histogram psel  if dayofweek==6 | dayofweek==0 & work==0,lcolor(gs12) fcolor(gs12) bin(15) frequen
> cy )  (histogram residpsel  if dayofweek==6 | dayofweek==0 & work==1,fcolor(none) lcolor(red) bin(15) frequ
> ency),xtitle("Propensity Score")  legend(order(1 "Not Work" 2 "Work" ))

. graph export out/01_07_resid_propscore_hist_weekend.pdf,replace
file out/01_07_resid_propscore_hist_weekend.pdf saved as PDF format

. 
. *** try rescaled onto resistance. only plot over portions where we have good propensity score coverage.

. estimates restore est1
(results est1 are active now)

. margins if dayofweek<5 & dayofweek>0, expression(normal((xb(matched_injury)-tanh([/athrho])*invnormal(adj_d
> iv_8_leave_count) )/(1-tanh([/athrho])^2)^(1/2))) at(adj_div_8_leave_count=(0.85(0.01)0.95))
warning: prediction constant over observations.
--Break--
r(1);

. 
. marginsplot, xlabel(0.85(0.01)0.95) recast(line) recastci(rarea) plot1opts(lcolor(black)) ciopt(fcolor(blac
> k%0) lcolor(black) lpattern(dash)) derivlabels mcompare(bonferroni) ytitle("Marginal Treatment Effect") xti
> tle("Private Resistance to Work") nolabels title("")
previous command was not margins
r(301);

. graph export out/01_07_mte_mon_thurs.pdf, replace
no Graph window open
r(601);

. 
. estimates restore est1
(results est1 are active now)

. margins if dayofweek==6 | dayofweek==0, expression(normal((xb(matched_injury)-tanh([/athrho])*invnormal(adj
> _div_8_leave_count) )/(1-tanh([/athrho])^2)^(1/2))) at(adj_div_8_leave_count=(0.3(0.01)0.5))
warning: prediction constant over observations.
--Break--
r(1);

. 
. marginsplot, xlabel(0.3(0.01)0.5) recast(line) recastci(rarea) plot1opts(lcolor(black)) ciopt(fcolor(black%
> 0) lcolor(black) lpattern(dash)) derivlabels mcompare(bonferroni) ytitle("Marginal Probability of Injury") 
> xtitle("Private Resistance to Work") nolabels title("")
previous command was not margins
r(301);

. graph export out/01_07_mte_weekend.pdf, replace
no Graph window open
r(601);

. 
. 
. ** table of average elasticies (work, injury given work)

. estimates restore est1
(results est1 are active now)

. eststo m1: margins if dayofweek<5 & dayofweek>0, eyex(adj_div_8_leave_count  seniority_rank max_rate) predi
> ct( psel) post
--Break--
r(1);

. estimates restore est1
(results est1 are active now)

. eststo m2: margins if dayofweek<5 & dayofweek>0, eyex(adj_div_8_leave_count  seniority_rank max_rate) predi
> ct( pcond) post
--Break--
r(1);

. esttab m1 m2  using out/1_07_average_elast.tex, unstack se replace nomtitle label eqlabels("Work" "Injury C
> onditional on Work")  nonumbers
estimation result m1 not found
r(111);

. 
. ** some margins plot

. estimates restore est1
(results est1 are active now)

. margins if dayofweek<5 & dayofweek>0, predict(pcond) at(adj_div_8_leave_count =(0(10)100))
--Break--
r(1);

. marginsplot, xlabel(0(10)100) recast(line) recastci(rarea) plot1opts(lcolor(black)) ciopt(fcolor(black%0) l
> color(black) lpattern(dash)) derivlabels mcompare(bonferroni) ytitle("Pr(Injury=1|Work=1)") nolabels title(
> "")
previous command was not margins
r(301);

. graph export out/01_07_marginsplot_leave_mon_thurs.pdf, replace
no Graph window open
r(601);

. 
. estimates restore est1
(results est1 are active now)

. margins if dayofweek==6 | dayofweek==0, predict(pcond) at(adj_div_8_leave_count =(0(10)100))
--Break--
r(1);

. marginsplot, xlabel(0(10)100) recast(line) recastci(rarea) plot1opts(lcolor(black)) ciopt(fcolor(black%0) l
> color(black) lpattern(dash)) derivlabels mcompare(bonferroni) ytitle("Pr(Injury=1|Work=1)") nolabels title(
> "")
previous command was not margins
r(301);

. graph export out/01_07_marginsplot_leave_weekend.pdf, replace
no Graph window open
r(601);

. 
. estimates restore est1
(results est1 are active now)

. margins, predict(pcond) at(adj_div_8_leave_count =(0(10)100)) vce(unconditional)
--Break--
r(1);

. marginsplot, xlabel(0(10)100) recast(line) recastci(rarea) plot1opts(lcolor(black)) ciopt(fcolor(black%0) l
> color(black) lpattern(dash)) derivlabels mcompare(bonferroni) ytitle("Pr(Injury=1|Work=1)") nolabels title(
> "")
previous command was not margins
r(301);

. graph export out/01_07_marginsplot_leave.pdf, replace
no Graph window open
r(601);

. clear all

. clear all

. cap log close
